sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/**
  ******************************************************************************
  * @file    vdo_reg.h
  * @version V1.2
  * @date    2020-10-09
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __VDO_REG_H__
#define __VDO_REG_H__
#include "bl808.h"

/* 0x0 : vdo_h264_encoder_ctrl */
#define VDO_H264_ENCODER_CTRL_OFFSET                            (0x0)
#define VDO_CFG_ENC_CTRL_MBY_IDX                                VDO_CFG_ENC_CTRL_MBY_IDX
#define VDO_CFG_ENC_CTRL_MBY_IDX_POS                            (0U)
#define VDO_CFG_ENC_CTRL_MBY_IDX_LEN                            (7U)
#define VDO_CFG_ENC_CTRL_MBY_IDX_MSK                            (((1U<<VDO_CFG_ENC_CTRL_MBY_IDX_LEN)-1)<<VDO_CFG_ENC_CTRL_MBY_IDX_POS)
#define VDO_CFG_ENC_CTRL_MBY_IDX_UMSK                           (~(((1U<<VDO_CFG_ENC_CTRL_MBY_IDX_LEN)-1)<<VDO_CFG_ENC_CTRL_MBY_IDX_POS))
#define VDO_CFG_CORE_CLK_EN                                     VDO_CFG_CORE_CLK_EN
#define VDO_CFG_CORE_CLK_EN_POS                                 (8U)
#define VDO_CFG_CORE_CLK_EN_LEN                                 (1U)
#define VDO_CFG_CORE_CLK_EN_MSK                                 (((1U<<VDO_CFG_CORE_CLK_EN_LEN)-1)<<VDO_CFG_CORE_CLK_EN_POS)
#define VDO_CFG_CORE_CLK_EN_UMSK                                (~(((1U<<VDO_CFG_CORE_CLK_EN_LEN)-1)<<VDO_CFG_CORE_CLK_EN_POS))
#define VDO_CFG_ZSTUF_DIS                                       VDO_CFG_ZSTUF_DIS
#define VDO_CFG_ZSTUF_DIS_POS                                   (9U)
#define VDO_CFG_ZSTUF_DIS_LEN                                   (1U)
#define VDO_CFG_ZSTUF_DIS_MSK                                   (((1U<<VDO_CFG_ZSTUF_DIS_LEN)-1)<<VDO_CFG_ZSTUF_DIS_POS)
#define VDO_CFG_ZSTUF_DIS_UMSK                                  (~(((1U<<VDO_CFG_ZSTUF_DIS_LEN)-1)<<VDO_CFG_ZSTUF_DIS_POS))
#define VDO_CFG_QR_UPD                                          VDO_CFG_QR_UPD
#define VDO_CFG_QR_UPD_POS                                      (10U)
#define VDO_CFG_QR_UPD_LEN                                      (1U)
#define VDO_CFG_QR_UPD_MSK                                      (((1U<<VDO_CFG_QR_UPD_LEN)-1)<<VDO_CFG_QR_UPD_POS)
#define VDO_CFG_QR_UPD_UMSK                                     (~(((1U<<VDO_CFG_QR_UPD_LEN)-1)<<VDO_CFG_QR_UPD_POS))
#define VDO_CFG_S_QR_UPD                                        VDO_CFG_S_QR_UPD
#define VDO_CFG_S_QR_UPD_POS                                    (11U)
#define VDO_CFG_S_QR_UPD_LEN                                    (1U)
#define VDO_CFG_S_QR_UPD_MSK                                    (((1U<<VDO_CFG_S_QR_UPD_LEN)-1)<<VDO_CFG_S_QR_UPD_POS)
#define VDO_CFG_S_QR_UPD_UMSK                                   (~(((1U<<VDO_CFG_S_QR_UPD_LEN)-1)<<VDO_CFG_S_QR_UPD_POS))
#define VDO_CFG_MEM_CLK_EN                                      VDO_CFG_MEM_CLK_EN
#define VDO_CFG_MEM_CLK_EN_POS                                  (12U)
#define VDO_CFG_MEM_CLK_EN_LEN                                  (1U)
#define VDO_CFG_MEM_CLK_EN_MSK                                  (((1U<<VDO_CFG_MEM_CLK_EN_LEN)-1)<<VDO_CFG_MEM_CLK_EN_POS)
#define VDO_CFG_MEM_CLK_EN_UMSK                                 (~(((1U<<VDO_CFG_MEM_CLK_EN_LEN)-1)<<VDO_CFG_MEM_CLK_EN_POS))
#define VDO_CFG_RC_GOP_UPD                                      VDO_CFG_RC_GOP_UPD
#define VDO_CFG_RC_GOP_UPD_POS                                  (13U)
#define VDO_CFG_RC_GOP_UPD_LEN                                  (1U)
#define VDO_CFG_RC_GOP_UPD_MSK                                  (((1U<<VDO_CFG_RC_GOP_UPD_LEN)-1)<<VDO_CFG_RC_GOP_UPD_POS)
#define VDO_CFG_RC_GOP_UPD_UMSK                                 (~(((1U<<VDO_CFG_RC_GOP_UPD_LEN)-1)<<VDO_CFG_RC_GOP_UPD_POS))
#define VDO_CFG_S_RC_GOP_UPD                                    VDO_CFG_S_RC_GOP_UPD
#define VDO_CFG_S_RC_GOP_UPD_POS                                (14U)
#define VDO_CFG_S_RC_GOP_UPD_LEN                                (1U)
#define VDO_CFG_S_RC_GOP_UPD_MSK                                (((1U<<VDO_CFG_S_RC_GOP_UPD_LEN)-1)<<VDO_CFG_S_RC_GOP_UPD_POS)
#define VDO_CFG_S_RC_GOP_UPD_UMSK                               (~(((1U<<VDO_CFG_S_RC_GOP_UPD_LEN)-1)<<VDO_CFG_S_RC_GOP_UPD_POS))
#define VDO_CFG_DUO_BS_EN                                       VDO_CFG_DUO_BS_EN
#define VDO_CFG_DUO_BS_EN_POS                                   (15U)
#define VDO_CFG_DUO_BS_EN_LEN                                   (1U)
#define VDO_CFG_DUO_BS_EN_MSK                                   (((1U<<VDO_CFG_DUO_BS_EN_LEN)-1)<<VDO_CFG_DUO_BS_EN_POS)
#define VDO_CFG_DUO_BS_EN_UMSK                                  (~(((1U<<VDO_CFG_DUO_BS_EN_LEN)-1)<<VDO_CFG_DUO_BS_EN_POS))
#define VDO_CFG_BUF_CLR                                         VDO_CFG_BUF_CLR
#define VDO_CFG_BUF_CLR_POS                                     (16U)
#define VDO_CFG_BUF_CLR_LEN                                     (1U)
#define VDO_CFG_BUF_CLR_MSK                                     (((1U<<VDO_CFG_BUF_CLR_LEN)-1)<<VDO_CFG_BUF_CLR_POS)
#define VDO_CFG_BUF_CLR_UMSK                                    (~(((1U<<VDO_CFG_BUF_CLR_LEN)-1)<<VDO_CFG_BUF_CLR_POS))
#define VDO_CFG_S_BUF_CLR                                       VDO_CFG_S_BUF_CLR
#define VDO_CFG_S_BUF_CLR_POS                                   (17U)
#define VDO_CFG_S_BUF_CLR_LEN                                   (1U)
#define VDO_CFG_S_BUF_CLR_MSK                                   (((1U<<VDO_CFG_S_BUF_CLR_LEN)-1)<<VDO_CFG_S_BUF_CLR_POS)
#define VDO_CFG_S_BUF_CLR_UMSK                                  (~(((1U<<VDO_CFG_S_BUF_CLR_LEN)-1)<<VDO_CFG_S_BUF_CLR_POS))
#define VDO_CFG_VDONR_EN                                        VDO_CFG_VDONR_EN
#define VDO_CFG_VDONR_EN_POS                                    (18U)
#define VDO_CFG_VDONR_EN_LEN                                    (1U)
#define VDO_CFG_VDONR_EN_MSK                                    (((1U<<VDO_CFG_VDONR_EN_LEN)-1)<<VDO_CFG_VDONR_EN_POS)
#define VDO_CFG_VDONR_EN_UMSK                                   (~(((1U<<VDO_CFG_VDONR_EN_LEN)-1)<<VDO_CFG_VDONR_EN_POS))
#define VDO_CFG_S_VDONR_EN                                      VDO_CFG_S_VDONR_EN
#define VDO_CFG_S_VDONR_EN_POS                                  (19U)
#define VDO_CFG_S_VDONR_EN_LEN                                  (1U)
#define VDO_CFG_S_VDONR_EN_MSK                                  (((1U<<VDO_CFG_S_VDONR_EN_LEN)-1)<<VDO_CFG_S_VDONR_EN_POS)
#define VDO_CFG_S_VDONR_EN_UMSK                                 (~(((1U<<VDO_CFG_S_VDONR_EN_LEN)-1)<<VDO_CFG_S_VDONR_EN_POS))
#define VDO_CFG_BS_STATUS_INIT                                  VDO_CFG_BS_STATUS_INIT
#define VDO_CFG_BS_STATUS_INIT_POS                              (20U)
#define VDO_CFG_BS_STATUS_INIT_LEN                              (1U)
#define VDO_CFG_BS_STATUS_INIT_MSK                              (((1U<<VDO_CFG_BS_STATUS_INIT_LEN)-1)<<VDO_CFG_BS_STATUS_INIT_POS)
#define VDO_CFG_BS_STATUS_INIT_UMSK                             (~(((1U<<VDO_CFG_BS_STATUS_INIT_LEN)-1)<<VDO_CFG_BS_STATUS_INIT_POS))
#define VDO_CFG_S_BS_STATUS_INIT                                VDO_CFG_S_BS_STATUS_INIT
#define VDO_CFG_S_BS_STATUS_INIT_POS                            (21U)
#define VDO_CFG_S_BS_STATUS_INIT_LEN                            (1U)
#define VDO_CFG_S_BS_STATUS_INIT_MSK                            (((1U<<VDO_CFG_S_BS_STATUS_INIT_LEN)-1)<<VDO_CFG_S_BS_STATUS_INIT_POS)
#define VDO_CFG_S_BS_STATUS_INIT_UMSK                           (~(((1U<<VDO_CFG_S_BS_STATUS_INIT_LEN)-1)<<VDO_CFG_S_BS_STATUS_INIT_POS))
#define VDO_CFG_SRC_LINE_CLR                                    VDO_CFG_SRC_LINE_CLR
#define VDO_CFG_SRC_LINE_CLR_POS                                (22U)
#define VDO_CFG_SRC_LINE_CLR_LEN                                (1U)
#define VDO_CFG_SRC_LINE_CLR_MSK                                (((1U<<VDO_CFG_SRC_LINE_CLR_LEN)-1)<<VDO_CFG_SRC_LINE_CLR_POS)
#define VDO_CFG_SRC_LINE_CLR_UMSK                               (~(((1U<<VDO_CFG_SRC_LINE_CLR_LEN)-1)<<VDO_CFG_SRC_LINE_CLR_POS))
#define VDO_CFG_S_SRC_LINE_CLR                                  VDO_CFG_S_SRC_LINE_CLR
#define VDO_CFG_S_SRC_LINE_CLR_POS                              (23U)
#define VDO_CFG_S_SRC_LINE_CLR_LEN                              (1U)
#define VDO_CFG_S_SRC_LINE_CLR_MSK                              (((1U<<VDO_CFG_S_SRC_LINE_CLR_LEN)-1)<<VDO_CFG_S_SRC_LINE_CLR_POS)
#define VDO_CFG_S_SRC_LINE_CLR_UMSK                             (~(((1U<<VDO_CFG_S_SRC_LINE_CLR_LEN)-1)<<VDO_CFG_S_SRC_LINE_CLR_POS))
#define VDO_CFG_CTRL_MODE                                       VDO_CFG_CTRL_MODE
#define VDO_CFG_CTRL_MODE_POS                                   (24U)
#define VDO_CFG_CTRL_MODE_LEN                                   (2U)
#define VDO_CFG_CTRL_MODE_MSK                                   (((1U<<VDO_CFG_CTRL_MODE_LEN)-1)<<VDO_CFG_CTRL_MODE_POS)
#define VDO_CFG_CTRL_MODE_UMSK                                  (~(((1U<<VDO_CFG_CTRL_MODE_LEN)-1)<<VDO_CFG_CTRL_MODE_POS))
#define VDO_CFG_CREF_EN                                         VDO_CFG_CREF_EN
#define VDO_CFG_CREF_EN_POS                                     (26U)
#define VDO_CFG_CREF_EN_LEN                                     (1U)
#define VDO_CFG_CREF_EN_MSK                                     (((1U<<VDO_CFG_CREF_EN_LEN)-1)<<VDO_CFG_CREF_EN_POS)
#define VDO_CFG_CREF_EN_UMSK                                    (~(((1U<<VDO_CFG_CREF_EN_LEN)-1)<<VDO_CFG_CREF_EN_POS))
#define VDO_CFG_S_CREF_EN                                       VDO_CFG_S_CREF_EN
#define VDO_CFG_S_CREF_EN_POS                                   (27U)
#define VDO_CFG_S_CREF_EN_LEN                                   (1U)
#define VDO_CFG_S_CREF_EN_MSK                                   (((1U<<VDO_CFG_S_CREF_EN_LEN)-1)<<VDO_CFG_S_CREF_EN_POS)
#define VDO_CFG_S_CREF_EN_UMSK                                  (~(((1U<<VDO_CFG_S_CREF_EN_LEN)-1)<<VDO_CFG_S_CREF_EN_POS))
#define VDO_CFG_FRAME_START                                     VDO_CFG_FRAME_START
#define VDO_CFG_FRAME_START_POS                                 (28U)
#define VDO_CFG_FRAME_START_LEN                                 (1U)
#define VDO_CFG_FRAME_START_MSK                                 (((1U<<VDO_CFG_FRAME_START_LEN)-1)<<VDO_CFG_FRAME_START_POS)
#define VDO_CFG_FRAME_START_UMSK                                (~(((1U<<VDO_CFG_FRAME_START_LEN)-1)<<VDO_CFG_FRAME_START_POS))
#define VDO_CFG_ENC_SEQ_EN                                      VDO_CFG_ENC_SEQ_EN
#define VDO_CFG_ENC_SEQ_EN_POS                                  (29U)
#define VDO_CFG_ENC_SEQ_EN_LEN                                  (1U)
#define VDO_CFG_ENC_SEQ_EN_MSK                                  (((1U<<VDO_CFG_ENC_SEQ_EN_LEN)-1)<<VDO_CFG_ENC_SEQ_EN_POS)
#define VDO_CFG_ENC_SEQ_EN_UMSK                                 (~(((1U<<VDO_CFG_ENC_SEQ_EN_LEN)-1)<<VDO_CFG_ENC_SEQ_EN_POS))
#define VDO_CFG_S_FRAME_START                                   VDO_CFG_S_FRAME_START
#define VDO_CFG_S_FRAME_START_POS                               (30U)
#define VDO_CFG_S_FRAME_START_LEN                               (1U)
#define VDO_CFG_S_FRAME_START_MSK                               (((1U<<VDO_CFG_S_FRAME_START_LEN)-1)<<VDO_CFG_S_FRAME_START_POS)
#define VDO_CFG_S_FRAME_START_UMSK                              (~(((1U<<VDO_CFG_S_FRAME_START_LEN)-1)<<VDO_CFG_S_FRAME_START_POS))
#define VDO_CFG_S_ENC_SEQ_EN                                    VDO_CFG_S_ENC_SEQ_EN
#define VDO_CFG_S_ENC_SEQ_EN_POS                                (31U)
#define VDO_CFG_S_ENC_SEQ_EN_LEN                                (1U)
#define VDO_CFG_S_ENC_SEQ_EN_MSK                                (((1U<<VDO_CFG_S_ENC_SEQ_EN_LEN)-1)<<VDO_CFG_S_ENC_SEQ_EN_POS)
#define VDO_CFG_S_ENC_SEQ_EN_UMSK                               (~(((1U<<VDO_CFG_S_ENC_SEQ_EN_LEN)-1)<<VDO_CFG_S_ENC_SEQ_EN_POS))

/* 0x4 : vdo_h264_frame_size */
#define VDO_H264_FRAME_SIZE_OFFSET                              (0x4)
#define VDO_CFG_FRAME_WIDTH                                     VDO_CFG_FRAME_WIDTH
#define VDO_CFG_FRAME_WIDTH_POS                                 (0U)
#define VDO_CFG_FRAME_WIDTH_LEN                                 (11U)
#define VDO_CFG_FRAME_WIDTH_MSK                                 (((1U<<VDO_CFG_FRAME_WIDTH_LEN)-1)<<VDO_CFG_FRAME_WIDTH_POS)
#define VDO_CFG_FRAME_WIDTH_UMSK                                (~(((1U<<VDO_CFG_FRAME_WIDTH_LEN)-1)<<VDO_CFG_FRAME_WIDTH_POS))
#define VDO_CFG_FRAME_HEIGHT                                    VDO_CFG_FRAME_HEIGHT
#define VDO_CFG_FRAME_HEIGHT_POS                                (16U)
#define VDO_CFG_FRAME_HEIGHT_LEN                                (11U)
#define VDO_CFG_FRAME_HEIGHT_MSK                                (((1U<<VDO_CFG_FRAME_HEIGHT_LEN)-1)<<VDO_CFG_FRAME_HEIGHT_POS)
#define VDO_CFG_FRAME_HEIGHT_UMSK                               (~(((1U<<VDO_CFG_FRAME_HEIGHT_LEN)-1)<<VDO_CFG_FRAME_HEIGHT_POS))

/* 0x8 : vdo_h264_frame_base_addr_y */
#define VDO_H264_FRAME_BASE_ADDR_Y_OFFSET                       (0x8)
#define VDO_CFG_FRAME_BASE_ADDR_Y                               VDO_CFG_FRAME_BASE_ADDR_Y
#define VDO_CFG_FRAME_BASE_ADDR_Y_POS                           (0U)
#define VDO_CFG_FRAME_BASE_ADDR_Y_LEN                           (32U)
#define VDO_CFG_FRAME_BASE_ADDR_Y_MSK                           (((1U<<VDO_CFG_FRAME_BASE_ADDR_Y_LEN)-1)<<VDO_CFG_FRAME_BASE_ADDR_Y_POS)
#define VDO_CFG_FRAME_BASE_ADDR_Y_UMSK                          (~(((1U<<VDO_CFG_FRAME_BASE_ADDR_Y_LEN)-1)<<VDO_CFG_FRAME_BASE_ADDR_Y_POS))

/* 0xc : vdo_h264_frame_base_addr_uv */
#define VDO_H264_FRAME_BASE_ADDR_UV_OFFSET                      (0xc)
#define VDO_CFG_FRAME_BASE_ADDR_UV                              VDO_CFG_FRAME_BASE_ADDR_UV
#define VDO_CFG_FRAME_BASE_ADDR_UV_POS                          (0U)
#define VDO_CFG_FRAME_BASE_ADDR_UV_LEN                          (32U)
#define VDO_CFG_FRAME_BASE_ADDR_UV_MSK                          (((1U<<VDO_CFG_FRAME_BASE_ADDR_UV_LEN)-1)<<VDO_CFG_FRAME_BASE_ADDR_UV_POS)
#define VDO_CFG_FRAME_BASE_ADDR_UV_UMSK                         (~(((1U<<VDO_CFG_FRAME_BASE_ADDR_UV_LEN)-1)<<VDO_CFG_FRAME_BASE_ADDR_UV_POS))

