sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x10 : vdo_h264_bs_base_addr */
#define VDO_H264_BS_BASE_ADDR_OFFSET                            (0x10)
#define VDO_CFG_BS_BASE_ADDR                                    VDO_CFG_BS_BASE_ADDR
#define VDO_CFG_BS_BASE_ADDR_POS                                (0U)
#define VDO_CFG_BS_BASE_ADDR_LEN                                (32U)
#define VDO_CFG_BS_BASE_ADDR_MSK                                (((1U<<VDO_CFG_BS_BASE_ADDR_LEN)-1)<<VDO_CFG_BS_BASE_ADDR_POS)
#define VDO_CFG_BS_BASE_ADDR_UMSK                               (~(((1U<<VDO_CFG_BS_BASE_ADDR_LEN)-1)<<VDO_CFG_BS_BASE_ADDR_POS))

/* 0x14 : vdo_h264_lb_base_addr */
#define VDO_H264_LB_BASE_ADDR_OFFSET                            (0x14)
#define VDO_CFG_LB_BASE_ADDR                                    VDO_CFG_LB_BASE_ADDR
#define VDO_CFG_LB_BASE_ADDR_POS                                (0U)
#define VDO_CFG_LB_BASE_ADDR_LEN                                (32U)
#define VDO_CFG_LB_BASE_ADDR_MSK                                (((1U<<VDO_CFG_LB_BASE_ADDR_LEN)-1)<<VDO_CFG_LB_BASE_ADDR_POS)
#define VDO_CFG_LB_BASE_ADDR_UMSK                               (~(((1U<<VDO_CFG_LB_BASE_ADDR_LEN)-1)<<VDO_CFG_LB_BASE_ADDR_POS))

/* 0x18 : vdo_h264_bs_size */
#define VDO_H264_BS_SIZE_OFFSET                                 (0x18)
#define VDO_CFG_BS_SIZE                                         VDO_CFG_BS_SIZE
#define VDO_CFG_BS_SIZE_POS                                     (0U)
#define VDO_CFG_BS_SIZE_LEN                                     (32U)
#define VDO_CFG_BS_SIZE_MSK                                     (((1U<<VDO_CFG_BS_SIZE_LEN)-1)<<VDO_CFG_BS_SIZE_POS)
#define VDO_CFG_BS_SIZE_UMSK                                    (~(((1U<<VDO_CFG_BS_SIZE_LEN)-1)<<VDO_CFG_BS_SIZE_POS))

/* 0x1c : vdo_h264_bs_full_thr */
#define VDO_H264_BS_FULL_THR_OFFSET                             (0x1c)
#define VDO_CFG_BS_FULL_THR                                     VDO_CFG_BS_FULL_THR
#define VDO_CFG_BS_FULL_THR_POS                                 (0U)
#define VDO_CFG_BS_FULL_THR_LEN                                 (32U)
#define VDO_CFG_BS_FULL_THR_MSK                                 (((1U<<VDO_CFG_BS_FULL_THR_LEN)-1)<<VDO_CFG_BS_FULL_THR_POS)
#define VDO_CFG_BS_FULL_THR_UMSK                                (~(((1U<<VDO_CFG_BS_FULL_THR_LEN)-1)<<VDO_CFG_BS_FULL_THR_POS))

/* 0x20 : vdo_h264_src_bf_height */
#define VDO_H264_SRC_BF_HEIGHT_OFFSET                           (0x20)
#define VDO_CFG_C_SRC_BF_HEIGHT                                 VDO_CFG_C_SRC_BF_HEIGHT
#define VDO_CFG_C_SRC_BF_HEIGHT_POS                             (0U)
#define VDO_CFG_C_SRC_BF_HEIGHT_LEN                             (15U)
#define VDO_CFG_C_SRC_BF_HEIGHT_MSK                             (((1U<<VDO_CFG_C_SRC_BF_HEIGHT_LEN)-1)<<VDO_CFG_C_SRC_BF_HEIGHT_POS)
#define VDO_CFG_C_SRC_BF_HEIGHT_UMSK                            (~(((1U<<VDO_CFG_C_SRC_BF_HEIGHT_LEN)-1)<<VDO_CFG_C_SRC_BF_HEIGHT_POS))
#define VDO_CFG_Y_SRC_BF_HEIGHT                                 VDO_CFG_Y_SRC_BF_HEIGHT
#define VDO_CFG_Y_SRC_BF_HEIGHT_POS                             (16U)
#define VDO_CFG_Y_SRC_BF_HEIGHT_LEN                             (15U)
#define VDO_CFG_Y_SRC_BF_HEIGHT_MSK                             (((1U<<VDO_CFG_Y_SRC_BF_HEIGHT_LEN)-1)<<VDO_CFG_Y_SRC_BF_HEIGHT_POS)
#define VDO_CFG_Y_SRC_BF_HEIGHT_UMSK                            (~(((1U<<VDO_CFG_Y_SRC_BF_HEIGHT_LEN)-1)<<VDO_CFG_Y_SRC_BF_HEIGHT_POS))

/* 0x24 : vdo_core_reg0 */
#define VDO_CORE_REG0_OFFSET                                    (0x24)
#define VDO_ENC_EN                                              VDO_ENC_EN
#define VDO_ENC_EN_POS                                          (0U)
#define VDO_ENC_EN_LEN                                          (1U)
#define VDO_ENC_EN_MSK                                          (((1U<<VDO_ENC_EN_LEN)-1)<<VDO_ENC_EN_POS)
#define VDO_ENC_EN_UMSK                                         (~(((1U<<VDO_ENC_EN_LEN)-1)<<VDO_ENC_EN_POS))
#define VDO_VUI_ASPECT_INFO                                     VDO_VUI_ASPECT_INFO
#define VDO_VUI_ASPECT_INFO_POS                                 (12U)
#define VDO_VUI_ASPECT_INFO_LEN                                 (1U)
#define VDO_VUI_ASPECT_INFO_MSK                                 (((1U<<VDO_VUI_ASPECT_INFO_LEN)-1)<<VDO_VUI_ASPECT_INFO_POS)
#define VDO_VUI_ASPECT_INFO_UMSK                                (~(((1U<<VDO_VUI_ASPECT_INFO_LEN)-1)<<VDO_VUI_ASPECT_INFO_POS))
#define VDO_VUI_FIXED_F_RATE                                    VDO_VUI_FIXED_F_RATE
#define VDO_VUI_FIXED_F_RATE_POS                                (13U)
#define VDO_VUI_FIXED_F_RATE_LEN                                (1U)
#define VDO_VUI_FIXED_F_RATE_MSK                                (((1U<<VDO_VUI_FIXED_F_RATE_LEN)-1)<<VDO_VUI_FIXED_F_RATE_POS)
#define VDO_VUI_FIXED_F_RATE_UMSK                               (~(((1U<<VDO_VUI_FIXED_F_RATE_LEN)-1)<<VDO_VUI_FIXED_F_RATE_POS))
#define VDO_VUI_TIMING_INFO                                     VDO_VUI_TIMING_INFO
#define VDO_VUI_TIMING_INFO_POS                                 (14U)
#define VDO_VUI_TIMING_INFO_LEN                                 (1U)
#define VDO_VUI_TIMING_INFO_MSK                                 (((1U<<VDO_VUI_TIMING_INFO_LEN)-1)<<VDO_VUI_TIMING_INFO_POS)
#define VDO_VUI_TIMING_INFO_UMSK                                (~(((1U<<VDO_VUI_TIMING_INFO_LEN)-1)<<VDO_VUI_TIMING_INFO_POS))
#define VDO_IDR_ENABLE                                          VDO_IDR_ENABLE
#define VDO_IDR_ENABLE_POS                                      (15U)
#define VDO_IDR_ENABLE_LEN                                      (1U)
#define VDO_IDR_ENABLE_MSK                                      (((1U<<VDO_IDR_ENABLE_LEN)-1)<<VDO_IDR_ENABLE_POS)
#define VDO_IDR_ENABLE_UMSK                                     (~(((1U<<VDO_IDR_ENABLE_LEN)-1)<<VDO_IDR_ENABLE_POS))
#define VDO_S_ENC_EN                                            VDO_S_ENC_EN
#define VDO_S_ENC_EN_POS                                        (16U)
#define VDO_S_ENC_EN_LEN                                        (1U)
#define VDO_S_ENC_EN_MSK                                        (((1U<<VDO_S_ENC_EN_LEN)-1)<<VDO_S_ENC_EN_POS)
#define VDO_S_ENC_EN_UMSK                                       (~(((1U<<VDO_S_ENC_EN_LEN)-1)<<VDO_S_ENC_EN_POS))
#define VDO_S_VUI_ASPECT_INFO                                   VDO_S_VUI_ASPECT_INFO
#define VDO_S_VUI_ASPECT_INFO_POS                               (28U)
#define VDO_S_VUI_ASPECT_INFO_LEN                               (1U)
#define VDO_S_VUI_ASPECT_INFO_MSK                               (((1U<<VDO_S_VUI_ASPECT_INFO_LEN)-1)<<VDO_S_VUI_ASPECT_INFO_POS)
#define VDO_S_VUI_ASPECT_INFO_UMSK                              (~(((1U<<VDO_S_VUI_ASPECT_INFO_LEN)-1)<<VDO_S_VUI_ASPECT_INFO_POS))
#define VDO_S_VUI_FIXED_F_RATE                                  VDO_S_VUI_FIXED_F_RATE
#define VDO_S_VUI_FIXED_F_RATE_POS                              (29U)
#define VDO_S_VUI_FIXED_F_RATE_LEN                              (1U)
#define VDO_S_VUI_FIXED_F_RATE_MSK                              (((1U<<VDO_S_VUI_FIXED_F_RATE_LEN)-1)<<VDO_S_VUI_FIXED_F_RATE_POS)
#define VDO_S_VUI_FIXED_F_RATE_UMSK                             (~(((1U<<VDO_S_VUI_FIXED_F_RATE_LEN)-1)<<VDO_S_VUI_FIXED_F_RATE_POS))
#define VDO_S_VUI_TIMING_INFO                                   VDO_S_VUI_TIMING_INFO
#define VDO_S_VUI_TIMING_INFO_POS                               (30U)
#define VDO_S_VUI_TIMING_INFO_LEN                               (1U)
#define VDO_S_VUI_TIMING_INFO_MSK                               (((1U<<VDO_S_VUI_TIMING_INFO_LEN)-1)<<VDO_S_VUI_TIMING_INFO_POS)
#define VDO_S_VUI_TIMING_INFO_UMSK                              (~(((1U<<VDO_S_VUI_TIMING_INFO_LEN)-1)<<VDO_S_VUI_TIMING_INFO_POS))
#define VDO_S_IDR_ENABLE                                        VDO_S_IDR_ENABLE
#define VDO_S_IDR_ENABLE_POS                                    (31U)
#define VDO_S_IDR_ENABLE_LEN                                    (1U)
#define VDO_S_IDR_ENABLE_MSK                                    (((1U<<VDO_S_IDR_ENABLE_LEN)-1)<<VDO_S_IDR_ENABLE_POS)
#define VDO_S_IDR_ENABLE_UMSK                                   (~(((1U<<VDO_S_IDR_ENABLE_LEN)-1)<<VDO_S_IDR_ENABLE_POS))

/* 0x28 : vdo_core_reg1 */
#define VDO_CORE_REG1_OFFSET                                    (0x28)
#define VDO_IMG_WIDTH                                           VDO_IMG_WIDTH
#define VDO_IMG_WIDTH_POS                                       (0U)
#define VDO_IMG_WIDTH_LEN                                       (11U)
#define VDO_IMG_WIDTH_MSK                                       (((1U<<VDO_IMG_WIDTH_LEN)-1)<<VDO_IMG_WIDTH_POS)
#define VDO_IMG_WIDTH_UMSK                                      (~(((1U<<VDO_IMG_WIDTH_LEN)-1)<<VDO_IMG_WIDTH_POS))
#define VDO_S_IMG_WIDTH                                         VDO_S_IMG_WIDTH
#define VDO_S_IMG_WIDTH_POS                                     (16U)
#define VDO_S_IMG_WIDTH_LEN                                     (11U)
#define VDO_S_IMG_WIDTH_MSK                                     (((1U<<VDO_S_IMG_WIDTH_LEN)-1)<<VDO_S_IMG_WIDTH_POS)
#define VDO_S_IMG_WIDTH_UMSK                                    (~(((1U<<VDO_S_IMG_WIDTH_LEN)-1)<<VDO_S_IMG_WIDTH_POS))

/* 0x2c : vdo_core_reg2 */
#define VDO_CORE_REG2_OFFSET                                    (0x2c)
#define VDO_IMG_HEIGHT                                          VDO_IMG_HEIGHT
#define VDO_IMG_HEIGHT_POS                                      (0U)
#define VDO_IMG_HEIGHT_LEN                                      (11U)
#define VDO_IMG_HEIGHT_MSK                                      (((1U<<VDO_IMG_HEIGHT_LEN)-1)<<VDO_IMG_HEIGHT_POS)
#define VDO_IMG_HEIGHT_UMSK                                     (~(((1U<<VDO_IMG_HEIGHT_LEN)-1)<<VDO_IMG_HEIGHT_POS))
#define VDO_S_IMG_HEIGHT                                        VDO_S_IMG_HEIGHT
#define VDO_S_IMG_HEIGHT_POS                                    (16U)
#define VDO_S_IMG_HEIGHT_LEN                                    (11U)
#define VDO_S_IMG_HEIGHT_MSK                                    (((1U<<VDO_S_IMG_HEIGHT_LEN)-1)<<VDO_S_IMG_HEIGHT_POS)
#define VDO_S_IMG_HEIGHT_UMSK                                   (~(((1U<<VDO_S_IMG_HEIGHT_LEN)-1)<<VDO_S_IMG_HEIGHT_POS))

