sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x30 : vdo_core_reg3 */
#define VDO_CORE_REG3_OFFSET                                    (0x30)
#define VDO_TARGET_I_QP                                         VDO_TARGET_I_QP
#define VDO_TARGET_I_QP_POS                                     (0U)
#define VDO_TARGET_I_QP_LEN                                     (6U)
#define VDO_TARGET_I_QP_MSK                                     (((1U<<VDO_TARGET_I_QP_LEN)-1)<<VDO_TARGET_I_QP_POS)
#define VDO_TARGET_I_QP_UMSK                                    (~(((1U<<VDO_TARGET_I_QP_LEN)-1)<<VDO_TARGET_I_QP_POS))
#define VDO_S_TARGET_I_QP                                       VDO_S_TARGET_I_QP
#define VDO_S_TARGET_I_QP_POS                                   (16U)
#define VDO_S_TARGET_I_QP_LEN                                   (6U)
#define VDO_S_TARGET_I_QP_MSK                                   (((1U<<VDO_S_TARGET_I_QP_LEN)-1)<<VDO_S_TARGET_I_QP_POS)
#define VDO_S_TARGET_I_QP_UMSK                                  (~(((1U<<VDO_S_TARGET_I_QP_LEN)-1)<<VDO_S_TARGET_I_QP_POS))

/* 0x34 : vdo_core_reg4 */
#define VDO_CORE_REG4_OFFSET                                    (0x34)
#define VDO_CQP_OFFSET                                          VDO_CQP_OFFSET
#define VDO_CQP_OFFSET_POS                                      (0U)
#define VDO_CQP_OFFSET_LEN                                      (5U)
#define VDO_CQP_OFFSET_MSK                                      (((1U<<VDO_CQP_OFFSET_LEN)-1)<<VDO_CQP_OFFSET_POS)
#define VDO_CQP_OFFSET_UMSK                                     (~(((1U<<VDO_CQP_OFFSET_LEN)-1)<<VDO_CQP_OFFSET_POS))
#define VDO_S_CQP_OFFSET                                        VDO_S_CQP_OFFSET
#define VDO_S_CQP_OFFSET_POS                                    (16U)
#define VDO_S_CQP_OFFSET_LEN                                    (5U)
#define VDO_S_CQP_OFFSET_MSK                                    (((1U<<VDO_S_CQP_OFFSET_LEN)-1)<<VDO_S_CQP_OFFSET_POS)
#define VDO_S_CQP_OFFSET_UMSK                                   (~(((1U<<VDO_S_CQP_OFFSET_LEN)-1)<<VDO_S_CQP_OFFSET_POS))

/* 0x38 : vdo_core_reg5 */
#define VDO_CORE_REG5_OFFSET                                    (0x38)
#define VDO_TARGET_P_QP                                         VDO_TARGET_P_QP
#define VDO_TARGET_P_QP_POS                                     (0U)
#define VDO_TARGET_P_QP_LEN                                     (6U)
#define VDO_TARGET_P_QP_MSK                                     (((1U<<VDO_TARGET_P_QP_LEN)-1)<<VDO_TARGET_P_QP_POS)
#define VDO_TARGET_P_QP_UMSK                                    (~(((1U<<VDO_TARGET_P_QP_LEN)-1)<<VDO_TARGET_P_QP_POS))
#define VDO_S_TARGET_P_QP                                       VDO_S_TARGET_P_QP
#define VDO_S_TARGET_P_QP_POS                                   (16U)
#define VDO_S_TARGET_P_QP_LEN                                   (6U)
#define VDO_S_TARGET_P_QP_MSK                                   (((1U<<VDO_S_TARGET_P_QP_LEN)-1)<<VDO_S_TARGET_P_QP_POS)
#define VDO_S_TARGET_P_QP_UMSK                                  (~(((1U<<VDO_S_TARGET_P_QP_LEN)-1)<<VDO_S_TARGET_P_QP_POS))

/* 0x3c : vdo_core_reg6 */
#define VDO_CORE_REG6_OFFSET                                    (0x3c)
#define VDO_MB_LINES                                            VDO_MB_LINES
#define VDO_MB_LINES_POS                                        (0U)
#define VDO_MB_LINES_LEN                                        (7U)
#define VDO_MB_LINES_MSK                                        (((1U<<VDO_MB_LINES_LEN)-1)<<VDO_MB_LINES_POS)
#define VDO_MB_LINES_UMSK                                       (~(((1U<<VDO_MB_LINES_LEN)-1)<<VDO_MB_LINES_POS))
#define VDO_S_MB_LINES                                          VDO_S_MB_LINES
#define VDO_S_MB_LINES_POS                                      (16U)
#define VDO_S_MB_LINES_LEN                                      (7U)
#define VDO_S_MB_LINES_MSK                                      (((1U<<VDO_S_MB_LINES_LEN)-1)<<VDO_S_MB_LINES_POS)
#define VDO_S_MB_LINES_UMSK                                     (~(((1U<<VDO_S_MB_LINES_LEN)-1)<<VDO_S_MB_LINES_POS))

/* 0x40 : vdo_core_reg7 */
#define VDO_CORE_REG7_OFFSET                                    (0x40)
#define VDO_NUM_SLICES                                          VDO_NUM_SLICES
#define VDO_NUM_SLICES_POS                                      (0U)
#define VDO_NUM_SLICES_LEN                                      (4U)
#define VDO_NUM_SLICES_MSK                                      (((1U<<VDO_NUM_SLICES_LEN)-1)<<VDO_NUM_SLICES_POS)
#define VDO_NUM_SLICES_UMSK                                     (~(((1U<<VDO_NUM_SLICES_LEN)-1)<<VDO_NUM_SLICES_POS))
#define VDO_S_NUM_SLICES                                        VDO_S_NUM_SLICES
#define VDO_S_NUM_SLICES_POS                                    (16U)
#define VDO_S_NUM_SLICES_LEN                                    (4U)
#define VDO_S_NUM_SLICES_MSK                                    (((1U<<VDO_S_NUM_SLICES_LEN)-1)<<VDO_S_NUM_SLICES_POS)
#define VDO_S_NUM_SLICES_UMSK                                   (~(((1U<<VDO_S_NUM_SLICES_LEN)-1)<<VDO_S_NUM_SLICES_POS))

/* 0x44 : vdo_core_reg8 */
#define VDO_CORE_REG8_OFFSET                                    (0x44)
#define VDO_NUM_PFRAMES                                         VDO_NUM_PFRAMES
#define VDO_NUM_PFRAMES_POS                                     (0U)
#define VDO_NUM_PFRAMES_LEN                                     (10U)
#define VDO_NUM_PFRAMES_MSK                                     (((1U<<VDO_NUM_PFRAMES_LEN)-1)<<VDO_NUM_PFRAMES_POS)
#define VDO_NUM_PFRAMES_UMSK                                    (~(((1U<<VDO_NUM_PFRAMES_LEN)-1)<<VDO_NUM_PFRAMES_POS))
#define VDO_S_NUM_PFRAMES                                       VDO_S_NUM_PFRAMES
#define VDO_S_NUM_PFRAMES_POS                                   (16U)
#define VDO_S_NUM_PFRAMES_LEN                                   (10U)
#define VDO_S_NUM_PFRAMES_MSK                                   (((1U<<VDO_S_NUM_PFRAMES_LEN)-1)<<VDO_S_NUM_PFRAMES_POS)
#define VDO_S_NUM_PFRAMES_UMSK                                  (~(((1U<<VDO_S_NUM_PFRAMES_LEN)-1)<<VDO_S_NUM_PFRAMES_POS))

/* 0x48 : vdo_core_reg9 */
#define VDO_CORE_REG9_OFFSET                                    (0x48)
#define VDO_DIS_FILTER                                          VDO_DIS_FILTER
#define VDO_DIS_FILTER_POS                                      (0U)
#define VDO_DIS_FILTER_LEN                                      (1U)
#define VDO_DIS_FILTER_MSK                                      (((1U<<VDO_DIS_FILTER_LEN)-1)<<VDO_DIS_FILTER_POS)
#define VDO_DIS_FILTER_UMSK                                     (~(((1U<<VDO_DIS_FILTER_LEN)-1)<<VDO_DIS_FILTER_POS))
#define VDO_S_DIS_FILTER                                        VDO_S_DIS_FILTER
#define VDO_S_DIS_FILTER_POS                                    (16U)
#define VDO_S_DIS_FILTER_LEN                                    (1U)
#define VDO_S_DIS_FILTER_MSK                                    (((1U<<VDO_S_DIS_FILTER_LEN)-1)<<VDO_S_DIS_FILTER_POS)
#define VDO_S_DIS_FILTER_UMSK                                   (~(((1U<<VDO_S_DIS_FILTER_LEN)-1)<<VDO_S_DIS_FILTER_POS))

/* 0x4c : vdo_core_reg10 */
#define VDO_CORE_REG10_OFFSET                                   (0x4c)
#define VDO_ALPHA_OFF                                           VDO_ALPHA_OFF
#define VDO_ALPHA_OFF_POS                                       (0U)
#define VDO_ALPHA_OFF_LEN                                       (4U)
#define VDO_ALPHA_OFF_MSK                                       (((1U<<VDO_ALPHA_OFF_LEN)-1)<<VDO_ALPHA_OFF_POS)
#define VDO_ALPHA_OFF_UMSK                                      (~(((1U<<VDO_ALPHA_OFF_LEN)-1)<<VDO_ALPHA_OFF_POS))
#define VDO_S_ALPHA_OFF                                         VDO_S_ALPHA_OFF
#define VDO_S_ALPHA_OFF_POS                                     (16U)
#define VDO_S_ALPHA_OFF_LEN                                     (4U)
#define VDO_S_ALPHA_OFF_MSK                                     (((1U<<VDO_S_ALPHA_OFF_LEN)-1)<<VDO_S_ALPHA_OFF_POS)
#define VDO_S_ALPHA_OFF_UMSK                                    (~(((1U<<VDO_S_ALPHA_OFF_LEN)-1)<<VDO_S_ALPHA_OFF_POS))

/* 0x50 : vdo_core_reg11 */
#define VDO_CORE_REG11_OFFSET                                   (0x50)
#define VDO_BETA_OFF                                            VDO_BETA_OFF
#define VDO_BETA_OFF_POS                                        (0U)
#define VDO_BETA_OFF_LEN                                        (4U)
#define VDO_BETA_OFF_MSK                                        (((1U<<VDO_BETA_OFF_LEN)-1)<<VDO_BETA_OFF_POS)
#define VDO_BETA_OFF_UMSK                                       (~(((1U<<VDO_BETA_OFF_LEN)-1)<<VDO_BETA_OFF_POS))
#define VDO_S_BETA_OFF                                          VDO_S_BETA_OFF
#define VDO_S_BETA_OFF_POS                                      (16U)
#define VDO_S_BETA_OFF_LEN                                      (4U)
#define VDO_S_BETA_OFF_MSK                                      (((1U<<VDO_S_BETA_OFF_LEN)-1)<<VDO_S_BETA_OFF_POS)
#define VDO_S_BETA_OFF_UMSK                                     (~(((1U<<VDO_S_BETA_OFF_LEN)-1)<<VDO_S_BETA_OFF_POS))

