sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x54 : vdo_core_reg12 */
#define VDO_CORE_REG12_OFFSET                                   (0x54)
#define VDO_PROFILE_IDC                                         VDO_PROFILE_IDC
#define VDO_PROFILE_IDC_POS                                     (0U)
#define VDO_PROFILE_IDC_LEN                                     (1U)
#define VDO_PROFILE_IDC_MSK                                     (((1U<<VDO_PROFILE_IDC_LEN)-1)<<VDO_PROFILE_IDC_POS)
#define VDO_PROFILE_IDC_UMSK                                    (~(((1U<<VDO_PROFILE_IDC_LEN)-1)<<VDO_PROFILE_IDC_POS))
#define VDO_S_PROFILE_IDC                                       VDO_S_PROFILE_IDC
#define VDO_S_PROFILE_IDC_POS                                   (16U)
#define VDO_S_PROFILE_IDC_LEN                                   (1U)
#define VDO_S_PROFILE_IDC_MSK                                   (((1U<<VDO_S_PROFILE_IDC_LEN)-1)<<VDO_S_PROFILE_IDC_POS)
#define VDO_S_PROFILE_IDC_UMSK                                  (~(((1U<<VDO_S_PROFILE_IDC_LEN)-1)<<VDO_S_PROFILE_IDC_POS))

/* 0x58 : vdo_core_reg13 */
#define VDO_CORE_REG13_OFFSET                                   (0x58)
#define VDO_LEVEL_IDC                                           VDO_LEVEL_IDC
#define VDO_LEVEL_IDC_POS                                       (0U)
#define VDO_LEVEL_IDC_LEN                                       (8U)
#define VDO_LEVEL_IDC_MSK                                       (((1U<<VDO_LEVEL_IDC_LEN)-1)<<VDO_LEVEL_IDC_POS)
#define VDO_LEVEL_IDC_UMSK                                      (~(((1U<<VDO_LEVEL_IDC_LEN)-1)<<VDO_LEVEL_IDC_POS))
#define VDO_S_LEVEL_IDC                                         VDO_S_LEVEL_IDC
#define VDO_S_LEVEL_IDC_POS                                     (16U)
#define VDO_S_LEVEL_IDC_LEN                                     (8U)
#define VDO_S_LEVEL_IDC_MSK                                     (((1U<<VDO_S_LEVEL_IDC_LEN)-1)<<VDO_S_LEVEL_IDC_POS)
#define VDO_S_LEVEL_IDC_UMSK                                    (~(((1U<<VDO_S_LEVEL_IDC_LEN)-1)<<VDO_S_LEVEL_IDC_POS))

/* 0x5c : vdo_core_reg14 */
#define VDO_CORE_REG14_OFFSET                                   (0x5c)
#define VDO_LUMA8X8_COST                                        VDO_LUMA8X8_COST
#define VDO_LUMA8X8_COST_POS                                    (0U)
#define VDO_LUMA8X8_COST_LEN                                    (3U)
#define VDO_LUMA8X8_COST_MSK                                    (((1U<<VDO_LUMA8X8_COST_LEN)-1)<<VDO_LUMA8X8_COST_POS)
#define VDO_LUMA8X8_COST_UMSK                                   (~(((1U<<VDO_LUMA8X8_COST_LEN)-1)<<VDO_LUMA8X8_COST_POS))
#define VDO_LUMA16X16_COST                                      VDO_LUMA16X16_COST
#define VDO_LUMA16X16_COST_POS                                  (3U)
#define VDO_LUMA16X16_COST_LEN                                  (3U)
#define VDO_LUMA16X16_COST_MSK                                  (((1U<<VDO_LUMA16X16_COST_LEN)-1)<<VDO_LUMA16X16_COST_POS)
#define VDO_LUMA16X16_COST_UMSK                                 (~(((1U<<VDO_LUMA16X16_COST_LEN)-1)<<VDO_LUMA16X16_COST_POS))
#define VDO_CHROMA8X8_COST                                      VDO_CHROMA8X8_COST
#define VDO_CHROMA8X8_COST_POS                                  (6U)
#define VDO_CHROMA8X8_COST_LEN                                  (3U)
#define VDO_CHROMA8X8_COST_MSK                                  (((1U<<VDO_CHROMA8X8_COST_LEN)-1)<<VDO_CHROMA8X8_COST_POS)
#define VDO_CHROMA8X8_COST_UMSK                                 (~(((1U<<VDO_CHROMA8X8_COST_LEN)-1)<<VDO_CHROMA8X8_COST_POS))
#define VDO_S_LUMA8X8_COST                                      VDO_S_LUMA8X8_COST
#define VDO_S_LUMA8X8_COST_POS                                  (16U)
#define VDO_S_LUMA8X8_COST_LEN                                  (3U)
#define VDO_S_LUMA8X8_COST_MSK                                  (((1U<<VDO_S_LUMA8X8_COST_LEN)-1)<<VDO_S_LUMA8X8_COST_POS)
#define VDO_S_LUMA8X8_COST_UMSK                                 (~(((1U<<VDO_S_LUMA8X8_COST_LEN)-1)<<VDO_S_LUMA8X8_COST_POS))
#define VDO_S_LUMA16X16_COST                                    VDO_S_LUMA16X16_COST
#define VDO_S_LUMA16X16_COST_POS                                (19U)
#define VDO_S_LUMA16X16_COST_LEN                                (3U)
#define VDO_S_LUMA16X16_COST_MSK                                (((1U<<VDO_S_LUMA16X16_COST_LEN)-1)<<VDO_S_LUMA16X16_COST_POS)
#define VDO_S_LUMA16X16_COST_UMSK                               (~(((1U<<VDO_S_LUMA16X16_COST_LEN)-1)<<VDO_S_LUMA16X16_COST_POS))
#define VDO_S_CHROMA8X8_COST                                    VDO_S_CHROMA8X8_COST
#define VDO_S_CHROMA8X8_COST_POS                                (22U)
#define VDO_S_CHROMA8X8_COST_LEN                                (3U)
#define VDO_S_CHROMA8X8_COST_MSK                                (((1U<<VDO_S_CHROMA8X8_COST_LEN)-1)<<VDO_S_CHROMA8X8_COST_POS)
#define VDO_S_CHROMA8X8_COST_UMSK                               (~(((1U<<VDO_S_CHROMA8X8_COST_LEN)-1)<<VDO_S_CHROMA8X8_COST_POS))

/* 0x64 : vdo_core_reg16 */
#define VDO_CORE_REG16_OFFSET                                   (0x64)
#define VDO_FRAME0                                              VDO_FRAME0
#define VDO_FRAME0_POS                                          (0U)
#define VDO_FRAME0_LEN                                          (14U)
#define VDO_FRAME0_MSK                                          (((1U<<VDO_FRAME0_LEN)-1)<<VDO_FRAME0_POS)
#define VDO_FRAME0_UMSK                                         (~(((1U<<VDO_FRAME0_LEN)-1)<<VDO_FRAME0_POS))
#define VDO_S_FRAME0                                            VDO_S_FRAME0
#define VDO_S_FRAME0_POS                                        (16U)
#define VDO_S_FRAME0_LEN                                        (14U)
#define VDO_S_FRAME0_MSK                                        (((1U<<VDO_S_FRAME0_LEN)-1)<<VDO_S_FRAME0_POS)
#define VDO_S_FRAME0_UMSK                                       (~(((1U<<VDO_S_FRAME0_LEN)-1)<<VDO_S_FRAME0_POS))

/* 0x68 : vdo_core_reg17 */
#define VDO_CORE_REG17_OFFSET                                   (0x68)
#define VDO_FRAME1                                              VDO_FRAME1
#define VDO_FRAME1_POS                                          (0U)
#define VDO_FRAME1_LEN                                          (14U)
#define VDO_FRAME1_MSK                                          (((1U<<VDO_FRAME1_LEN)-1)<<VDO_FRAME1_POS)
#define VDO_FRAME1_UMSK                                         (~(((1U<<VDO_FRAME1_LEN)-1)<<VDO_FRAME1_POS))
#define VDO_S_FRAME1                                            VDO_S_FRAME1
#define VDO_S_FRAME1_POS                                        (16U)
#define VDO_S_FRAME1_LEN                                        (14U)
#define VDO_S_FRAME1_MSK                                        (((1U<<VDO_S_FRAME1_LEN)-1)<<VDO_S_FRAME1_POS)
#define VDO_S_FRAME1_UMSK                                       (~(((1U<<VDO_S_FRAME1_LEN)-1)<<VDO_S_FRAME1_POS))

/* 0x6c : vdo_core_reg18 */
#define VDO_CORE_REG18_OFFSET                                   (0x6c)
#define VDO_EXT_DATA                                            VDO_EXT_DATA
#define VDO_EXT_DATA_POS                                        (0U)
#define VDO_EXT_DATA_LEN                                        (14U)
#define VDO_EXT_DATA_MSK                                        (((1U<<VDO_EXT_DATA_LEN)-1)<<VDO_EXT_DATA_POS)
#define VDO_EXT_DATA_UMSK                                       (~(((1U<<VDO_EXT_DATA_LEN)-1)<<VDO_EXT_DATA_POS))
#define VDO_S_EXT_DATA                                          VDO_S_EXT_DATA
#define VDO_S_EXT_DATA_POS                                      (16U)
#define VDO_S_EXT_DATA_LEN                                      (14U)
#define VDO_S_EXT_DATA_MSK                                      (((1U<<VDO_S_EXT_DATA_LEN)-1)<<VDO_S_EXT_DATA_POS)
#define VDO_S_EXT_DATA_UMSK                                     (~(((1U<<VDO_S_EXT_DATA_LEN)-1)<<VDO_S_EXT_DATA_POS))

/* 0x70 : vdo_core_reg19 */
#define VDO_CORE_REG19_OFFSET                                   (0x70)
#define VDO_EXT_MEM_CONFIG0                                     VDO_EXT_MEM_CONFIG0
#define VDO_EXT_MEM_CONFIG0_POS                                 (0U)
#define VDO_EXT_MEM_CONFIG0_LEN                                 (6U)
#define VDO_EXT_MEM_CONFIG0_MSK                                 (((1U<<VDO_EXT_MEM_CONFIG0_LEN)-1)<<VDO_EXT_MEM_CONFIG0_POS)
#define VDO_EXT_MEM_CONFIG0_UMSK                                (~(((1U<<VDO_EXT_MEM_CONFIG0_LEN)-1)<<VDO_EXT_MEM_CONFIG0_POS))
#define VDO_S_EXT_MEM_CONFIG0                                   VDO_S_EXT_MEM_CONFIG0
#define VDO_S_EXT_MEM_CONFIG0_POS                               (16U)
#define VDO_S_EXT_MEM_CONFIG0_LEN                               (6U)
#define VDO_S_EXT_MEM_CONFIG0_MSK                               (((1U<<VDO_S_EXT_MEM_CONFIG0_LEN)-1)<<VDO_S_EXT_MEM_CONFIG0_POS)
#define VDO_S_EXT_MEM_CONFIG0_UMSK                              (~(((1U<<VDO_S_EXT_MEM_CONFIG0_LEN)-1)<<VDO_S_EXT_MEM_CONFIG0_POS))

/* 0x74 : vdo_core_reg20 */
#define VDO_CORE_REG20_OFFSET                                   (0x74)
#define VDO_EXT_MEM_CONFIG1                                     VDO_EXT_MEM_CONFIG1
#define VDO_EXT_MEM_CONFIG1_POS                                 (0U)
#define VDO_EXT_MEM_CONFIG1_LEN                                 (5U)
#define VDO_EXT_MEM_CONFIG1_MSK                                 (((1U<<VDO_EXT_MEM_CONFIG1_LEN)-1)<<VDO_EXT_MEM_CONFIG1_POS)
#define VDO_EXT_MEM_CONFIG1_UMSK                                (~(((1U<<VDO_EXT_MEM_CONFIG1_LEN)-1)<<VDO_EXT_MEM_CONFIG1_POS))
#define VDO_S_EXT_MEM_CONFIG1                                   VDO_S_EXT_MEM_CONFIG1
#define VDO_S_EXT_MEM_CONFIG1_POS                               (16U)
#define VDO_S_EXT_MEM_CONFIG1_LEN                               (5U)
#define VDO_S_EXT_MEM_CONFIG1_MSK                               (((1U<<VDO_S_EXT_MEM_CONFIG1_LEN)-1)<<VDO_S_EXT_MEM_CONFIG1_POS)
#define VDO_S_EXT_MEM_CONFIG1_UMSK                              (~(((1U<<VDO_S_EXT_MEM_CONFIG1_LEN)-1)<<VDO_S_EXT_MEM_CONFIG1_POS))

/* 0x78 : vdo_core_reg21 */
#define VDO_CORE_REG21_OFFSET                                   (0x78)
#define VDO_EXT_MEM_CONFIG2                                     VDO_EXT_MEM_CONFIG2
#define VDO_EXT_MEM_CONFIG2_POS                                 (0U)
#define VDO_EXT_MEM_CONFIG2_LEN                                 (12U)
#define VDO_EXT_MEM_CONFIG2_MSK                                 (((1U<<VDO_EXT_MEM_CONFIG2_LEN)-1)<<VDO_EXT_MEM_CONFIG2_POS)
#define VDO_EXT_MEM_CONFIG2_UMSK                                (~(((1U<<VDO_EXT_MEM_CONFIG2_LEN)-1)<<VDO_EXT_MEM_CONFIG2_POS))
#define VDO_S_EXT_MEM_CONFIG2                                   VDO_S_EXT_MEM_CONFIG2
#define VDO_S_EXT_MEM_CONFIG2_POS                               (16U)
#define VDO_S_EXT_MEM_CONFIG2_LEN                               (12U)
#define VDO_S_EXT_MEM_CONFIG2_MSK                               (((1U<<VDO_S_EXT_MEM_CONFIG2_LEN)-1)<<VDO_S_EXT_MEM_CONFIG2_POS)
#define VDO_S_EXT_MEM_CONFIG2_UMSK                              (~(((1U<<VDO_S_EXT_MEM_CONFIG2_LEN)-1)<<VDO_S_EXT_MEM_CONFIG2_POS))

/* 0x7c : vdo_core_reg22 */
#define VDO_CORE_REG22_OFFSET                                   (0x7c)
#define VDO_EXT_MEM_CONFIG3                                     VDO_EXT_MEM_CONFIG3
#define VDO_EXT_MEM_CONFIG3_POS                                 (0U)
#define VDO_EXT_MEM_CONFIG3_LEN                                 (10U)
#define VDO_EXT_MEM_CONFIG3_MSK                                 (((1U<<VDO_EXT_MEM_CONFIG3_LEN)-1)<<VDO_EXT_MEM_CONFIG3_POS)
#define VDO_EXT_MEM_CONFIG3_UMSK                                (~(((1U<<VDO_EXT_MEM_CONFIG3_LEN)-1)<<VDO_EXT_MEM_CONFIG3_POS))
#define VDO_S_EXT_MEM_CONFIG3                                   VDO_S_EXT_MEM_CONFIG3
#define VDO_S_EXT_MEM_CONFIG3_POS                               (16U)
#define VDO_S_EXT_MEM_CONFIG3_LEN                               (10U)
#define VDO_S_EXT_MEM_CONFIG3_MSK                               (((1U<<VDO_S_EXT_MEM_CONFIG3_LEN)-1)<<VDO_S_EXT_MEM_CONFIG3_POS)
#define VDO_S_EXT_MEM_CONFIG3_UMSK                              (~(((1U<<VDO_S_EXT_MEM_CONFIG3_LEN)-1)<<VDO_S_EXT_MEM_CONFIG3_POS))

/* 0x80 : vdo_core_reg23 */
#define VDO_CORE_REG23_OFFSET                                   (0x80)
#define VDO_NUM_IMB_BITS                                        VDO_NUM_IMB_BITS
#define VDO_NUM_IMB_BITS_POS                                    (0U)
#define VDO_NUM_IMB_BITS_LEN                                    (12U)
#define VDO_NUM_IMB_BITS_MSK                                    (((1U<<VDO_NUM_IMB_BITS_LEN)-1)<<VDO_NUM_IMB_BITS_POS)
#define VDO_NUM_IMB_BITS_UMSK                                   (~(((1U<<VDO_NUM_IMB_BITS_LEN)-1)<<VDO_NUM_IMB_BITS_POS))
#define VDO_NAL_ALIGN                                           VDO_NAL_ALIGN
#define VDO_NAL_ALIGN_POS                                       (13U)
#define VDO_NAL_ALIGN_LEN                                       (1U)
#define VDO_NAL_ALIGN_MSK                                       (((1U<<VDO_NAL_ALIGN_LEN)-1)<<VDO_NAL_ALIGN_POS)
#define VDO_NAL_ALIGN_UMSK                                      (~(((1U<<VDO_NAL_ALIGN_LEN)-1)<<VDO_NAL_ALIGN_POS))
#define VDO_CONS_IPRED                                          VDO_CONS_IPRED
#define VDO_CONS_IPRED_POS                                      (14U)
#define VDO_CONS_IPRED_LEN                                      (1U)
#define VDO_CONS_IPRED_MSK                                      (((1U<<VDO_CONS_IPRED_LEN)-1)<<VDO_CONS_IPRED_POS)
#define VDO_CONS_IPRED_UMSK                                     (~(((1U<<VDO_CONS_IPRED_LEN)-1)<<VDO_CONS_IPRED_POS))
#define VDO_S_NUM_IMB_BITS                                      VDO_S_NUM_IMB_BITS
#define VDO_S_NUM_IMB_BITS_POS                                  (16U)
#define VDO_S_NUM_IMB_BITS_LEN                                  (12U)
#define VDO_S_NUM_IMB_BITS_MSK                                  (((1U<<VDO_S_NUM_IMB_BITS_LEN)-1)<<VDO_S_NUM_IMB_BITS_POS)
#define VDO_S_NUM_IMB_BITS_UMSK                                 (~(((1U<<VDO_S_NUM_IMB_BITS_LEN)-1)<<VDO_S_NUM_IMB_BITS_POS))
#define VDO_S_NAL_ALIGN                                         VDO_S_NAL_ALIGN
#define VDO_S_NAL_ALIGN_POS                                     (29U)
#define VDO_S_NAL_ALIGN_LEN                                     (1U)
#define VDO_S_NAL_ALIGN_MSK                                     (((1U<<VDO_S_NAL_ALIGN_LEN)-1)<<VDO_S_NAL_ALIGN_POS)
#define VDO_S_NAL_ALIGN_UMSK                                    (~(((1U<<VDO_S_NAL_ALIGN_LEN)-1)<<VDO_S_NAL_ALIGN_POS))
#define VDO_S_CONS_IPRED                                        VDO_S_CONS_IPRED
#define VDO_S_CONS_IPRED_POS                                    (30U)
#define VDO_S_CONS_IPRED_LEN                                    (1U)
#define VDO_S_CONS_IPRED_MSK                                    (((1U<<VDO_S_CONS_IPRED_LEN)-1)<<VDO_S_CONS_IPRED_POS)
#define VDO_S_CONS_IPRED_UMSK                                   (~(((1U<<VDO_S_CONS_IPRED_LEN)-1)<<VDO_S_CONS_IPRED_POS))

