sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x84 : vdo_core_reg24 */
#define VDO_CORE_REG24_OFFSET                                   (0x84)
#define VDO_NUM_PMB_BITS                                        VDO_NUM_PMB_BITS
#define VDO_NUM_PMB_BITS_POS                                    (0U)
#define VDO_NUM_PMB_BITS_LEN                                    (12U)
#define VDO_NUM_PMB_BITS_MSK                                    (((1U<<VDO_NUM_PMB_BITS_LEN)-1)<<VDO_NUM_PMB_BITS_POS)
#define VDO_NUM_PMB_BITS_UMSK                                   (~(((1U<<VDO_NUM_PMB_BITS_LEN)-1)<<VDO_NUM_PMB_BITS_POS))
#define VDO_S_NUM_PMB_BITS                                      VDO_S_NUM_PMB_BITS
#define VDO_S_NUM_PMB_BITS_POS                                  (16U)
#define VDO_S_NUM_PMB_BITS_LEN                                  (12U)
#define VDO_S_NUM_PMB_BITS_MSK                                  (((1U<<VDO_S_NUM_PMB_BITS_LEN)-1)<<VDO_S_NUM_PMB_BITS_POS)
#define VDO_S_NUM_PMB_BITS_UMSK                                 (~(((1U<<VDO_S_NUM_PMB_BITS_LEN)-1)<<VDO_S_NUM_PMB_BITS_POS))

/* 0x88 : vdo_core_reg25 */
#define VDO_CORE_REG25_OFFSET                                   (0x88)
#define VDO_INTERLACE_MODE                                      VDO_INTERLACE_MODE
#define VDO_INTERLACE_MODE_POS                                  (0U)
#define VDO_INTERLACE_MODE_LEN                                  (1U)
#define VDO_INTERLACE_MODE_MSK                                  (((1U<<VDO_INTERLACE_MODE_LEN)-1)<<VDO_INTERLACE_MODE_POS)
#define VDO_INTERLACE_MODE_UMSK                                 (~(((1U<<VDO_INTERLACE_MODE_LEN)-1)<<VDO_INTERLACE_MODE_POS))
#define VDO_BOTTOM_FIELD_FIRST                                  VDO_BOTTOM_FIELD_FIRST
#define VDO_BOTTOM_FIELD_FIRST_POS                              (1U)
#define VDO_BOTTOM_FIELD_FIRST_LEN                              (1U)
#define VDO_BOTTOM_FIELD_FIRST_MSK                              (((1U<<VDO_BOTTOM_FIELD_FIRST_LEN)-1)<<VDO_BOTTOM_FIELD_FIRST_POS)
#define VDO_BOTTOM_FIELD_FIRST_UMSK                             (~(((1U<<VDO_BOTTOM_FIELD_FIRST_LEN)-1)<<VDO_BOTTOM_FIELD_FIRST_POS))
#define VDO_PREV_FIELD_REF                                      VDO_PREV_FIELD_REF
#define VDO_PREV_FIELD_REF_POS                                  (2U)
#define VDO_PREV_FIELD_REF_LEN                                  (1U)
#define VDO_PREV_FIELD_REF_MSK                                  (((1U<<VDO_PREV_FIELD_REF_LEN)-1)<<VDO_PREV_FIELD_REF_POS)
#define VDO_PREV_FIELD_REF_UMSK                                 (~(((1U<<VDO_PREV_FIELD_REF_LEN)-1)<<VDO_PREV_FIELD_REF_POS))
#define VDO_S_INTERLACE_MODE                                    VDO_S_INTERLACE_MODE
#define VDO_S_INTERLACE_MODE_POS                                (16U)
#define VDO_S_INTERLACE_MODE_LEN                                (1U)
#define VDO_S_INTERLACE_MODE_MSK                                (((1U<<VDO_S_INTERLACE_MODE_LEN)-1)<<VDO_S_INTERLACE_MODE_POS)
#define VDO_S_INTERLACE_MODE_UMSK                               (~(((1U<<VDO_S_INTERLACE_MODE_LEN)-1)<<VDO_S_INTERLACE_MODE_POS))
#define VDO_S_BOTTOM_FIELD_FIRST                                VDO_S_BOTTOM_FIELD_FIRST
#define VDO_S_BOTTOM_FIELD_FIRST_POS                            (17U)
#define VDO_S_BOTTOM_FIELD_FIRST_LEN                            (1U)
#define VDO_S_BOTTOM_FIELD_FIRST_MSK                            (((1U<<VDO_S_BOTTOM_FIELD_FIRST_LEN)-1)<<VDO_S_BOTTOM_FIELD_FIRST_POS)
#define VDO_S_BOTTOM_FIELD_FIRST_UMSK                           (~(((1U<<VDO_S_BOTTOM_FIELD_FIRST_LEN)-1)<<VDO_S_BOTTOM_FIELD_FIRST_POS))
#define VDO_S_PREV_FIELD_REF                                    VDO_S_PREV_FIELD_REF
#define VDO_S_PREV_FIELD_REF_POS                                (18U)
#define VDO_S_PREV_FIELD_REF_LEN                                (1U)
#define VDO_S_PREV_FIELD_REF_MSK                                (((1U<<VDO_S_PREV_FIELD_REF_LEN)-1)<<VDO_S_PREV_FIELD_REF_POS)
#define VDO_S_PREV_FIELD_REF_UMSK                               (~(((1U<<VDO_S_PREV_FIELD_REF_LEN)-1)<<VDO_S_PREV_FIELD_REF_POS))

/* 0x94 : vdo_core_reg28 */
#define VDO_CORE_REG28_OFFSET                                   (0x94)
#define VDO_PFRAME_MIN_QP                                       VDO_PFRAME_MIN_QP
#define VDO_PFRAME_MIN_QP_POS                                   (0U)
#define VDO_PFRAME_MIN_QP_LEN                                   (6U)
#define VDO_PFRAME_MIN_QP_MSK                                   (((1U<<VDO_PFRAME_MIN_QP_LEN)-1)<<VDO_PFRAME_MIN_QP_POS)
#define VDO_PFRAME_MIN_QP_UMSK                                  (~(((1U<<VDO_PFRAME_MIN_QP_LEN)-1)<<VDO_PFRAME_MIN_QP_POS))
#define VDO_PFRAME_MAX_QP                                       VDO_PFRAME_MAX_QP
#define VDO_PFRAME_MAX_QP_POS                                   (8U)
#define VDO_PFRAME_MAX_QP_LEN                                   (6U)
#define VDO_PFRAME_MAX_QP_MSK                                   (((1U<<VDO_PFRAME_MAX_QP_LEN)-1)<<VDO_PFRAME_MAX_QP_POS)
#define VDO_PFRAME_MAX_QP_UMSK                                  (~(((1U<<VDO_PFRAME_MAX_QP_LEN)-1)<<VDO_PFRAME_MAX_QP_POS))
#define VDO_S_PFRAME_MIN_QP                                     VDO_S_PFRAME_MIN_QP
#define VDO_S_PFRAME_MIN_QP_POS                                 (16U)
#define VDO_S_PFRAME_MIN_QP_LEN                                 (6U)
#define VDO_S_PFRAME_MIN_QP_MSK                                 (((1U<<VDO_S_PFRAME_MIN_QP_LEN)-1)<<VDO_S_PFRAME_MIN_QP_POS)
#define VDO_S_PFRAME_MIN_QP_UMSK                                (~(((1U<<VDO_S_PFRAME_MIN_QP_LEN)-1)<<VDO_S_PFRAME_MIN_QP_POS))
#define VDO_S_PFRAME_MAX_QP                                     VDO_S_PFRAME_MAX_QP
#define VDO_S_PFRAME_MAX_QP_POS                                 (24U)
#define VDO_S_PFRAME_MAX_QP_LEN                                 (6U)
#define VDO_S_PFRAME_MAX_QP_MSK                                 (((1U<<VDO_S_PFRAME_MAX_QP_LEN)-1)<<VDO_S_PFRAME_MAX_QP_POS)
#define VDO_S_PFRAME_MAX_QP_UMSK                                (~(((1U<<VDO_S_PFRAME_MAX_QP_LEN)-1)<<VDO_S_PFRAME_MAX_QP_POS))

/* 0x9c : vdo_core_reg30 */
#define VDO_CORE_REG30_OFFSET                                   (0x9c)
#define VDO_RESET_I_STATE                                       VDO_RESET_I_STATE
#define VDO_RESET_I_STATE_POS                                   (15U)
#define VDO_RESET_I_STATE_LEN                                   (1U)
#define VDO_RESET_I_STATE_MSK                                   (((1U<<VDO_RESET_I_STATE_LEN)-1)<<VDO_RESET_I_STATE_POS)
#define VDO_RESET_I_STATE_UMSK                                  (~(((1U<<VDO_RESET_I_STATE_LEN)-1)<<VDO_RESET_I_STATE_POS))
#define VDO_S_RESET_I_STATE                                     VDO_S_RESET_I_STATE
#define VDO_S_RESET_I_STATE_POS                                 (31U)
#define VDO_S_RESET_I_STATE_LEN                                 (1U)
#define VDO_S_RESET_I_STATE_MSK                                 (((1U<<VDO_S_RESET_I_STATE_LEN)-1)<<VDO_S_RESET_I_STATE_POS)
#define VDO_S_RESET_I_STATE_UMSK                                (~(((1U<<VDO_S_RESET_I_STATE_LEN)-1)<<VDO_S_RESET_I_STATE_POS))

/* 0xa0 : vdo_core_reg31 */
#define VDO_CORE_REG31_OFFSET                                   (0xa0)
#define VDO_IFRAME_MIN_QP                                       VDO_IFRAME_MIN_QP
#define VDO_IFRAME_MIN_QP_POS                                   (0U)
#define VDO_IFRAME_MIN_QP_LEN                                   (6U)
#define VDO_IFRAME_MIN_QP_MSK                                   (((1U<<VDO_IFRAME_MIN_QP_LEN)-1)<<VDO_IFRAME_MIN_QP_POS)
#define VDO_IFRAME_MIN_QP_UMSK                                  (~(((1U<<VDO_IFRAME_MIN_QP_LEN)-1)<<VDO_IFRAME_MIN_QP_POS))
#define VDO_IFRAME_MAX_QP                                       VDO_IFRAME_MAX_QP
#define VDO_IFRAME_MAX_QP_POS                                   (8U)
#define VDO_IFRAME_MAX_QP_LEN                                   (6U)
#define VDO_IFRAME_MAX_QP_MSK                                   (((1U<<VDO_IFRAME_MAX_QP_LEN)-1)<<VDO_IFRAME_MAX_QP_POS)
#define VDO_IFRAME_MAX_QP_UMSK                                  (~(((1U<<VDO_IFRAME_MAX_QP_LEN)-1)<<VDO_IFRAME_MAX_QP_POS))
#define VDO_S_IFRAME_MIN_QP                                     VDO_S_IFRAME_MIN_QP
#define VDO_S_IFRAME_MIN_QP_POS                                 (16U)
#define VDO_S_IFRAME_MIN_QP_LEN                                 (6U)
#define VDO_S_IFRAME_MIN_QP_MSK                                 (((1U<<VDO_S_IFRAME_MIN_QP_LEN)-1)<<VDO_S_IFRAME_MIN_QP_POS)
#define VDO_S_IFRAME_MIN_QP_UMSK                                (~(((1U<<VDO_S_IFRAME_MIN_QP_LEN)-1)<<VDO_S_IFRAME_MIN_QP_POS))
#define VDO_S_IFRAME_MAX_QP                                     VDO_S_IFRAME_MAX_QP
#define VDO_S_IFRAME_MAX_QP_POS                                 (24U)
#define VDO_S_IFRAME_MAX_QP_LEN                                 (6U)
#define VDO_S_IFRAME_MAX_QP_MSK                                 (((1U<<VDO_S_IFRAME_MAX_QP_LEN)-1)<<VDO_S_IFRAME_MAX_QP_POS)
#define VDO_S_IFRAME_MAX_QP_UMSK                                (~(((1U<<VDO_S_IFRAME_MAX_QP_LEN)-1)<<VDO_S_IFRAME_MAX_QP_POS))

/* 0xa4 : vdo_core_reg32 */
#define VDO_CORE_REG32_OFFSET                                   (0xa4)
#define VDO_VUI_TIME_SCALE_L                                    VDO_VUI_TIME_SCALE_L
#define VDO_VUI_TIME_SCALE_L_POS                                (0U)
#define VDO_VUI_TIME_SCALE_L_LEN                                (16U)
#define VDO_VUI_TIME_SCALE_L_MSK                                (((1U<<VDO_VUI_TIME_SCALE_L_LEN)-1)<<VDO_VUI_TIME_SCALE_L_POS)
#define VDO_VUI_TIME_SCALE_L_UMSK                               (~(((1U<<VDO_VUI_TIME_SCALE_L_LEN)-1)<<VDO_VUI_TIME_SCALE_L_POS))
#define VDO_S_VUI_TIME_SCALE_L                                  VDO_S_VUI_TIME_SCALE_L
#define VDO_S_VUI_TIME_SCALE_L_POS                              (16U)
#define VDO_S_VUI_TIME_SCALE_L_LEN                              (16U)
#define VDO_S_VUI_TIME_SCALE_L_MSK                              (((1U<<VDO_S_VUI_TIME_SCALE_L_LEN)-1)<<VDO_S_VUI_TIME_SCALE_L_POS)
#define VDO_S_VUI_TIME_SCALE_L_UMSK                             (~(((1U<<VDO_S_VUI_TIME_SCALE_L_LEN)-1)<<VDO_S_VUI_TIME_SCALE_L_POS))

/* 0xa8 : vdo_core_reg33 */
#define VDO_CORE_REG33_OFFSET                                   (0xa8)
#define VDO_VUI_TIME_SCALE_H                                    VDO_VUI_TIME_SCALE_H
#define VDO_VUI_TIME_SCALE_H_POS                                (0U)
#define VDO_VUI_TIME_SCALE_H_LEN                                (16U)
#define VDO_VUI_TIME_SCALE_H_MSK                                (((1U<<VDO_VUI_TIME_SCALE_H_LEN)-1)<<VDO_VUI_TIME_SCALE_H_POS)
#define VDO_VUI_TIME_SCALE_H_UMSK                               (~(((1U<<VDO_VUI_TIME_SCALE_H_LEN)-1)<<VDO_VUI_TIME_SCALE_H_POS))
#define VDO_S_VUI_TIME_SCALE_H                                  VDO_S_VUI_TIME_SCALE_H
#define VDO_S_VUI_TIME_SCALE_H_POS                              (16U)
#define VDO_S_VUI_TIME_SCALE_H_LEN                              (16U)
#define VDO_S_VUI_TIME_SCALE_H_MSK                              (((1U<<VDO_S_VUI_TIME_SCALE_H_LEN)-1)<<VDO_S_VUI_TIME_SCALE_H_POS)
#define VDO_S_VUI_TIME_SCALE_H_UMSK                             (~(((1U<<VDO_S_VUI_TIME_SCALE_H_LEN)-1)<<VDO_S_VUI_TIME_SCALE_H_POS))

/* 0xac : vdo_core_reg34 */
#define VDO_CORE_REG34_OFFSET                                   (0xac)
#define VDO_VUI_NUM_U_TICK_L                                    VDO_VUI_NUM_U_TICK_L
#define VDO_VUI_NUM_U_TICK_L_POS                                (0U)
#define VDO_VUI_NUM_U_TICK_L_LEN                                (16U)
#define VDO_VUI_NUM_U_TICK_L_MSK                                (((1U<<VDO_VUI_NUM_U_TICK_L_LEN)-1)<<VDO_VUI_NUM_U_TICK_L_POS)
#define VDO_VUI_NUM_U_TICK_L_UMSK                               (~(((1U<<VDO_VUI_NUM_U_TICK_L_LEN)-1)<<VDO_VUI_NUM_U_TICK_L_POS))
#define VDO_S_VUI_NUM_U_TICK_L                                  VDO_S_VUI_NUM_U_TICK_L
#define VDO_S_VUI_NUM_U_TICK_L_POS                              (16U)
#define VDO_S_VUI_NUM_U_TICK_L_LEN                              (16U)
#define VDO_S_VUI_NUM_U_TICK_L_MSK                              (((1U<<VDO_S_VUI_NUM_U_TICK_L_LEN)-1)<<VDO_S_VUI_NUM_U_TICK_L_POS)
#define VDO_S_VUI_NUM_U_TICK_L_UMSK                             (~(((1U<<VDO_S_VUI_NUM_U_TICK_L_LEN)-1)<<VDO_S_VUI_NUM_U_TICK_L_POS))

