sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0xb0 : vdo_core_reg35 */
#define VDO_CORE_REG35_OFFSET                                   (0xb0)
#define VDO_VUI_NUM_U_TICK_H                                    VDO_VUI_NUM_U_TICK_H
#define VDO_VUI_NUM_U_TICK_H_POS                                (0U)
#define VDO_VUI_NUM_U_TICK_H_LEN                                (16U)
#define VDO_VUI_NUM_U_TICK_H_MSK                                (((1U<<VDO_VUI_NUM_U_TICK_H_LEN)-1)<<VDO_VUI_NUM_U_TICK_H_POS)
#define VDO_VUI_NUM_U_TICK_H_UMSK                               (~(((1U<<VDO_VUI_NUM_U_TICK_H_LEN)-1)<<VDO_VUI_NUM_U_TICK_H_POS))
#define VDO_S_VUI_NUM_U_TICK_H                                  VDO_S_VUI_NUM_U_TICK_H
#define VDO_S_VUI_NUM_U_TICK_H_POS                              (16U)
#define VDO_S_VUI_NUM_U_TICK_H_LEN                              (16U)
#define VDO_S_VUI_NUM_U_TICK_H_MSK                              (((1U<<VDO_S_VUI_NUM_U_TICK_H_LEN)-1)<<VDO_S_VUI_NUM_U_TICK_H_POS)
#define VDO_S_VUI_NUM_U_TICK_H_UMSK                             (~(((1U<<VDO_S_VUI_NUM_U_TICK_H_LEN)-1)<<VDO_S_VUI_NUM_U_TICK_H_POS))

/* 0xb4 : vdo_core_reg36 */
#define VDO_CORE_REG36_OFFSET                                   (0xb4)
#define VDO_VUI_ASPECT_IDC                                      VDO_VUI_ASPECT_IDC
#define VDO_VUI_ASPECT_IDC_POS                                  (0U)
#define VDO_VUI_ASPECT_IDC_LEN                                  (8U)
#define VDO_VUI_ASPECT_IDC_MSK                                  (((1U<<VDO_VUI_ASPECT_IDC_LEN)-1)<<VDO_VUI_ASPECT_IDC_POS)
#define VDO_VUI_ASPECT_IDC_UMSK                                 (~(((1U<<VDO_VUI_ASPECT_IDC_LEN)-1)<<VDO_VUI_ASPECT_IDC_POS))
#define VDO_S_VUI_ASPECT_IDC                                    VDO_S_VUI_ASPECT_IDC
#define VDO_S_VUI_ASPECT_IDC_POS                                (16U)
#define VDO_S_VUI_ASPECT_IDC_LEN                                (8U)
#define VDO_S_VUI_ASPECT_IDC_MSK                                (((1U<<VDO_S_VUI_ASPECT_IDC_LEN)-1)<<VDO_S_VUI_ASPECT_IDC_POS)
#define VDO_S_VUI_ASPECT_IDC_UMSK                               (~(((1U<<VDO_S_VUI_ASPECT_IDC_LEN)-1)<<VDO_S_VUI_ASPECT_IDC_POS))

/* 0xb8 : vdo_core_reg37 */
#define VDO_CORE_REG37_OFFSET                                   (0xb8)
#define VDO_VUI_ASPECT_WIDTH                                    VDO_VUI_ASPECT_WIDTH
#define VDO_VUI_ASPECT_WIDTH_POS                                (0U)
#define VDO_VUI_ASPECT_WIDTH_LEN                                (16U)
#define VDO_VUI_ASPECT_WIDTH_MSK                                (((1U<<VDO_VUI_ASPECT_WIDTH_LEN)-1)<<VDO_VUI_ASPECT_WIDTH_POS)
#define VDO_VUI_ASPECT_WIDTH_UMSK                               (~(((1U<<VDO_VUI_ASPECT_WIDTH_LEN)-1)<<VDO_VUI_ASPECT_WIDTH_POS))
#define VDO_S_VUI_ASPECT_WIDTH                                  VDO_S_VUI_ASPECT_WIDTH
#define VDO_S_VUI_ASPECT_WIDTH_POS                              (16U)
#define VDO_S_VUI_ASPECT_WIDTH_LEN                              (16U)
#define VDO_S_VUI_ASPECT_WIDTH_MSK                              (((1U<<VDO_S_VUI_ASPECT_WIDTH_LEN)-1)<<VDO_S_VUI_ASPECT_WIDTH_POS)
#define VDO_S_VUI_ASPECT_WIDTH_UMSK                             (~(((1U<<VDO_S_VUI_ASPECT_WIDTH_LEN)-1)<<VDO_S_VUI_ASPECT_WIDTH_POS))

/* 0xbc : vdo_core_reg38 */
#define VDO_CORE_REG38_OFFSET                                   (0xbc)
#define VDO_VUI_ASPECT_HEIGHT                                   VDO_VUI_ASPECT_HEIGHT
#define VDO_VUI_ASPECT_HEIGHT_POS                               (0U)
#define VDO_VUI_ASPECT_HEIGHT_LEN                               (16U)
#define VDO_VUI_ASPECT_HEIGHT_MSK                               (((1U<<VDO_VUI_ASPECT_HEIGHT_LEN)-1)<<VDO_VUI_ASPECT_HEIGHT_POS)
#define VDO_VUI_ASPECT_HEIGHT_UMSK                              (~(((1U<<VDO_VUI_ASPECT_HEIGHT_LEN)-1)<<VDO_VUI_ASPECT_HEIGHT_POS))
#define VDO_S_VUI_ASPECT_HEIGHT                                 VDO_S_VUI_ASPECT_HEIGHT
#define VDO_S_VUI_ASPECT_HEIGHT_POS                             (16U)
#define VDO_S_VUI_ASPECT_HEIGHT_LEN                             (16U)
#define VDO_S_VUI_ASPECT_HEIGHT_MSK                             (((1U<<VDO_S_VUI_ASPECT_HEIGHT_LEN)-1)<<VDO_S_VUI_ASPECT_HEIGHT_POS)
#define VDO_S_VUI_ASPECT_HEIGHT_UMSK                            (~(((1U<<VDO_S_VUI_ASPECT_HEIGHT_LEN)-1)<<VDO_S_VUI_ASPECT_HEIGHT_POS))

/* 0xc0 : vdo_src_dvp_sel */
#define VDO_SRC_DVP_SEL_OFFSET                                  (0xc0)
#define VDO_UV_DVP2AXI_SEL                                      VDO_UV_DVP2AXI_SEL
#define VDO_UV_DVP2AXI_SEL_POS                                  (0U)
#define VDO_UV_DVP2AXI_SEL_LEN                                  (3U)
#define VDO_UV_DVP2AXI_SEL_MSK                                  (((1U<<VDO_UV_DVP2AXI_SEL_LEN)-1)<<VDO_UV_DVP2AXI_SEL_POS)
#define VDO_UV_DVP2AXI_SEL_UMSK                                 (~(((1U<<VDO_UV_DVP2AXI_SEL_LEN)-1)<<VDO_UV_DVP2AXI_SEL_POS))
#define VDO_Y_DVP2AXI_SEL                                       VDO_Y_DVP2AXI_SEL
#define VDO_Y_DVP2AXI_SEL_POS                                   (4U)
#define VDO_Y_DVP2AXI_SEL_LEN                                   (3U)
#define VDO_Y_DVP2AXI_SEL_MSK                                   (((1U<<VDO_Y_DVP2AXI_SEL_LEN)-1)<<VDO_Y_DVP2AXI_SEL_POS)
#define VDO_Y_DVP2AXI_SEL_UMSK                                  (~(((1U<<VDO_Y_DVP2AXI_SEL_LEN)-1)<<VDO_Y_DVP2AXI_SEL_POS))
#define VDO_S_UV_DVP2AXI_SEL                                    VDO_S_UV_DVP2AXI_SEL
#define VDO_S_UV_DVP2AXI_SEL_POS                                (16U)
#define VDO_S_UV_DVP2AXI_SEL_LEN                                (3U)
#define VDO_S_UV_DVP2AXI_SEL_MSK                                (((1U<<VDO_S_UV_DVP2AXI_SEL_LEN)-1)<<VDO_S_UV_DVP2AXI_SEL_POS)
#define VDO_S_UV_DVP2AXI_SEL_UMSK                               (~(((1U<<VDO_S_UV_DVP2AXI_SEL_LEN)-1)<<VDO_S_UV_DVP2AXI_SEL_POS))
#define VDO_S_Y_DVP2AXI_SEL                                     VDO_S_Y_DVP2AXI_SEL
#define VDO_S_Y_DVP2AXI_SEL_POS                                 (20U)
#define VDO_S_Y_DVP2AXI_SEL_LEN                                 (3U)
#define VDO_S_Y_DVP2AXI_SEL_MSK                                 (((1U<<VDO_S_Y_DVP2AXI_SEL_LEN)-1)<<VDO_S_Y_DVP2AXI_SEL_POS)
#define VDO_S_Y_DVP2AXI_SEL_UMSK                                (~(((1U<<VDO_S_Y_DVP2AXI_SEL_LEN)-1)<<VDO_S_Y_DVP2AXI_SEL_POS))

/* 0xc4 : vdo_padding_ctrl */
#define VDO_PADDING_CTRL_OFFSET                                 (0xc4)
#define VDO_Y_PADDING_PIXEL                                     VDO_Y_PADDING_PIXEL
#define VDO_Y_PADDING_PIXEL_POS                                 (0U)
#define VDO_Y_PADDING_PIXEL_LEN                                 (8U)
#define VDO_Y_PADDING_PIXEL_MSK                                 (((1U<<VDO_Y_PADDING_PIXEL_LEN)-1)<<VDO_Y_PADDING_PIXEL_POS)
#define VDO_Y_PADDING_PIXEL_UMSK                                (~(((1U<<VDO_Y_PADDING_PIXEL_LEN)-1)<<VDO_Y_PADDING_PIXEL_POS))
#define VDO_U_PADDING_PIXEL                                     VDO_U_PADDING_PIXEL
#define VDO_U_PADDING_PIXEL_POS                                 (8U)
#define VDO_U_PADDING_PIXEL_LEN                                 (8U)
#define VDO_U_PADDING_PIXEL_MSK                                 (((1U<<VDO_U_PADDING_PIXEL_LEN)-1)<<VDO_U_PADDING_PIXEL_POS)
#define VDO_U_PADDING_PIXEL_UMSK                                (~(((1U<<VDO_U_PADDING_PIXEL_LEN)-1)<<VDO_U_PADDING_PIXEL_POS))
#define VDO_V_PADDING_PIXEL                                     VDO_V_PADDING_PIXEL
#define VDO_V_PADDING_PIXEL_POS                                 (16U)
#define VDO_V_PADDING_PIXEL_LEN                                 (8U)
#define VDO_V_PADDING_PIXEL_MSK                                 (((1U<<VDO_V_PADDING_PIXEL_LEN)-1)<<VDO_V_PADDING_PIXEL_POS)
#define VDO_V_PADDING_PIXEL_UMSK                                (~(((1U<<VDO_V_PADDING_PIXEL_LEN)-1)<<VDO_V_PADDING_PIXEL_POS))
#define VDO_Y_LINE_PAD                                          VDO_Y_LINE_PAD
#define VDO_Y_LINE_PAD_POS                                      (24U)
#define VDO_Y_LINE_PAD_LEN                                      (5U)
#define VDO_Y_LINE_PAD_MSK                                      (((1U<<VDO_Y_LINE_PAD_LEN)-1)<<VDO_Y_LINE_PAD_POS)
#define VDO_Y_LINE_PAD_UMSK                                     (~(((1U<<VDO_Y_LINE_PAD_LEN)-1)<<VDO_Y_LINE_PAD_POS))

/* 0xd8 : vdo_frame_id_clr */
#define VDO_FRAME_ID_CLR_OFFSET                                 (0xd8)
#define VDO_FRAME_ID_CLR                                        VDO_FRAME_ID_CLR
#define VDO_FRAME_ID_CLR_POS                                    (0U)
#define VDO_FRAME_ID_CLR_LEN                                    (1U)
#define VDO_FRAME_ID_CLR_MSK                                    (((1U<<VDO_FRAME_ID_CLR_LEN)-1)<<VDO_FRAME_ID_CLR_POS)
#define VDO_FRAME_ID_CLR_UMSK                                   (~(((1U<<VDO_FRAME_ID_CLR_LEN)-1)<<VDO_FRAME_ID_CLR_POS))
#define VDO_S_FRAME_ID_CLR                                      VDO_S_FRAME_ID_CLR
#define VDO_S_FRAME_ID_CLR_POS                                  (1U)
#define VDO_S_FRAME_ID_CLR_LEN                                  (1U)
#define VDO_S_FRAME_ID_CLR_MSK                                  (((1U<<VDO_S_FRAME_ID_CLR_LEN)-1)<<VDO_S_FRAME_ID_CLR_POS)
#define VDO_S_FRAME_ID_CLR_UMSK                                 (~(((1U<<VDO_S_FRAME_ID_CLR_LEN)-1)<<VDO_S_FRAME_ID_CLR_POS))

/* 0x100 : vdo_int */
#define VDO_INT_OFFSET                                          (0x100)
#define VDO_FRM_DONE_INT                                        VDO_FRM_DONE_INT
#define VDO_FRM_DONE_INT_POS                                    (0U)
#define VDO_FRM_DONE_INT_LEN                                    (1U)
#define VDO_FRM_DONE_INT_MSK                                    (((1U<<VDO_FRM_DONE_INT_LEN)-1)<<VDO_FRM_DONE_INT_POS)
#define VDO_FRM_DONE_INT_UMSK                                   (~(((1U<<VDO_FRM_DONE_INT_LEN)-1)<<VDO_FRM_DONE_INT_POS))
#define VDO_S_FRM_DONE_INT                                      VDO_S_FRM_DONE_INT
#define VDO_S_FRM_DONE_INT_POS                                  (1U)
#define VDO_S_FRM_DONE_INT_LEN                                  (1U)
#define VDO_S_FRM_DONE_INT_MSK                                  (((1U<<VDO_S_FRM_DONE_INT_LEN)-1)<<VDO_S_FRM_DONE_INT_POS)
#define VDO_S_FRM_DONE_INT_UMSK                                 (~(((1U<<VDO_S_FRM_DONE_INT_LEN)-1)<<VDO_S_FRM_DONE_INT_POS))
#define VDO_SEQ_DONE_INT                                        VDO_SEQ_DONE_INT
#define VDO_SEQ_DONE_INT_POS                                    (4U)
#define VDO_SEQ_DONE_INT_LEN                                    (1U)
#define VDO_SEQ_DONE_INT_MSK                                    (((1U<<VDO_SEQ_DONE_INT_LEN)-1)<<VDO_SEQ_DONE_INT_POS)
#define VDO_SEQ_DONE_INT_UMSK                                   (~(((1U<<VDO_SEQ_DONE_INT_LEN)-1)<<VDO_SEQ_DONE_INT_POS))
#define VDO_S_SEQ_DONE_INT                                      VDO_S_SEQ_DONE_INT
#define VDO_S_SEQ_DONE_INT_POS                                  (5U)
#define VDO_S_SEQ_DONE_INT_LEN                                  (1U)
#define VDO_S_SEQ_DONE_INT_MSK                                  (((1U<<VDO_S_SEQ_DONE_INT_LEN)-1)<<VDO_S_SEQ_DONE_INT_POS)
#define VDO_S_SEQ_DONE_INT_UMSK                                 (~(((1U<<VDO_S_SEQ_DONE_INT_LEN)-1)<<VDO_S_SEQ_DONE_INT_POS))
#define VDO_BS_FULL_INT                                         VDO_BS_FULL_INT
#define VDO_BS_FULL_INT_POS                                     (8U)
#define VDO_BS_FULL_INT_LEN                                     (1U)
#define VDO_BS_FULL_INT_MSK                                     (((1U<<VDO_BS_FULL_INT_LEN)-1)<<VDO_BS_FULL_INT_POS)
#define VDO_BS_FULL_INT_UMSK                                    (~(((1U<<VDO_BS_FULL_INT_LEN)-1)<<VDO_BS_FULL_INT_POS))
#define VDO_S_BS_FULL_INT                                       VDO_S_BS_FULL_INT
#define VDO_S_BS_FULL_INT_POS                                   (9U)
#define VDO_S_BS_FULL_INT_LEN                                   (1U)
#define VDO_S_BS_FULL_INT_MSK                                   (((1U<<VDO_S_BS_FULL_INT_LEN)-1)<<VDO_S_BS_FULL_INT_POS)
#define VDO_S_BS_FULL_INT_UMSK                                  (~(((1U<<VDO_S_BS_FULL_INT_LEN)-1)<<VDO_S_BS_FULL_INT_POS))

/* 0x104 : vdo_int_clr */
#define VDO_INT_CLR_OFFSET                                      (0x104)
#define VDO_FRM_DONE_INT_CLR                                    VDO_FRM_DONE_INT_CLR
#define VDO_FRM_DONE_INT_CLR_POS                                (0U)
#define VDO_FRM_DONE_INT_CLR_LEN                                (1U)
#define VDO_FRM_DONE_INT_CLR_MSK                                (((1U<<VDO_FRM_DONE_INT_CLR_LEN)-1)<<VDO_FRM_DONE_INT_CLR_POS)
#define VDO_FRM_DONE_INT_CLR_UMSK                               (~(((1U<<VDO_FRM_DONE_INT_CLR_LEN)-1)<<VDO_FRM_DONE_INT_CLR_POS))
#define VDO_S_FRM_DONE_INT_CLR                                  VDO_S_FRM_DONE_INT_CLR
#define VDO_S_FRM_DONE_INT_CLR_POS                              (1U)
#define VDO_S_FRM_DONE_INT_CLR_LEN                              (1U)
#define VDO_S_FRM_DONE_INT_CLR_MSK                              (((1U<<VDO_S_FRM_DONE_INT_CLR_LEN)-1)<<VDO_S_FRM_DONE_INT_CLR_POS)
#define VDO_S_FRM_DONE_INT_CLR_UMSK                             (~(((1U<<VDO_S_FRM_DONE_INT_CLR_LEN)-1)<<VDO_S_FRM_DONE_INT_CLR_POS))
#define VDO_SEQ_DONE_INT_CLR                                    VDO_SEQ_DONE_INT_CLR
#define VDO_SEQ_DONE_INT_CLR_POS                                (4U)
#define VDO_SEQ_DONE_INT_CLR_LEN                                (1U)
#define VDO_SEQ_DONE_INT_CLR_MSK                                (((1U<<VDO_SEQ_DONE_INT_CLR_LEN)-1)<<VDO_SEQ_DONE_INT_CLR_POS)
#define VDO_SEQ_DONE_INT_CLR_UMSK                               (~(((1U<<VDO_SEQ_DONE_INT_CLR_LEN)-1)<<VDO_SEQ_DONE_INT_CLR_POS))
#define VDO_S_SEQ_DONE_INT_CLR                                  VDO_S_SEQ_DONE_INT_CLR
#define VDO_S_SEQ_DONE_INT_CLR_POS                              (5U)
#define VDO_S_SEQ_DONE_INT_CLR_LEN                              (1U)
#define VDO_S_SEQ_DONE_INT_CLR_MSK                              (((1U<<VDO_S_SEQ_DONE_INT_CLR_LEN)-1)<<VDO_S_SEQ_DONE_INT_CLR_POS)
#define VDO_S_SEQ_DONE_INT_CLR_UMSK                             (~(((1U<<VDO_S_SEQ_DONE_INT_CLR_LEN)-1)<<VDO_S_SEQ_DONE_INT_CLR_POS))
#define VDO_BS_FULL_INT_CLR                                     VDO_BS_FULL_INT_CLR
#define VDO_BS_FULL_INT_CLR_POS                                 (8U)
#define VDO_BS_FULL_INT_CLR_LEN                                 (1U)
#define VDO_BS_FULL_INT_CLR_MSK                                 (((1U<<VDO_BS_FULL_INT_CLR_LEN)-1)<<VDO_BS_FULL_INT_CLR_POS)
#define VDO_BS_FULL_INT_CLR_UMSK                                (~(((1U<<VDO_BS_FULL_INT_CLR_LEN)-1)<<VDO_BS_FULL_INT_CLR_POS))
#define VDO_S_BS_FULL_INT_CLR                                   VDO_S_BS_FULL_INT_CLR
#define VDO_S_BS_FULL_INT_CLR_POS                               (9U)
#define VDO_S_BS_FULL_INT_CLR_LEN                               (1U)
#define VDO_S_BS_FULL_INT_CLR_MSK                               (((1U<<VDO_S_BS_FULL_INT_CLR_LEN)-1)<<VDO_S_BS_FULL_INT_CLR_POS)
#define VDO_S_BS_FULL_INT_CLR_UMSK                              (~(((1U<<VDO_S_BS_FULL_INT_CLR_LEN)-1)<<VDO_S_BS_FULL_INT_CLR_POS))

/* 0x108 : vdo_int_mask */
#define VDO_INT_MASK_OFFSET                                     (0x108)
#define VDO_FRM_DONE_INT_MASK                                   VDO_FRM_DONE_INT_MASK
#define VDO_FRM_DONE_INT_MASK_POS                               (0U)
#define VDO_FRM_DONE_INT_MASK_LEN                               (1U)
#define VDO_FRM_DONE_INT_MASK_MSK                               (((1U<<VDO_FRM_DONE_INT_MASK_LEN)-1)<<VDO_FRM_DONE_INT_MASK_POS)
#define VDO_FRM_DONE_INT_MASK_UMSK                              (~(((1U<<VDO_FRM_DONE_INT_MASK_LEN)-1)<<VDO_FRM_DONE_INT_MASK_POS))
#define VDO_S_FRM_DONE_INT_MASK                                 VDO_S_FRM_DONE_INT_MASK
#define VDO_S_FRM_DONE_INT_MASK_POS                             (1U)
#define VDO_S_FRM_DONE_INT_MASK_LEN                             (1U)
#define VDO_S_FRM_DONE_INT_MASK_MSK                             (((1U<<VDO_S_FRM_DONE_INT_MASK_LEN)-1)<<VDO_S_FRM_DONE_INT_MASK_POS)
#define VDO_S_FRM_DONE_INT_MASK_UMSK                            (~(((1U<<VDO_S_FRM_DONE_INT_MASK_LEN)-1)<<VDO_S_FRM_DONE_INT_MASK_POS))
#define VDO_SEQ_DONE_INT_MASK                                   VDO_SEQ_DONE_INT_MASK
#define VDO_SEQ_DONE_INT_MASK_POS                               (4U)
#define VDO_SEQ_DONE_INT_MASK_LEN                               (1U)
#define VDO_SEQ_DONE_INT_MASK_MSK                               (((1U<<VDO_SEQ_DONE_INT_MASK_LEN)-1)<<VDO_SEQ_DONE_INT_MASK_POS)
#define VDO_SEQ_DONE_INT_MASK_UMSK                              (~(((1U<<VDO_SEQ_DONE_INT_MASK_LEN)-1)<<VDO_SEQ_DONE_INT_MASK_POS))
#define VDO_S_SEQ_DONE_INT_MASK                                 VDO_S_SEQ_DONE_INT_MASK
#define VDO_S_SEQ_DONE_INT_MASK_POS                             (5U)
#define VDO_S_SEQ_DONE_INT_MASK_LEN                             (1U)
#define VDO_S_SEQ_DONE_INT_MASK_MSK                             (((1U<<VDO_S_SEQ_DONE_INT_MASK_LEN)-1)<<VDO_S_SEQ_DONE_INT_MASK_POS)
#define VDO_S_SEQ_DONE_INT_MASK_UMSK                            (~(((1U<<VDO_S_SEQ_DONE_INT_MASK_LEN)-1)<<VDO_S_SEQ_DONE_INT_MASK_POS))
#define VDO_BS_FULL_INT_MASK                                    VDO_BS_FULL_INT_MASK
#define VDO_BS_FULL_INT_MASK_POS                                (8U)
#define VDO_BS_FULL_INT_MASK_LEN                                (1U)
#define VDO_BS_FULL_INT_MASK_MSK                                (((1U<<VDO_BS_FULL_INT_MASK_LEN)-1)<<VDO_BS_FULL_INT_MASK_POS)
#define VDO_BS_FULL_INT_MASK_UMSK                               (~(((1U<<VDO_BS_FULL_INT_MASK_LEN)-1)<<VDO_BS_FULL_INT_MASK_POS))
#define VDO_S_BS_FULL_INT_MASK                                  VDO_S_BS_FULL_INT_MASK
#define VDO_S_BS_FULL_INT_MASK_POS                              (9U)
#define VDO_S_BS_FULL_INT_MASK_LEN                              (1U)
#define VDO_S_BS_FULL_INT_MASK_MSK                              (((1U<<VDO_S_BS_FULL_INT_MASK_LEN)-1)<<VDO_S_BS_FULL_INT_MASK_POS)
#define VDO_S_BS_FULL_INT_MASK_UMSK                             (~(((1U<<VDO_S_BS_FULL_INT_MASK_LEN)-1)<<VDO_S_BS_FULL_INT_MASK_POS))

/* 0x10c : vdo_total_bytecount */
#define VDO_TOTAL_BYTECOUNT_OFFSET                              (0x10c)
#define VDO_BS_TOT_BYCNT                                        VDO_BS_TOT_BYCNT
#define VDO_BS_TOT_BYCNT_POS                                    (0U)
#define VDO_BS_TOT_BYCNT_LEN                                    (32U)
#define VDO_BS_TOT_BYCNT_MSK                                    (((1U<<VDO_BS_TOT_BYCNT_LEN)-1)<<VDO_BS_TOT_BYCNT_POS)
#define VDO_BS_TOT_BYCNT_UMSK                                   (~(((1U<<VDO_BS_TOT_BYCNT_LEN)-1)<<VDO_BS_TOT_BYCNT_POS))

