sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x110 : vdo_frame_bytecount */
#define VDO_FRAME_BYTECOUNT_OFFSET                              (0x110)
#define VDO_BS_FRM_BYCNT                                        VDO_BS_FRM_BYCNT
#define VDO_BS_FRM_BYCNT_POS                                    (0U)
#define VDO_BS_FRM_BYCNT_LEN                                    (32U)
#define VDO_BS_FRM_BYCNT_MSK                                    (((1U<<VDO_BS_FRM_BYCNT_LEN)-1)<<VDO_BS_FRM_BYCNT_POS)
#define VDO_BS_FRM_BYCNT_UMSK                                   (~(((1U<<VDO_BS_FRM_BYCNT_LEN)-1)<<VDO_BS_FRM_BYCNT_POS))

/* 0x114 : vdo_src_r_dbg */
#define VDO_SRC_R_DBG_OFFSET                                    (0x114)
#define VDO_Y_READ_MBX                                          VDO_Y_READ_MBX
#define VDO_Y_READ_MBX_POS                                      (0U)
#define VDO_Y_READ_MBX_LEN                                      (13U)
#define VDO_Y_READ_MBX_MSK                                      (((1U<<VDO_Y_READ_MBX_LEN)-1)<<VDO_Y_READ_MBX_POS)
#define VDO_Y_READ_MBX_UMSK                                     (~(((1U<<VDO_Y_READ_MBX_LEN)-1)<<VDO_Y_READ_MBX_POS))
#define VDO_UV_READ_MBX                                         VDO_UV_READ_MBX
#define VDO_UV_READ_MBX_POS                                     (16U)
#define VDO_UV_READ_MBX_LEN                                     (13U)
#define VDO_UV_READ_MBX_MSK                                     (((1U<<VDO_UV_READ_MBX_LEN)-1)<<VDO_UV_READ_MBX_POS)
#define VDO_UV_READ_MBX_UMSK                                    (~(((1U<<VDO_UV_READ_MBX_LEN)-1)<<VDO_UV_READ_MBX_POS))
#define VDO_AXI_R_IDLE                                          VDO_AXI_R_IDLE
#define VDO_AXI_R_IDLE_POS                                      (30U)
#define VDO_AXI_R_IDLE_LEN                                      (1U)
#define VDO_AXI_R_IDLE_MSK                                      (((1U<<VDO_AXI_R_IDLE_LEN)-1)<<VDO_AXI_R_IDLE_POS)
#define VDO_AXI_R_IDLE_UMSK                                     (~(((1U<<VDO_AXI_R_IDLE_LEN)-1)<<VDO_AXI_R_IDLE_POS))
#define VDO_SRC_WR_OV_RD                                        VDO_SRC_WR_OV_RD
#define VDO_SRC_WR_OV_RD_POS                                    (31U)
#define VDO_SRC_WR_OV_RD_LEN                                    (1U)
#define VDO_SRC_WR_OV_RD_MSK                                    (((1U<<VDO_SRC_WR_OV_RD_LEN)-1)<<VDO_SRC_WR_OV_RD_POS)
#define VDO_SRC_WR_OV_RD_UMSK                                   (~(((1U<<VDO_SRC_WR_OV_RD_LEN)-1)<<VDO_SRC_WR_OV_RD_POS))

/* 0x118 : vdo_core_dbg */
#define VDO_CORE_DBG_OFFSET                                     (0x118)
#define VDO_CORE_MBX                                            VDO_CORE_MBX
#define VDO_CORE_MBX_POS                                        (0U)
#define VDO_CORE_MBX_LEN                                        (7U)
#define VDO_CORE_MBX_MSK                                        (((1U<<VDO_CORE_MBX_LEN)-1)<<VDO_CORE_MBX_POS)
#define VDO_CORE_MBX_UMSK                                       (~(((1U<<VDO_CORE_MBX_LEN)-1)<<VDO_CORE_MBX_POS))
#define VDO_CORE_MBY                                            VDO_CORE_MBY
#define VDO_CORE_MBY_POS                                        (8U)
#define VDO_CORE_MBY_LEN                                        (7U)
#define VDO_CORE_MBY_MSK                                        (((1U<<VDO_CORE_MBY_LEN)-1)<<VDO_CORE_MBY_POS)
#define VDO_CORE_MBY_UMSK                                       (~(((1U<<VDO_CORE_MBY_LEN)-1)<<VDO_CORE_MBY_POS))
#define VDO_M_CORE_IDLE                                         VDO_M_CORE_IDLE
#define VDO_M_CORE_IDLE_POS                                     (16U)
#define VDO_M_CORE_IDLE_LEN                                     (1U)
#define VDO_M_CORE_IDLE_MSK                                     (((1U<<VDO_M_CORE_IDLE_LEN)-1)<<VDO_M_CORE_IDLE_POS)
#define VDO_M_CORE_IDLE_UMSK                                    (~(((1U<<VDO_M_CORE_IDLE_LEN)-1)<<VDO_M_CORE_IDLE_POS))
#define VDO_S_CORE_IDLE                                         VDO_S_CORE_IDLE
#define VDO_S_CORE_IDLE_POS                                     (17U)
#define VDO_S_CORE_IDLE_LEN                                     (1U)
#define VDO_S_CORE_IDLE_MSK                                     (((1U<<VDO_S_CORE_IDLE_LEN)-1)<<VDO_S_CORE_IDLE_POS)
#define VDO_S_CORE_IDLE_UMSK                                    (~(((1U<<VDO_S_CORE_IDLE_LEN)-1)<<VDO_S_CORE_IDLE_POS))
#define VDO_SE_FSM                                              VDO_SE_FSM
#define VDO_SE_FSM_POS                                          (20U)
#define VDO_SE_FSM_LEN                                          (5U)
#define VDO_SE_FSM_MSK                                          (((1U<<VDO_SE_FSM_LEN)-1)<<VDO_SE_FSM_POS)
#define VDO_SE_FSM_UMSK                                         (~(((1U<<VDO_SE_FSM_LEN)-1)<<VDO_SE_FSM_POS))
#define VDO_OCLK_EN                                             VDO_OCLK_EN
#define VDO_OCLK_EN_POS                                         (29U)
#define VDO_OCLK_EN_LEN                                         (1U)
#define VDO_OCLK_EN_MSK                                         (((1U<<VDO_OCLK_EN_LEN)-1)<<VDO_OCLK_EN_POS)
#define VDO_OCLK_EN_UMSK                                        (~(((1U<<VDO_OCLK_EN_LEN)-1)<<VDO_OCLK_EN_POS))
#define VDO_TIMEOUT_STATE                                       VDO_TIMEOUT_STATE
#define VDO_TIMEOUT_STATE_POS                                   (30U)
#define VDO_TIMEOUT_STATE_LEN                                   (1U)
#define VDO_TIMEOUT_STATE_MSK                                   (((1U<<VDO_TIMEOUT_STATE_LEN)-1)<<VDO_TIMEOUT_STATE_POS)
#define VDO_TIMEOUT_STATE_UMSK                                  (~(((1U<<VDO_TIMEOUT_STATE_LEN)-1)<<VDO_TIMEOUT_STATE_POS))
#define VDO_MEM_CTRL_IDLE                                       VDO_MEM_CTRL_IDLE
#define VDO_MEM_CTRL_IDLE_POS                                   (31U)
#define VDO_MEM_CTRL_IDLE_LEN                                   (1U)
#define VDO_MEM_CTRL_IDLE_MSK                                   (((1U<<VDO_MEM_CTRL_IDLE_LEN)-1)<<VDO_MEM_CTRL_IDLE_POS)
#define VDO_MEM_CTRL_IDLE_UMSK                                  (~(((1U<<VDO_MEM_CTRL_IDLE_LEN)-1)<<VDO_MEM_CTRL_IDLE_POS))

/* 0x11c : vdo_ctrl_dbg */
#define VDO_CTRL_DBG_OFFSET                                     (0x11c)
#define VDO_CTRL_STATE                                          VDO_CTRL_STATE
#define VDO_CTRL_STATE_POS                                      (0U)
#define VDO_CTRL_STATE_LEN                                      (3U)
#define VDO_CTRL_STATE_MSK                                      (((1U<<VDO_CTRL_STATE_LEN)-1)<<VDO_CTRL_STATE_POS)
#define VDO_CTRL_STATE_UMSK                                     (~(((1U<<VDO_CTRL_STATE_LEN)-1)<<VDO_CTRL_STATE_POS))
#define VDO_H264_PROC                                           VDO_H264_PROC
#define VDO_H264_PROC_POS                                       (3U)
#define VDO_H264_PROC_LEN                                       (1U)
#define VDO_H264_PROC_MSK                                       (((1U<<VDO_H264_PROC_LEN)-1)<<VDO_H264_PROC_POS)
#define VDO_H264_PROC_UMSK                                      (~(((1U<<VDO_H264_PROC_LEN)-1)<<VDO_H264_PROC_POS))
#define VDO_S_CTRL_STATE                                        VDO_S_CTRL_STATE
#define VDO_S_CTRL_STATE_POS                                    (4U)
#define VDO_S_CTRL_STATE_LEN                                    (3U)
#define VDO_S_CTRL_STATE_MSK                                    (((1U<<VDO_S_CTRL_STATE_LEN)-1)<<VDO_S_CTRL_STATE_POS)
#define VDO_S_CTRL_STATE_UMSK                                   (~(((1U<<VDO_S_CTRL_STATE_LEN)-1)<<VDO_S_CTRL_STATE_POS))
#define VDO_S_H264_PROC                                         VDO_S_H264_PROC
#define VDO_S_H264_PROC_POS                                     (7U)
#define VDO_S_H264_PROC_LEN                                     (1U)
#define VDO_S_H264_PROC_MSK                                     (((1U<<VDO_S_H264_PROC_LEN)-1)<<VDO_S_H264_PROC_POS)
#define VDO_S_H264_PROC_UMSK                                    (~(((1U<<VDO_S_H264_PROC_LEN)-1)<<VDO_S_H264_PROC_POS))
#define VDO_CTRL_CE                                             VDO_CTRL_CE
#define VDO_CTRL_CE_POS                                         (8U)
#define VDO_CTRL_CE_LEN                                         (1U)
#define VDO_CTRL_CE_MSK                                         (((1U<<VDO_CTRL_CE_LEN)-1)<<VDO_CTRL_CE_POS)
#define VDO_CTRL_CE_UMSK                                        (~(((1U<<VDO_CTRL_CE_LEN)-1)<<VDO_CTRL_CE_POS))
#define VDO_STREAM_IDX                                          VDO_STREAM_IDX
#define VDO_STREAM_IDX_POS                                      (12U)
#define VDO_STREAM_IDX_LEN                                      (1U)
#define VDO_STREAM_IDX_MSK                                      (((1U<<VDO_STREAM_IDX_LEN)-1)<<VDO_STREAM_IDX_POS)
#define VDO_STREAM_IDX_UMSK                                     (~(((1U<<VDO_STREAM_IDX_LEN)-1)<<VDO_STREAM_IDX_POS))
#define VDO_CTRLER_FRM_CNT                                      VDO_CTRLER_FRM_CNT
#define VDO_CTRLER_FRM_CNT_POS                                  (16U)
#define VDO_CTRLER_FRM_CNT_LEN                                  (8U)
#define VDO_CTRLER_FRM_CNT_MSK                                  (((1U<<VDO_CTRLER_FRM_CNT_LEN)-1)<<VDO_CTRLER_FRM_CNT_POS)
#define VDO_CTRLER_FRM_CNT_UMSK                                 (~(((1U<<VDO_CTRLER_FRM_CNT_LEN)-1)<<VDO_CTRLER_FRM_CNT_POS))
#define VDO_S_CTRLER_FRM_CNT                                    VDO_S_CTRLER_FRM_CNT
#define VDO_S_CTRLER_FRM_CNT_POS                                (24U)
#define VDO_S_CTRLER_FRM_CNT_LEN                                (8U)
#define VDO_S_CTRLER_FRM_CNT_MSK                                (((1U<<VDO_S_CTRLER_FRM_CNT_LEN)-1)<<VDO_S_CTRLER_FRM_CNT_POS)
#define VDO_S_CTRLER_FRM_CNT_UMSK                               (~(((1U<<VDO_S_CTRLER_FRM_CNT_LEN)-1)<<VDO_S_CTRLER_FRM_CNT_POS))

/* 0x120 : vdo_checksum_0 */
#define VDO_CHECKSUM_0_OFFSET                                   (0x120)
#define VDO0_AXI_RDATA_CHKSUM                                   VDO0_AXI_RDATA_CHKSUM
#define VDO0_AXI_RDATA_CHKSUM_POS                               (0U)
#define VDO0_AXI_RDATA_CHKSUM_LEN                               (32U)
#define VDO0_AXI_RDATA_CHKSUM_MSK                               (((1U<<VDO0_AXI_RDATA_CHKSUM_LEN)-1)<<VDO0_AXI_RDATA_CHKSUM_POS)
#define VDO0_AXI_RDATA_CHKSUM_UMSK                              (~(((1U<<VDO0_AXI_RDATA_CHKSUM_LEN)-1)<<VDO0_AXI_RDATA_CHKSUM_POS))

/* 0x124 : vdo_checksum_1 */
#define VDO_CHECKSUM_1_OFFSET                                   (0x124)
#define VDO0_AXI_WDATA_CHKSUM                                   VDO0_AXI_WDATA_CHKSUM
#define VDO0_AXI_WDATA_CHKSUM_POS                               (0U)
#define VDO0_AXI_WDATA_CHKSUM_LEN                               (32U)
#define VDO0_AXI_WDATA_CHKSUM_MSK                               (((1U<<VDO0_AXI_WDATA_CHKSUM_LEN)-1)<<VDO0_AXI_WDATA_CHKSUM_POS)
#define VDO0_AXI_WDATA_CHKSUM_UMSK                              (~(((1U<<VDO0_AXI_WDATA_CHKSUM_LEN)-1)<<VDO0_AXI_WDATA_CHKSUM_POS))

