sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x128 : vdo_checksum_2 */
#define VDO_CHECKSUM_2_OFFSET                                   (0x128)
#define VDO1_AXI_RDATA_CHKSUM                                   VDO1_AXI_RDATA_CHKSUM
#define VDO1_AXI_RDATA_CHKSUM_POS                               (0U)
#define VDO1_AXI_RDATA_CHKSUM_LEN                               (32U)
#define VDO1_AXI_RDATA_CHKSUM_MSK                               (((1U<<VDO1_AXI_RDATA_CHKSUM_LEN)-1)<<VDO1_AXI_RDATA_CHKSUM_POS)
#define VDO1_AXI_RDATA_CHKSUM_UMSK                              (~(((1U<<VDO1_AXI_RDATA_CHKSUM_LEN)-1)<<VDO1_AXI_RDATA_CHKSUM_POS))

/* 0x12c : vdo_checksum_3 */
#define VDO_CHECKSUM_3_OFFSET                                   (0x12c)
#define VDO1_AXI_WDATA_CHKSUM                                   VDO1_AXI_WDATA_CHKSUM
#define VDO1_AXI_WDATA_CHKSUM_POS                               (0U)
#define VDO1_AXI_WDATA_CHKSUM_LEN                               (32U)
#define VDO1_AXI_WDATA_CHKSUM_MSK                               (((1U<<VDO1_AXI_WDATA_CHKSUM_LEN)-1)<<VDO1_AXI_WDATA_CHKSUM_POS)
#define VDO1_AXI_WDATA_CHKSUM_UMSK                              (~(((1U<<VDO1_AXI_WDATA_CHKSUM_LEN)-1)<<VDO1_AXI_WDATA_CHKSUM_POS))

/* 0x130 : vdo_checksum_4 */
#define VDO_CHECKSUM_4_OFFSET                                   (0x130)
#define VDO_LD_YBLK_CHKSUM                                      VDO_LD_YBLK_CHKSUM
#define VDO_LD_YBLK_CHKSUM_POS                                  (0U)
#define VDO_LD_YBLK_CHKSUM_LEN                                  (32U)
#define VDO_LD_YBLK_CHKSUM_MSK                                  (((1U<<VDO_LD_YBLK_CHKSUM_LEN)-1)<<VDO_LD_YBLK_CHKSUM_POS)
#define VDO_LD_YBLK_CHKSUM_UMSK                                 (~(((1U<<VDO_LD_YBLK_CHKSUM_LEN)-1)<<VDO_LD_YBLK_CHKSUM_POS))

/* 0x134 : vdo_checksum_5 */
#define VDO_CHECKSUM_5_OFFSET                                   (0x134)
#define VDO_LD_CBLK_CHKSUM                                      VDO_LD_CBLK_CHKSUM
#define VDO_LD_CBLK_CHKSUM_POS                                  (0U)
#define VDO_LD_CBLK_CHKSUM_LEN                                  (32U)
#define VDO_LD_CBLK_CHKSUM_MSK                                  (((1U<<VDO_LD_CBLK_CHKSUM_LEN)-1)<<VDO_LD_CBLK_CHKSUM_POS)
#define VDO_LD_CBLK_CHKSUM_UMSK                                 (~(((1U<<VDO_LD_CBLK_CHKSUM_LEN)-1)<<VDO_LD_CBLK_CHKSUM_POS))

/* 0x138 : vdo_checksum_6 */
#define VDO_CHECKSUM_6_OFFSET                                   (0x138)
#define VDO_MEM_DIN_CHKSUM                                      VDO_MEM_DIN_CHKSUM
#define VDO_MEM_DIN_CHKSUM_POS                                  (0U)
#define VDO_MEM_DIN_CHKSUM_LEN                                  (32U)
#define VDO_MEM_DIN_CHKSUM_MSK                                  (((1U<<VDO_MEM_DIN_CHKSUM_LEN)-1)<<VDO_MEM_DIN_CHKSUM_POS)
#define VDO_MEM_DIN_CHKSUM_UMSK                                 (~(((1U<<VDO_MEM_DIN_CHKSUM_LEN)-1)<<VDO_MEM_DIN_CHKSUM_POS))

/* 0x13c : vdo_checksum_7 */
#define VDO_CHECKSUM_7_OFFSET                                   (0x13c)
#define VDO_MEM_DOUT_CHKSUM                                     VDO_MEM_DOUT_CHKSUM
#define VDO_MEM_DOUT_CHKSUM_POS                                 (0U)
#define VDO_MEM_DOUT_CHKSUM_LEN                                 (32U)
#define VDO_MEM_DOUT_CHKSUM_MSK                                 (((1U<<VDO_MEM_DOUT_CHKSUM_LEN)-1)<<VDO_MEM_DOUT_CHKSUM_POS)
#define VDO_MEM_DOUT_CHKSUM_UMSK                                (~(((1U<<VDO_MEM_DOUT_CHKSUM_LEN)-1)<<VDO_MEM_DOUT_CHKSUM_POS))

/* 0x140 : vdo_reserved */
#define VDO_RESERVED_OFFSET                                     (0x140)
#define VDO_RESERVED                                            VDO_RESERVED
#define VDO_RESERVED_POS                                        (0U)
#define VDO_RESERVED_LEN                                        (32U)
#define VDO_RESERVED_MSK                                        (((1U<<VDO_RESERVED_LEN)-1)<<VDO_RESERVED_POS)
#define VDO_RESERVED_UMSK                                       (~(((1U<<VDO_RESERVED_LEN)-1)<<VDO_RESERVED_POS))

/* 0x144 : vdo_h264_y_frame_mem_size */
#define VDO_H264_Y_FRAME_MEM_SIZE_OFFSET                        (0x144)
#define VDO_CFG_MEM_BCNT_Y                                      VDO_CFG_MEM_BCNT_Y
#define VDO_CFG_MEM_BCNT_Y_POS                                  (0U)
#define VDO_CFG_MEM_BCNT_Y_LEN                                  (32U)
#define VDO_CFG_MEM_BCNT_Y_MSK                                  (((1U<<VDO_CFG_MEM_BCNT_Y_LEN)-1)<<VDO_CFG_MEM_BCNT_Y_POS)
#define VDO_CFG_MEM_BCNT_Y_UMSK                                 (~(((1U<<VDO_CFG_MEM_BCNT_Y_LEN)-1)<<VDO_CFG_MEM_BCNT_Y_POS))

/* 0x148 : vdo_h264_uv_frame_mem_size */
#define VDO_H264_UV_FRAME_MEM_SIZE_OFFSET                       (0x148)
#define VDO_CFG_MEM_BCNT_UV                                     VDO_CFG_MEM_BCNT_UV
#define VDO_CFG_MEM_BCNT_UV_POS                                 (0U)
#define VDO_CFG_MEM_BCNT_UV_LEN                                 (32U)
#define VDO_CFG_MEM_BCNT_UV_MSK                                 (((1U<<VDO_CFG_MEM_BCNT_UV_LEN)-1)<<VDO_CFG_MEM_BCNT_UV_POS)
#define VDO_CFG_MEM_BCNT_UV_UMSK                                (~(((1U<<VDO_CFG_MEM_BCNT_UV_LEN)-1)<<VDO_CFG_MEM_BCNT_UV_POS))

/* 0x14c : vdo_h264_s_frame_size */
#define VDO_H264_S_FRAME_SIZE_OFFSET                            (0x14c)
#define VDO_CFG_S_FRAME_WIDTH                                   VDO_CFG_S_FRAME_WIDTH
#define VDO_CFG_S_FRAME_WIDTH_POS                               (0U)
#define VDO_CFG_S_FRAME_WIDTH_LEN                               (11U)
#define VDO_CFG_S_FRAME_WIDTH_MSK                               (((1U<<VDO_CFG_S_FRAME_WIDTH_LEN)-1)<<VDO_CFG_S_FRAME_WIDTH_POS)
#define VDO_CFG_S_FRAME_WIDTH_UMSK                              (~(((1U<<VDO_CFG_S_FRAME_WIDTH_LEN)-1)<<VDO_CFG_S_FRAME_WIDTH_POS))
#define VDO_CFG_S_FRAME_HEIGHT                                  VDO_CFG_S_FRAME_HEIGHT
#define VDO_CFG_S_FRAME_HEIGHT_POS                              (16U)
#define VDO_CFG_S_FRAME_HEIGHT_LEN                              (11U)
#define VDO_CFG_S_FRAME_HEIGHT_MSK                              (((1U<<VDO_CFG_S_FRAME_HEIGHT_LEN)-1)<<VDO_CFG_S_FRAME_HEIGHT_POS)
#define VDO_CFG_S_FRAME_HEIGHT_UMSK                             (~(((1U<<VDO_CFG_S_FRAME_HEIGHT_LEN)-1)<<VDO_CFG_S_FRAME_HEIGHT_POS))

/* 0x150 : vdo_h264_s_frame_base_addr_y */
#define VDO_H264_S_FRAME_BASE_ADDR_Y_OFFSET                     (0x150)
#define VDO_CFG_S_FRAME_BASE_ADDR_Y                             VDO_CFG_S_FRAME_BASE_ADDR_Y
#define VDO_CFG_S_FRAME_BASE_ADDR_Y_POS                         (0U)
#define VDO_CFG_S_FRAME_BASE_ADDR_Y_LEN                         (32U)
#define VDO_CFG_S_FRAME_BASE_ADDR_Y_MSK                         (((1U<<VDO_CFG_S_FRAME_BASE_ADDR_Y_LEN)-1)<<VDO_CFG_S_FRAME_BASE_ADDR_Y_POS)
#define VDO_CFG_S_FRAME_BASE_ADDR_Y_UMSK                        (~(((1U<<VDO_CFG_S_FRAME_BASE_ADDR_Y_LEN)-1)<<VDO_CFG_S_FRAME_BASE_ADDR_Y_POS))

/* 0x154 : vdo_h264_s_frame_base_addr_uv */
#define VDO_H264_S_FRAME_BASE_ADDR_UV_OFFSET                    (0x154)
#define VDO_CFG_S_FRAME_BASE_ADDR_UV                            VDO_CFG_S_FRAME_BASE_ADDR_UV
#define VDO_CFG_S_FRAME_BASE_ADDR_UV_POS                        (0U)
#define VDO_CFG_S_FRAME_BASE_ADDR_UV_LEN                        (32U)
#define VDO_CFG_S_FRAME_BASE_ADDR_UV_MSK                        (((1U<<VDO_CFG_S_FRAME_BASE_ADDR_UV_LEN)-1)<<VDO_CFG_S_FRAME_BASE_ADDR_UV_POS)
#define VDO_CFG_S_FRAME_BASE_ADDR_UV_UMSK                       (~(((1U<<VDO_CFG_S_FRAME_BASE_ADDR_UV_LEN)-1)<<VDO_CFG_S_FRAME_BASE_ADDR_UV_POS))

