sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x158 : vdo_h264_s_y_frame_mem_size */
#define VDO_H264_S_Y_FRAME_MEM_SIZE_OFFSET                      (0x158)
#define VDO_CFG_S_MEM_BCNT_Y                                    VDO_CFG_S_MEM_BCNT_Y
#define VDO_CFG_S_MEM_BCNT_Y_POS                                (0U)
#define VDO_CFG_S_MEM_BCNT_Y_LEN                                (32U)
#define VDO_CFG_S_MEM_BCNT_Y_MSK                                (((1U<<VDO_CFG_S_MEM_BCNT_Y_LEN)-1)<<VDO_CFG_S_MEM_BCNT_Y_POS)
#define VDO_CFG_S_MEM_BCNT_Y_UMSK                               (~(((1U<<VDO_CFG_S_MEM_BCNT_Y_LEN)-1)<<VDO_CFG_S_MEM_BCNT_Y_POS))

/* 0x15c : vdo_h264_s_uv_frame_mem_size */
#define VDO_H264_S_UV_FRAME_MEM_SIZE_OFFSET                     (0x15c)
#define VDO_CFG_S_MEM_BCNT_UV                                   VDO_CFG_S_MEM_BCNT_UV
#define VDO_CFG_S_MEM_BCNT_UV_POS                               (0U)
#define VDO_CFG_S_MEM_BCNT_UV_LEN                               (32U)
#define VDO_CFG_S_MEM_BCNT_UV_MSK                               (((1U<<VDO_CFG_S_MEM_BCNT_UV_LEN)-1)<<VDO_CFG_S_MEM_BCNT_UV_POS)
#define VDO_CFG_S_MEM_BCNT_UV_UMSK                              (~(((1U<<VDO_CFG_S_MEM_BCNT_UV_LEN)-1)<<VDO_CFG_S_MEM_BCNT_UV_POS))

/* 0x160 : vdo_h264_s_bs_base_addr */
#define VDO_H264_S_BS_BASE_ADDR_OFFSET                          (0x160)
#define VDO_CFG_S_BS_BASE_ADDR                                  VDO_CFG_S_BS_BASE_ADDR
#define VDO_CFG_S_BS_BASE_ADDR_POS                              (0U)
#define VDO_CFG_S_BS_BASE_ADDR_LEN                              (32U)
#define VDO_CFG_S_BS_BASE_ADDR_MSK                              (((1U<<VDO_CFG_S_BS_BASE_ADDR_LEN)-1)<<VDO_CFG_S_BS_BASE_ADDR_POS)
#define VDO_CFG_S_BS_BASE_ADDR_UMSK                             (~(((1U<<VDO_CFG_S_BS_BASE_ADDR_LEN)-1)<<VDO_CFG_S_BS_BASE_ADDR_POS))

/* 0x164 : vdo_reserved2 */
#define VDO_RESERVED2_OFFSET                                    (0x164)
#define VDO_RESERVED2                                           VDO_RESERVED2
#define VDO_RESERVED2_POS                                       (0U)
#define VDO_RESERVED2_LEN                                       (32U)
#define VDO_RESERVED2_MSK                                       (((1U<<VDO_RESERVED2_LEN)-1)<<VDO_RESERVED2_POS)
#define VDO_RESERVED2_UMSK                                      (~(((1U<<VDO_RESERVED2_LEN)-1)<<VDO_RESERVED2_POS))

/* 0x168 : vdo_h264_s_bs_size */
#define VDO_H264_S_BS_SIZE_OFFSET                               (0x168)
#define VDO_CFG_S_BS_SIZE                                       VDO_CFG_S_BS_SIZE
#define VDO_CFG_S_BS_SIZE_POS                                   (0U)
#define VDO_CFG_S_BS_SIZE_LEN                                   (32U)
#define VDO_CFG_S_BS_SIZE_MSK                                   (((1U<<VDO_CFG_S_BS_SIZE_LEN)-1)<<VDO_CFG_S_BS_SIZE_POS)
#define VDO_CFG_S_BS_SIZE_UMSK                                  (~(((1U<<VDO_CFG_S_BS_SIZE_LEN)-1)<<VDO_CFG_S_BS_SIZE_POS))

/* 0x16c : vdo_h264_s_bs_full_thr */
#define VDO_H264_S_BS_FULL_THR_OFFSET                           (0x16c)
#define VDO_CFG_S_BS_FULL_THR                                   VDO_CFG_S_BS_FULL_THR
#define VDO_CFG_S_BS_FULL_THR_POS                               (0U)
#define VDO_CFG_S_BS_FULL_THR_LEN                               (32U)
#define VDO_CFG_S_BS_FULL_THR_MSK                               (((1U<<VDO_CFG_S_BS_FULL_THR_LEN)-1)<<VDO_CFG_S_BS_FULL_THR_POS)
#define VDO_CFG_S_BS_FULL_THR_UMSK                              (~(((1U<<VDO_CFG_S_BS_FULL_THR_LEN)-1)<<VDO_CFG_S_BS_FULL_THR_POS))

/* 0x170 : vdo_h264_s_src_bf_height */
#define VDO_H264_S_SRC_BF_HEIGHT_OFFSET                         (0x170)
#define VDO_CFG_S_C_SRC_BF_HEIGHT                               VDO_CFG_S_C_SRC_BF_HEIGHT
#define VDO_CFG_S_C_SRC_BF_HEIGHT_POS                           (0U)
#define VDO_CFG_S_C_SRC_BF_HEIGHT_LEN                           (15U)
#define VDO_CFG_S_C_SRC_BF_HEIGHT_MSK                           (((1U<<VDO_CFG_S_C_SRC_BF_HEIGHT_LEN)-1)<<VDO_CFG_S_C_SRC_BF_HEIGHT_POS)
#define VDO_CFG_S_C_SRC_BF_HEIGHT_UMSK                          (~(((1U<<VDO_CFG_S_C_SRC_BF_HEIGHT_LEN)-1)<<VDO_CFG_S_C_SRC_BF_HEIGHT_POS))
#define VDO_CFG_S_Y_SRC_BF_HEIGHT                               VDO_CFG_S_Y_SRC_BF_HEIGHT
#define VDO_CFG_S_Y_SRC_BF_HEIGHT_POS                           (16U)
#define VDO_CFG_S_Y_SRC_BF_HEIGHT_LEN                           (15U)
#define VDO_CFG_S_Y_SRC_BF_HEIGHT_MSK                           (((1U<<VDO_CFG_S_Y_SRC_BF_HEIGHT_LEN)-1)<<VDO_CFG_S_Y_SRC_BF_HEIGHT_POS)
#define VDO_CFG_S_Y_SRC_BF_HEIGHT_UMSK                          (~(((1U<<VDO_CFG_S_Y_SRC_BF_HEIGHT_LEN)-1)<<VDO_CFG_S_Y_SRC_BF_HEIGHT_POS))

/* 0x174 : vdo_s_padding_ctrl */
#define VDO_S_PADDING_CTRL_OFFSET                               (0x174)
#define VDO_S_Y_PADDING_PIXEL                                   VDO_S_Y_PADDING_PIXEL
#define VDO_S_Y_PADDING_PIXEL_POS                               (0U)
#define VDO_S_Y_PADDING_PIXEL_LEN                               (8U)
#define VDO_S_Y_PADDING_PIXEL_MSK                               (((1U<<VDO_S_Y_PADDING_PIXEL_LEN)-1)<<VDO_S_Y_PADDING_PIXEL_POS)
#define VDO_S_Y_PADDING_PIXEL_UMSK                              (~(((1U<<VDO_S_Y_PADDING_PIXEL_LEN)-1)<<VDO_S_Y_PADDING_PIXEL_POS))
#define VDO_S_U_PADDING_PIXEL                                   VDO_S_U_PADDING_PIXEL
#define VDO_S_U_PADDING_PIXEL_POS                               (8U)
#define VDO_S_U_PADDING_PIXEL_LEN                               (8U)
#define VDO_S_U_PADDING_PIXEL_MSK                               (((1U<<VDO_S_U_PADDING_PIXEL_LEN)-1)<<VDO_S_U_PADDING_PIXEL_POS)
#define VDO_S_U_PADDING_PIXEL_UMSK                              (~(((1U<<VDO_S_U_PADDING_PIXEL_LEN)-1)<<VDO_S_U_PADDING_PIXEL_POS))
#define VDO_S_V_PADDING_PIXEL                                   VDO_S_V_PADDING_PIXEL
#define VDO_S_V_PADDING_PIXEL_POS                               (16U)
#define VDO_S_V_PADDING_PIXEL_LEN                               (8U)
#define VDO_S_V_PADDING_PIXEL_MSK                               (((1U<<VDO_S_V_PADDING_PIXEL_LEN)-1)<<VDO_S_V_PADDING_PIXEL_POS)
#define VDO_S_V_PADDING_PIXEL_UMSK                              (~(((1U<<VDO_S_V_PADDING_PIXEL_LEN)-1)<<VDO_S_V_PADDING_PIXEL_POS))
#define VDO_S_Y_LINE_PAD                                        VDO_S_Y_LINE_PAD
#define VDO_S_Y_LINE_PAD_POS                                    (24U)
#define VDO_S_Y_LINE_PAD_LEN                                    (5U)
#define VDO_S_Y_LINE_PAD_MSK                                    (((1U<<VDO_S_Y_LINE_PAD_LEN)-1)<<VDO_S_Y_LINE_PAD_POS)
#define VDO_S_Y_LINE_PAD_UMSK                                   (~(((1U<<VDO_S_Y_LINE_PAD_LEN)-1)<<VDO_S_Y_LINE_PAD_POS))

