sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x178 : vdo_s_total_bytecount */
#define VDO_S_TOTAL_BYTECOUNT_OFFSET                            (0x178)
#define VDO_S_BS_TOT_BYCNT                                      VDO_S_BS_TOT_BYCNT
#define VDO_S_BS_TOT_BYCNT_POS                                  (0U)
#define VDO_S_BS_TOT_BYCNT_LEN                                  (32U)
#define VDO_S_BS_TOT_BYCNT_MSK                                  (((1U<<VDO_S_BS_TOT_BYCNT_LEN)-1)<<VDO_S_BS_TOT_BYCNT_POS)
#define VDO_S_BS_TOT_BYCNT_UMSK                                 (~(((1U<<VDO_S_BS_TOT_BYCNT_LEN)-1)<<VDO_S_BS_TOT_BYCNT_POS))

/* 0x17c : vdo_s_frame_bytecount */
#define VDO_S_FRAME_BYTECOUNT_OFFSET                            (0x17c)
#define VDO_S_BS_FRM_BYCNT                                      VDO_S_BS_FRM_BYCNT
#define VDO_S_BS_FRM_BYCNT_POS                                  (0U)
#define VDO_S_BS_FRM_BYCNT_LEN                                  (32U)
#define VDO_S_BS_FRM_BYCNT_MSK                                  (((1U<<VDO_S_BS_FRM_BYCNT_LEN)-1)<<VDO_S_BS_FRM_BYCNT_POS)
#define VDO_S_BS_FRM_BYCNT_UMSK                                 (~(((1U<<VDO_S_BS_FRM_BYCNT_LEN)-1)<<VDO_S_BS_FRM_BYCNT_POS))

/* 0x180 : vdo_s_src_r_dbg */
#define VDO_S_SRC_R_DBG_OFFSET                                  (0x180)
#define VDO_S_Y_READ_MBX                                        VDO_S_Y_READ_MBX
#define VDO_S_Y_READ_MBX_POS                                    (0U)
#define VDO_S_Y_READ_MBX_LEN                                    (13U)
#define VDO_S_Y_READ_MBX_MSK                                    (((1U<<VDO_S_Y_READ_MBX_LEN)-1)<<VDO_S_Y_READ_MBX_POS)
#define VDO_S_Y_READ_MBX_UMSK                                   (~(((1U<<VDO_S_Y_READ_MBX_LEN)-1)<<VDO_S_Y_READ_MBX_POS))
#define VDO_S_UV_READ_MBX                                       VDO_S_UV_READ_MBX
#define VDO_S_UV_READ_MBX_POS                                   (16U)
#define VDO_S_UV_READ_MBX_LEN                                   (13U)
#define VDO_S_UV_READ_MBX_MSK                                   (((1U<<VDO_S_UV_READ_MBX_LEN)-1)<<VDO_S_UV_READ_MBX_POS)
#define VDO_S_UV_READ_MBX_UMSK                                  (~(((1U<<VDO_S_UV_READ_MBX_LEN)-1)<<VDO_S_UV_READ_MBX_POS))
#define VDO_S_AXI_R_IDLE                                        VDO_S_AXI_R_IDLE
#define VDO_S_AXI_R_IDLE_POS                                    (30U)
#define VDO_S_AXI_R_IDLE_LEN                                    (1U)
#define VDO_S_AXI_R_IDLE_MSK                                    (((1U<<VDO_S_AXI_R_IDLE_LEN)-1)<<VDO_S_AXI_R_IDLE_POS)
#define VDO_S_AXI_R_IDLE_UMSK                                   (~(((1U<<VDO_S_AXI_R_IDLE_LEN)-1)<<VDO_S_AXI_R_IDLE_POS))
#define VDO_S_SRC_WR_OV_RD                                      VDO_S_SRC_WR_OV_RD
#define VDO_S_SRC_WR_OV_RD_POS                                  (31U)
#define VDO_S_SRC_WR_OV_RD_LEN                                  (1U)
#define VDO_S_SRC_WR_OV_RD_MSK                                  (((1U<<VDO_S_SRC_WR_OV_RD_LEN)-1)<<VDO_S_SRC_WR_OV_RD_POS)
#define VDO_S_SRC_WR_OV_RD_UMSK                                 (~(((1U<<VDO_S_SRC_WR_OV_RD_LEN)-1)<<VDO_S_SRC_WR_OV_RD_POS))

/* 0x184 : vdo_src_sta_clr */
#define VDO_SRC_STA_CLR_OFFSET                                  (0x184)
#define VDO_SRC_UV_WOVR_CLR                                     VDO_SRC_UV_WOVR_CLR
#define VDO_SRC_UV_WOVR_CLR_POS                                 (0U)
#define VDO_SRC_UV_WOVR_CLR_LEN                                 (1U)
#define VDO_SRC_UV_WOVR_CLR_MSK                                 (((1U<<VDO_SRC_UV_WOVR_CLR_LEN)-1)<<VDO_SRC_UV_WOVR_CLR_POS)
#define VDO_SRC_UV_WOVR_CLR_UMSK                                (~(((1U<<VDO_SRC_UV_WOVR_CLR_LEN)-1)<<VDO_SRC_UV_WOVR_CLR_POS))
#define VDO_SRC_Y_WOVR_CLR                                      VDO_SRC_Y_WOVR_CLR
#define VDO_SRC_Y_WOVR_CLR_POS                                  (4U)
#define VDO_SRC_Y_WOVR_CLR_LEN                                  (1U)
#define VDO_SRC_Y_WOVR_CLR_MSK                                  (((1U<<VDO_SRC_Y_WOVR_CLR_LEN)-1)<<VDO_SRC_Y_WOVR_CLR_POS)
#define VDO_SRC_Y_WOVR_CLR_UMSK                                 (~(((1U<<VDO_SRC_Y_WOVR_CLR_LEN)-1)<<VDO_SRC_Y_WOVR_CLR_POS))
#define VDO_S_SRC_UV_WOVR_CLR                                   VDO_S_SRC_UV_WOVR_CLR
#define VDO_S_SRC_UV_WOVR_CLR_POS                               (8U)
#define VDO_S_SRC_UV_WOVR_CLR_LEN                               (1U)
#define VDO_S_SRC_UV_WOVR_CLR_MSK                               (((1U<<VDO_S_SRC_UV_WOVR_CLR_LEN)-1)<<VDO_S_SRC_UV_WOVR_CLR_POS)
#define VDO_S_SRC_UV_WOVR_CLR_UMSK                              (~(((1U<<VDO_S_SRC_UV_WOVR_CLR_LEN)-1)<<VDO_S_SRC_UV_WOVR_CLR_POS))
#define VDO_S_SRC_Y_WOVR_CLR                                    VDO_S_SRC_Y_WOVR_CLR
#define VDO_S_SRC_Y_WOVR_CLR_POS                                (12U)
#define VDO_S_SRC_Y_WOVR_CLR_LEN                                (1U)
#define VDO_S_SRC_Y_WOVR_CLR_MSK                                (((1U<<VDO_S_SRC_Y_WOVR_CLR_LEN)-1)<<VDO_S_SRC_Y_WOVR_CLR_POS)
#define VDO_S_SRC_Y_WOVR_CLR_UMSK                               (~(((1U<<VDO_S_SRC_Y_WOVR_CLR_LEN)-1)<<VDO_S_SRC_Y_WOVR_CLR_POS))

/* 0x188 : vdo_src_ctrl */
#define VDO_SRC_CTRL_OFFSET                                     (0x188)
#define VDO_FRM_BUF_NUM                                         VDO_FRM_BUF_NUM
#define VDO_FRM_BUF_NUM_POS                                     (0U)
#define VDO_FRM_BUF_NUM_LEN                                     (4U)
#define VDO_FRM_BUF_NUM_MSK                                     (((1U<<VDO_FRM_BUF_NUM_LEN)-1)<<VDO_FRM_BUF_NUM_POS)
#define VDO_FRM_BUF_NUM_UMSK                                    (~(((1U<<VDO_FRM_BUF_NUM_LEN)-1)<<VDO_FRM_BUF_NUM_POS))
#define VDO_MFRM_BUF_EN                                         VDO_MFRM_BUF_EN
#define VDO_MFRM_BUF_EN_POS                                     (4U)
#define VDO_MFRM_BUF_EN_LEN                                     (1U)
#define VDO_MFRM_BUF_EN_MSK                                     (((1U<<VDO_MFRM_BUF_EN_LEN)-1)<<VDO_MFRM_BUF_EN_POS)
#define VDO_MFRM_BUF_EN_UMSK                                    (~(((1U<<VDO_MFRM_BUF_EN_LEN)-1)<<VDO_MFRM_BUF_EN_POS))
#define VDO_REQ_PERIOD                                          VDO_REQ_PERIOD
#define VDO_REQ_PERIOD_POS                                      (5U)
#define VDO_REQ_PERIOD_LEN                                      (10U)
#define VDO_REQ_PERIOD_MSK                                      (((1U<<VDO_REQ_PERIOD_LEN)-1)<<VDO_REQ_PERIOD_POS)
#define VDO_REQ_PERIOD_UMSK                                     (~(((1U<<VDO_REQ_PERIOD_LEN)-1)<<VDO_REQ_PERIOD_POS))
#define VDO_NO_WAIT_1ST_VSYNC                                   VDO_NO_WAIT_1ST_VSYNC
#define VDO_NO_WAIT_1ST_VSYNC_POS                               (15U)
#define VDO_NO_WAIT_1ST_VSYNC_LEN                               (1U)
#define VDO_NO_WAIT_1ST_VSYNC_MSK                               (((1U<<VDO_NO_WAIT_1ST_VSYNC_LEN)-1)<<VDO_NO_WAIT_1ST_VSYNC_POS)
#define VDO_NO_WAIT_1ST_VSYNC_UMSK                              (~(((1U<<VDO_NO_WAIT_1ST_VSYNC_LEN)-1)<<VDO_NO_WAIT_1ST_VSYNC_POS))
#define VDO_S_FRM_BUF_NUM                                       VDO_S_FRM_BUF_NUM
#define VDO_S_FRM_BUF_NUM_POS                                   (16U)
#define VDO_S_FRM_BUF_NUM_LEN                                   (4U)
#define VDO_S_FRM_BUF_NUM_MSK                                   (((1U<<VDO_S_FRM_BUF_NUM_LEN)-1)<<VDO_S_FRM_BUF_NUM_POS)
#define VDO_S_FRM_BUF_NUM_UMSK                                  (~(((1U<<VDO_S_FRM_BUF_NUM_LEN)-1)<<VDO_S_FRM_BUF_NUM_POS))
#define VDO_S_MFRM_BUF_EN                                       VDO_S_MFRM_BUF_EN
#define VDO_S_MFRM_BUF_EN_POS                                   (20U)
#define VDO_S_MFRM_BUF_EN_LEN                                   (1U)
#define VDO_S_MFRM_BUF_EN_MSK                                   (((1U<<VDO_S_MFRM_BUF_EN_LEN)-1)<<VDO_S_MFRM_BUF_EN_POS)
#define VDO_S_MFRM_BUF_EN_UMSK                                  (~(((1U<<VDO_S_MFRM_BUF_EN_LEN)-1)<<VDO_S_MFRM_BUF_EN_POS))
#define VDO_S_REQ_PERIOD                                        VDO_S_REQ_PERIOD
#define VDO_S_REQ_PERIOD_POS                                    (21U)
#define VDO_S_REQ_PERIOD_LEN                                    (10U)
#define VDO_S_REQ_PERIOD_MSK                                    (((1U<<VDO_S_REQ_PERIOD_LEN)-1)<<VDO_S_REQ_PERIOD_POS)
#define VDO_S_REQ_PERIOD_UMSK                                   (~(((1U<<VDO_S_REQ_PERIOD_LEN)-1)<<VDO_S_REQ_PERIOD_POS))
#define VDO_S_NO_WAIT_1ST_VSYNC                                 VDO_S_NO_WAIT_1ST_VSYNC
#define VDO_S_NO_WAIT_1ST_VSYNC_POS                             (31U)
#define VDO_S_NO_WAIT_1ST_VSYNC_LEN                             (1U)
#define VDO_S_NO_WAIT_1ST_VSYNC_MSK                             (((1U<<VDO_S_NO_WAIT_1ST_VSYNC_LEN)-1)<<VDO_S_NO_WAIT_1ST_VSYNC_POS)
#define VDO_S_NO_WAIT_1ST_VSYNC_UMSK                            (~(((1U<<VDO_S_NO_WAIT_1ST_VSYNC_LEN)-1)<<VDO_S_NO_WAIT_1ST_VSYNC_POS))

/* 0x18c : vdo_h264_refy0_base_addr */
#define VDO_H264_REFY0_BASE_ADDR_OFFSET                         (0x18c)
#define VDO_CFG_REFY0_BASE_ADDR                                 VDO_CFG_REFY0_BASE_ADDR
#define VDO_CFG_REFY0_BASE_ADDR_POS                             (0U)
#define VDO_CFG_REFY0_BASE_ADDR_LEN                             (32U)
#define VDO_CFG_REFY0_BASE_ADDR_MSK                             (((1U<<VDO_CFG_REFY0_BASE_ADDR_LEN)-1)<<VDO_CFG_REFY0_BASE_ADDR_POS)
#define VDO_CFG_REFY0_BASE_ADDR_UMSK                            (~(((1U<<VDO_CFG_REFY0_BASE_ADDR_LEN)-1)<<VDO_CFG_REFY0_BASE_ADDR_POS))

