sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x190 : vdo_h264_refu0_base_addr */
#define VDO_H264_REFU0_BASE_ADDR_OFFSET                         (0x190)
#define VDO_CFG_REFU0_BASE_ADDR                                 VDO_CFG_REFU0_BASE_ADDR
#define VDO_CFG_REFU0_BASE_ADDR_POS                             (0U)
#define VDO_CFG_REFU0_BASE_ADDR_LEN                             (32U)
#define VDO_CFG_REFU0_BASE_ADDR_MSK                             (((1U<<VDO_CFG_REFU0_BASE_ADDR_LEN)-1)<<VDO_CFG_REFU0_BASE_ADDR_POS)
#define VDO_CFG_REFU0_BASE_ADDR_UMSK                            (~(((1U<<VDO_CFG_REFU0_BASE_ADDR_LEN)-1)<<VDO_CFG_REFU0_BASE_ADDR_POS))

/* 0x194 : vdo_h264_refv0_base_addr */
#define VDO_H264_REFV0_BASE_ADDR_OFFSET                         (0x194)
#define VDO_CFG_REFV0_BASE_ADDR                                 VDO_CFG_REFV0_BASE_ADDR
#define VDO_CFG_REFV0_BASE_ADDR_POS                             (0U)
#define VDO_CFG_REFV0_BASE_ADDR_LEN                             (32U)
#define VDO_CFG_REFV0_BASE_ADDR_MSK                             (((1U<<VDO_CFG_REFV0_BASE_ADDR_LEN)-1)<<VDO_CFG_REFV0_BASE_ADDR_POS)
#define VDO_CFG_REFV0_BASE_ADDR_UMSK                            (~(((1U<<VDO_CFG_REFV0_BASE_ADDR_LEN)-1)<<VDO_CFG_REFV0_BASE_ADDR_POS))

/* 0x198 : vdo_h264_refy1_base_addr */
#define VDO_H264_REFY1_BASE_ADDR_OFFSET                         (0x198)
#define VDO_CFG_REFY1_BASE_ADDR                                 VDO_CFG_REFY1_BASE_ADDR
#define VDO_CFG_REFY1_BASE_ADDR_POS                             (0U)
#define VDO_CFG_REFY1_BASE_ADDR_LEN                             (32U)
#define VDO_CFG_REFY1_BASE_ADDR_MSK                             (((1U<<VDO_CFG_REFY1_BASE_ADDR_LEN)-1)<<VDO_CFG_REFY1_BASE_ADDR_POS)
#define VDO_CFG_REFY1_BASE_ADDR_UMSK                            (~(((1U<<VDO_CFG_REFY1_BASE_ADDR_LEN)-1)<<VDO_CFG_REFY1_BASE_ADDR_POS))

/* 0x19c : vdo_h264_refu1_base_addr */
#define VDO_H264_REFU1_BASE_ADDR_OFFSET                         (0x19c)
#define VDO_CFG_REFU1_BASE_ADDR                                 VDO_CFG_REFU1_BASE_ADDR
#define VDO_CFG_REFU1_BASE_ADDR_POS                             (0U)
#define VDO_CFG_REFU1_BASE_ADDR_LEN                             (32U)
#define VDO_CFG_REFU1_BASE_ADDR_MSK                             (((1U<<VDO_CFG_REFU1_BASE_ADDR_LEN)-1)<<VDO_CFG_REFU1_BASE_ADDR_POS)
#define VDO_CFG_REFU1_BASE_ADDR_UMSK                            (~(((1U<<VDO_CFG_REFU1_BASE_ADDR_LEN)-1)<<VDO_CFG_REFU1_BASE_ADDR_POS))

/* 0x1a0 : vdo_h264_refv1_base_addr */
#define VDO_H264_REFV1_BASE_ADDR_OFFSET                         (0x1a0)
#define VDO_CFG_REFV1_BASE_ADDR                                 VDO_CFG_REFV1_BASE_ADDR
#define VDO_CFG_REFV1_BASE_ADDR_POS                             (0U)
#define VDO_CFG_REFV1_BASE_ADDR_LEN                             (32U)
#define VDO_CFG_REFV1_BASE_ADDR_MSK                             (((1U<<VDO_CFG_REFV1_BASE_ADDR_LEN)-1)<<VDO_CFG_REFV1_BASE_ADDR_POS)
#define VDO_CFG_REFV1_BASE_ADDR_UMSK                            (~(((1U<<VDO_CFG_REFV1_BASE_ADDR_LEN)-1)<<VDO_CFG_REFV1_BASE_ADDR_POS))

/* 0x1a4 : vdo_h264_ext_base_addr */
#define VDO_H264_EXT_BASE_ADDR_OFFSET                           (0x1a4)
#define VDO_CFG_EXT_BASE_ADDR                                   VDO_CFG_EXT_BASE_ADDR
#define VDO_CFG_EXT_BASE_ADDR_POS                               (0U)
#define VDO_CFG_EXT_BASE_ADDR_LEN                               (32U)
#define VDO_CFG_EXT_BASE_ADDR_MSK                               (((1U<<VDO_CFG_EXT_BASE_ADDR_LEN)-1)<<VDO_CFG_EXT_BASE_ADDR_POS)
#define VDO_CFG_EXT_BASE_ADDR_UMSK                              (~(((1U<<VDO_CFG_EXT_BASE_ADDR_LEN)-1)<<VDO_CFG_EXT_BASE_ADDR_POS))

/* 0x1a8 : vdo_h264_s_refy0_base_addr */
#define VDO_H264_S_REFY0_BASE_ADDR_OFFSET                       (0x1a8)
#define VDO_CFG_S_REFY0_BASE_ADDR                               VDO_CFG_S_REFY0_BASE_ADDR
#define VDO_CFG_S_REFY0_BASE_ADDR_POS                           (0U)
#define VDO_CFG_S_REFY0_BASE_ADDR_LEN                           (32U)
#define VDO_CFG_S_REFY0_BASE_ADDR_MSK                           (((1U<<VDO_CFG_S_REFY0_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFY0_BASE_ADDR_POS)
#define VDO_CFG_S_REFY0_BASE_ADDR_UMSK                          (~(((1U<<VDO_CFG_S_REFY0_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFY0_BASE_ADDR_POS))

/* 0x1ac : vdo_h264_s_refu0_base_addr */
#define VDO_H264_S_REFU0_BASE_ADDR_OFFSET                       (0x1ac)
#define VDO_CFG_S_REFU0_BASE_ADDR                               VDO_CFG_S_REFU0_BASE_ADDR
#define VDO_CFG_S_REFU0_BASE_ADDR_POS                           (0U)
#define VDO_CFG_S_REFU0_BASE_ADDR_LEN                           (32U)
#define VDO_CFG_S_REFU0_BASE_ADDR_MSK                           (((1U<<VDO_CFG_S_REFU0_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFU0_BASE_ADDR_POS)
#define VDO_CFG_S_REFU0_BASE_ADDR_UMSK                          (~(((1U<<VDO_CFG_S_REFU0_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFU0_BASE_ADDR_POS))

/* 0x1b0 : vdo_h264_s_refv0_base_addr */
#define VDO_H264_S_REFV0_BASE_ADDR_OFFSET                       (0x1b0)
#define VDO_CFG_S_REFV0_BASE_ADDR                               VDO_CFG_S_REFV0_BASE_ADDR
#define VDO_CFG_S_REFV0_BASE_ADDR_POS                           (0U)
#define VDO_CFG_S_REFV0_BASE_ADDR_LEN                           (32U)
#define VDO_CFG_S_REFV0_BASE_ADDR_MSK                           (((1U<<VDO_CFG_S_REFV0_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFV0_BASE_ADDR_POS)
#define VDO_CFG_S_REFV0_BASE_ADDR_UMSK                          (~(((1U<<VDO_CFG_S_REFV0_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFV0_BASE_ADDR_POS))

/* 0x1b4 : vdo_h264_s_refy1_base_addr */
#define VDO_H264_S_REFY1_BASE_ADDR_OFFSET                       (0x1b4)
#define VDO_CFG_S_REFY1_BASE_ADDR                               VDO_CFG_S_REFY1_BASE_ADDR
#define VDO_CFG_S_REFY1_BASE_ADDR_POS                           (0U)
#define VDO_CFG_S_REFY1_BASE_ADDR_LEN                           (32U)
#define VDO_CFG_S_REFY1_BASE_ADDR_MSK                           (((1U<<VDO_CFG_S_REFY1_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFY1_BASE_ADDR_POS)
#define VDO_CFG_S_REFY1_BASE_ADDR_UMSK                          (~(((1U<<VDO_CFG_S_REFY1_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFY1_BASE_ADDR_POS))

/* 0x1b8 : vdo_h264_s_refu1_base_addr */
#define VDO_H264_S_REFU1_BASE_ADDR_OFFSET                       (0x1b8)
#define VDO_CFG_S_REFU1_BASE_ADDR                               VDO_CFG_S_REFU1_BASE_ADDR
#define VDO_CFG_S_REFU1_BASE_ADDR_POS                           (0U)
#define VDO_CFG_S_REFU1_BASE_ADDR_LEN                           (32U)
#define VDO_CFG_S_REFU1_BASE_ADDR_MSK                           (((1U<<VDO_CFG_S_REFU1_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFU1_BASE_ADDR_POS)
#define VDO_CFG_S_REFU1_BASE_ADDR_UMSK                          (~(((1U<<VDO_CFG_S_REFU1_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFU1_BASE_ADDR_POS))

