sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x1bc : vdo_h264_s_refv1_base_addr */
#define VDO_H264_S_REFV1_BASE_ADDR_OFFSET                       (0x1bc)
#define VDO_CFG_S_REFV1_BASE_ADDR                               VDO_CFG_S_REFV1_BASE_ADDR
#define VDO_CFG_S_REFV1_BASE_ADDR_POS                           (0U)
#define VDO_CFG_S_REFV1_BASE_ADDR_LEN                           (32U)
#define VDO_CFG_S_REFV1_BASE_ADDR_MSK                           (((1U<<VDO_CFG_S_REFV1_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFV1_BASE_ADDR_POS)
#define VDO_CFG_S_REFV1_BASE_ADDR_UMSK                          (~(((1U<<VDO_CFG_S_REFV1_BASE_ADDR_LEN)-1)<<VDO_CFG_S_REFV1_BASE_ADDR_POS))

/* 0x1c0 : vdo_h264_s_ext_base_addr */
#define VDO_H264_S_EXT_BASE_ADDR_OFFSET                         (0x1c0)
#define VDO_CFG_S_EXT_BASE_ADDR                                 VDO_CFG_S_EXT_BASE_ADDR
#define VDO_CFG_S_EXT_BASE_ADDR_POS                             (0U)
#define VDO_CFG_S_EXT_BASE_ADDR_LEN                             (32U)
#define VDO_CFG_S_EXT_BASE_ADDR_MSK                             (((1U<<VDO_CFG_S_EXT_BASE_ADDR_LEN)-1)<<VDO_CFG_S_EXT_BASE_ADDR_POS)
#define VDO_CFG_S_EXT_BASE_ADDR_UMSK                            (~(((1U<<VDO_CFG_S_EXT_BASE_ADDR_LEN)-1)<<VDO_CFG_S_EXT_BASE_ADDR_POS))

/* 0x1c4 : vdo_core_dbg2 */
#define VDO_CORE_DBG2_OFFSET                                    (0x1c4)
#define VDO_PFRAME                                              VDO_PFRAME
#define VDO_PFRAME_POS                                          (0U)
#define VDO_PFRAME_LEN                                          (1U)
#define VDO_PFRAME_MSK                                          (((1U<<VDO_PFRAME_LEN)-1)<<VDO_PFRAME_POS)
#define VDO_PFRAME_UMSK                                         (~(((1U<<VDO_PFRAME_LEN)-1)<<VDO_PFRAME_POS))
#define VDO_PFRAME_CNT                                          VDO_PFRAME_CNT
#define VDO_PFRAME_CNT_POS                                      (4U)
#define VDO_PFRAME_CNT_LEN                                      (10U)
#define VDO_PFRAME_CNT_MSK                                      (((1U<<VDO_PFRAME_CNT_LEN)-1)<<VDO_PFRAME_CNT_POS)
#define VDO_PFRAME_CNT_UMSK                                     (~(((1U<<VDO_PFRAME_CNT_LEN)-1)<<VDO_PFRAME_CNT_POS))
#define VDO_TCLOCK                                              VDO_TCLOCK
#define VDO_TCLOCK_POS                                          (16U)
#define VDO_TCLOCK_LEN                                          (10U)
#define VDO_TCLOCK_MSK                                          (((1U<<VDO_TCLOCK_LEN)-1)<<VDO_TCLOCK_POS)
#define VDO_TCLOCK_UMSK                                         (~(((1U<<VDO_TCLOCK_LEN)-1)<<VDO_TCLOCK_POS))
#define VDO_R_YREF_WAIT                                         VDO_R_YREF_WAIT
#define VDO_R_YREF_WAIT_POS                                     (26U)
#define VDO_R_YREF_WAIT_LEN                                     (1U)
#define VDO_R_YREF_WAIT_MSK                                     (((1U<<VDO_R_YREF_WAIT_LEN)-1)<<VDO_R_YREF_WAIT_POS)
#define VDO_R_YREF_WAIT_UMSK                                    (~(((1U<<VDO_R_YREF_WAIT_LEN)-1)<<VDO_R_YREF_WAIT_POS))
#define VDO_R_VREF_WAIT                                         VDO_R_VREF_WAIT
#define VDO_R_VREF_WAIT_POS                                     (27U)
#define VDO_R_VREF_WAIT_LEN                                     (1U)
#define VDO_R_VREF_WAIT_MSK                                     (((1U<<VDO_R_VREF_WAIT_LEN)-1)<<VDO_R_VREF_WAIT_POS)
#define VDO_R_VREF_WAIT_UMSK                                    (~(((1U<<VDO_R_VREF_WAIT_LEN)-1)<<VDO_R_VREF_WAIT_POS))
#define VDO_W_YREC_WAIT                                         VDO_W_YREC_WAIT
#define VDO_W_YREC_WAIT_POS                                     (28U)
#define VDO_W_YREC_WAIT_LEN                                     (1U)
#define VDO_W_YREC_WAIT_MSK                                     (((1U<<VDO_W_YREC_WAIT_LEN)-1)<<VDO_W_YREC_WAIT_POS)
#define VDO_W_YREC_WAIT_UMSK                                    (~(((1U<<VDO_W_YREC_WAIT_LEN)-1)<<VDO_W_YREC_WAIT_POS))
#define VDO_PFCH_VBUF_WAIT                                      VDO_PFCH_VBUF_WAIT
#define VDO_PFCH_VBUF_WAIT_POS                                  (29U)
#define VDO_PFCH_VBUF_WAIT_LEN                                  (1U)
#define VDO_PFCH_VBUF_WAIT_MSK                                  (((1U<<VDO_PFCH_VBUF_WAIT_LEN)-1)<<VDO_PFCH_VBUF_WAIT_POS)
#define VDO_PFCH_VBUF_WAIT_UMSK                                 (~(((1U<<VDO_PFCH_VBUF_WAIT_LEN)-1)<<VDO_PFCH_VBUF_WAIT_POS))
#define VDO_CABAC_WAIT                                          VDO_CABAC_WAIT
#define VDO_CABAC_WAIT_POS                                      (30U)
#define VDO_CABAC_WAIT_LEN                                      (1U)
#define VDO_CABAC_WAIT_MSK                                      (((1U<<VDO_CABAC_WAIT_LEN)-1)<<VDO_CABAC_WAIT_POS)
#define VDO_CABAC_WAIT_UMSK                                     (~(((1U<<VDO_CABAC_WAIT_LEN)-1)<<VDO_CABAC_WAIT_POS))
#define VDO_ENC_BUSY                                            VDO_ENC_BUSY
#define VDO_ENC_BUSY_POS                                        (31U)
#define VDO_ENC_BUSY_LEN                                        (1U)
#define VDO_ENC_BUSY_MSK                                        (((1U<<VDO_ENC_BUSY_LEN)-1)<<VDO_ENC_BUSY_POS)
#define VDO_ENC_BUSY_UMSK                                       (~(((1U<<VDO_ENC_BUSY_LEN)-1)<<VDO_ENC_BUSY_POS))

/* 0x1c8 : vdo_s_core_dbg2 */
#define VDO_S_CORE_DBG2_OFFSET                                  (0x1c8)
#define VDO_S_PFRAME                                            VDO_S_PFRAME
#define VDO_S_PFRAME_POS                                        (0U)
#define VDO_S_PFRAME_LEN                                        (1U)
#define VDO_S_PFRAME_MSK                                        (((1U<<VDO_S_PFRAME_LEN)-1)<<VDO_S_PFRAME_POS)
#define VDO_S_PFRAME_UMSK                                       (~(((1U<<VDO_S_PFRAME_LEN)-1)<<VDO_S_PFRAME_POS))
#define VDO_S_PFRAME_CNT                                        VDO_S_PFRAME_CNT
#define VDO_S_PFRAME_CNT_POS                                    (4U)
#define VDO_S_PFRAME_CNT_LEN                                    (10U)
#define VDO_S_PFRAME_CNT_MSK                                    (((1U<<VDO_S_PFRAME_CNT_LEN)-1)<<VDO_S_PFRAME_CNT_POS)
#define VDO_S_PFRAME_CNT_UMSK                                   (~(((1U<<VDO_S_PFRAME_CNT_LEN)-1)<<VDO_S_PFRAME_CNT_POS))
#define VDO_S_TCLOCK                                            VDO_S_TCLOCK
#define VDO_S_TCLOCK_POS                                        (16U)
#define VDO_S_TCLOCK_LEN                                        (10U)
#define VDO_S_TCLOCK_MSK                                        (((1U<<VDO_S_TCLOCK_LEN)-1)<<VDO_S_TCLOCK_POS)
#define VDO_S_TCLOCK_UMSK                                       (~(((1U<<VDO_S_TCLOCK_LEN)-1)<<VDO_S_TCLOCK_POS))
#define VDO_S_R_YREF_WAIT                                       VDO_S_R_YREF_WAIT
#define VDO_S_R_YREF_WAIT_POS                                   (26U)
#define VDO_S_R_YREF_WAIT_LEN                                   (1U)
#define VDO_S_R_YREF_WAIT_MSK                                   (((1U<<VDO_S_R_YREF_WAIT_LEN)-1)<<VDO_S_R_YREF_WAIT_POS)
#define VDO_S_R_YREF_WAIT_UMSK                                  (~(((1U<<VDO_S_R_YREF_WAIT_LEN)-1)<<VDO_S_R_YREF_WAIT_POS))
#define VDO_S_R_VREF_WAIT                                       VDO_S_R_VREF_WAIT
#define VDO_S_R_VREF_WAIT_POS                                   (27U)
#define VDO_S_R_VREF_WAIT_LEN                                   (1U)
#define VDO_S_R_VREF_WAIT_MSK                                   (((1U<<VDO_S_R_VREF_WAIT_LEN)-1)<<VDO_S_R_VREF_WAIT_POS)
#define VDO_S_R_VREF_WAIT_UMSK                                  (~(((1U<<VDO_S_R_VREF_WAIT_LEN)-1)<<VDO_S_R_VREF_WAIT_POS))
#define VDO_S_W_YREC_WAIT                                       VDO_S_W_YREC_WAIT
#define VDO_S_W_YREC_WAIT_POS                                   (28U)
#define VDO_S_W_YREC_WAIT_LEN                                   (1U)
#define VDO_S_W_YREC_WAIT_MSK                                   (((1U<<VDO_S_W_YREC_WAIT_LEN)-1)<<VDO_S_W_YREC_WAIT_POS)
#define VDO_S_W_YREC_WAIT_UMSK                                  (~(((1U<<VDO_S_W_YREC_WAIT_LEN)-1)<<VDO_S_W_YREC_WAIT_POS))
#define VDO_S_PFCH_VBUF_WAIT                                    VDO_S_PFCH_VBUF_WAIT
#define VDO_S_PFCH_VBUF_WAIT_POS                                (29U)
#define VDO_S_PFCH_VBUF_WAIT_LEN                                (1U)
#define VDO_S_PFCH_VBUF_WAIT_MSK                                (((1U<<VDO_S_PFCH_VBUF_WAIT_LEN)-1)<<VDO_S_PFCH_VBUF_WAIT_POS)
#define VDO_S_PFCH_VBUF_WAIT_UMSK                               (~(((1U<<VDO_S_PFCH_VBUF_WAIT_LEN)-1)<<VDO_S_PFCH_VBUF_WAIT_POS))
#define VDO_S_CABAC_WAIT                                        VDO_S_CABAC_WAIT
#define VDO_S_CABAC_WAIT_POS                                    (30U)
#define VDO_S_CABAC_WAIT_LEN                                    (1U)
#define VDO_S_CABAC_WAIT_MSK                                    (((1U<<VDO_S_CABAC_WAIT_LEN)-1)<<VDO_S_CABAC_WAIT_POS)
#define VDO_S_CABAC_WAIT_UMSK                                   (~(((1U<<VDO_S_CABAC_WAIT_LEN)-1)<<VDO_S_CABAC_WAIT_POS))
#define VDO_S_ENC_BUSY                                          VDO_S_ENC_BUSY
#define VDO_S_ENC_BUSY_POS                                      (31U)
#define VDO_S_ENC_BUSY_LEN                                      (1U)
#define VDO_S_ENC_BUSY_MSK                                      (((1U<<VDO_S_ENC_BUSY_LEN)-1)<<VDO_S_ENC_BUSY_POS)
#define VDO_S_ENC_BUSY_UMSK                                     (~(((1U<<VDO_S_ENC_BUSY_LEN)-1)<<VDO_S_ENC_BUSY_POS))

/* 0x1cc : vdo_h264_y_srcbf_size */
#define VDO_H264_Y_SRCBF_SIZE_OFFSET                            (0x1cc)
#define VDO_CFG_Y_SRCBF_BYCNT                                   VDO_CFG_Y_SRCBF_BYCNT
#define VDO_CFG_Y_SRCBF_BYCNT_POS                               (0U)
#define VDO_CFG_Y_SRCBF_BYCNT_LEN                               (32U)
#define VDO_CFG_Y_SRCBF_BYCNT_MSK                               (((1U<<VDO_CFG_Y_SRCBF_BYCNT_LEN)-1)<<VDO_CFG_Y_SRCBF_BYCNT_POS)
#define VDO_CFG_Y_SRCBF_BYCNT_UMSK                              (~(((1U<<VDO_CFG_Y_SRCBF_BYCNT_LEN)-1)<<VDO_CFG_Y_SRCBF_BYCNT_POS))

/* 0x1d0 : vdo_h264_uv_srcbf_size */
#define VDO_H264_UV_SRCBF_SIZE_OFFSET                           (0x1d0)
#define VDO_CFG_UV_SRCBF_BYCNT                                  VDO_CFG_UV_SRCBF_BYCNT
#define VDO_CFG_UV_SRCBF_BYCNT_POS                              (0U)
#define VDO_CFG_UV_SRCBF_BYCNT_LEN                              (32U)
#define VDO_CFG_UV_SRCBF_BYCNT_MSK                              (((1U<<VDO_CFG_UV_SRCBF_BYCNT_LEN)-1)<<VDO_CFG_UV_SRCBF_BYCNT_POS)
#define VDO_CFG_UV_SRCBF_BYCNT_UMSK                             (~(((1U<<VDO_CFG_UV_SRCBF_BYCNT_LEN)-1)<<VDO_CFG_UV_SRCBF_BYCNT_POS))

