sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x1d4 : vdo_h264_s_y_srcbf_size */
#define VDO_H264_S_Y_SRCBF_SIZE_OFFSET                          (0x1d4)
#define VDO_CFG_S_Y_SRCBF_BYCNT                                 VDO_CFG_S_Y_SRCBF_BYCNT
#define VDO_CFG_S_Y_SRCBF_BYCNT_POS                             (0U)
#define VDO_CFG_S_Y_SRCBF_BYCNT_LEN                             (32U)
#define VDO_CFG_S_Y_SRCBF_BYCNT_MSK                             (((1U<<VDO_CFG_S_Y_SRCBF_BYCNT_LEN)-1)<<VDO_CFG_S_Y_SRCBF_BYCNT_POS)
#define VDO_CFG_S_Y_SRCBF_BYCNT_UMSK                            (~(((1U<<VDO_CFG_S_Y_SRCBF_BYCNT_LEN)-1)<<VDO_CFG_S_Y_SRCBF_BYCNT_POS))

/* 0x1d8 : vdo_h264_s_uv_srcbf_size */
#define VDO_H264_S_UV_SRCBF_SIZE_OFFSET                         (0x1d8)
#define VDO_CFG_S_UV_SRCBF_BYCNT                                VDO_CFG_S_UV_SRCBF_BYCNT
#define VDO_CFG_S_UV_SRCBF_BYCNT_POS                            (0U)
#define VDO_CFG_S_UV_SRCBF_BYCNT_LEN                            (32U)
#define VDO_CFG_S_UV_SRCBF_BYCNT_MSK                            (((1U<<VDO_CFG_S_UV_SRCBF_BYCNT_LEN)-1)<<VDO_CFG_S_UV_SRCBF_BYCNT_POS)
#define VDO_CFG_S_UV_SRCBF_BYCNT_UMSK                           (~(((1U<<VDO_CFG_S_UV_SRCBF_BYCNT_LEN)-1)<<VDO_CFG_S_UV_SRCBF_BYCNT_POS))

/* 0x1dc : vdo_h264_src_dbg */
#define VDO_H264_SRC_DBG_OFFSET                                 (0x1dc)
#define VDO_D2B_SYNC_EN                                         VDO_D2B_SYNC_EN
#define VDO_D2B_SYNC_EN_POS                                     (0U)
#define VDO_D2B_SYNC_EN_LEN                                     (1U)
#define VDO_D2B_SYNC_EN_MSK                                     (((1U<<VDO_D2B_SYNC_EN_LEN)-1)<<VDO_D2B_SYNC_EN_POS)
#define VDO_D2B_SYNC_EN_UMSK                                    (~(((1U<<VDO_D2B_SYNC_EN_LEN)-1)<<VDO_D2B_SYNC_EN_POS))
#define VDO_OLD_READ_MODE                                       VDO_OLD_READ_MODE
#define VDO_OLD_READ_MODE_POS                                   (4U)
#define VDO_OLD_READ_MODE_LEN                                   (5U)
#define VDO_OLD_READ_MODE_MSK                                   (((1U<<VDO_OLD_READ_MODE_LEN)-1)<<VDO_OLD_READ_MODE_POS)
#define VDO_OLD_READ_MODE_UMSK                                  (~(((1U<<VDO_OLD_READ_MODE_LEN)-1)<<VDO_OLD_READ_MODE_POS))
#define VDO_S_D2B_SYNC_EN                                       VDO_S_D2B_SYNC_EN
#define VDO_S_D2B_SYNC_EN_POS                                   (16U)
#define VDO_S_D2B_SYNC_EN_LEN                                   (1U)
#define VDO_S_D2B_SYNC_EN_MSK                                   (((1U<<VDO_S_D2B_SYNC_EN_LEN)-1)<<VDO_S_D2B_SYNC_EN_POS)
#define VDO_S_D2B_SYNC_EN_UMSK                                  (~(((1U<<VDO_S_D2B_SYNC_EN_LEN)-1)<<VDO_S_D2B_SYNC_EN_POS))
#define VDO_S_OLD_READ_MODE                                     VDO_S_OLD_READ_MODE
#define VDO_S_OLD_READ_MODE_POS                                 (20U)
#define VDO_S_OLD_READ_MODE_LEN                                 (5U)
#define VDO_S_OLD_READ_MODE_MSK                                 (((1U<<VDO_S_OLD_READ_MODE_LEN)-1)<<VDO_S_OLD_READ_MODE_POS)
#define VDO_S_OLD_READ_MODE_UMSK                                (~(((1U<<VDO_S_OLD_READ_MODE_LEN)-1)<<VDO_S_OLD_READ_MODE_POS))

/* 0x1e0 : vdo_h264_yy_d2b_addr */
#define VDO_H264_YY_D2B_ADDR_OFFSET                             (0x1e0)
#define VDO_YY_D2B_ADDR_DBG                                     VDO_YY_D2B_ADDR_DBG
#define VDO_YY_D2B_ADDR_DBG_POS                                 (0U)
#define VDO_YY_D2B_ADDR_DBG_LEN                                 (32U)
#define VDO_YY_D2B_ADDR_DBG_MSK                                 (((1U<<VDO_YY_D2B_ADDR_DBG_LEN)-1)<<VDO_YY_D2B_ADDR_DBG_POS)
#define VDO_YY_D2B_ADDR_DBG_UMSK                                (~(((1U<<VDO_YY_D2B_ADDR_DBG_LEN)-1)<<VDO_YY_D2B_ADDR_DBG_POS))

/* 0x1e4 : vdo_h264_uv_d2b_addr */
#define VDO_H264_UV_D2B_ADDR_OFFSET                             (0x1e4)
#define VDO_UV_D2B_ADDR_DBG                                     VDO_UV_D2B_ADDR_DBG
#define VDO_UV_D2B_ADDR_DBG_POS                                 (0U)
#define VDO_UV_D2B_ADDR_DBG_LEN                                 (32U)
#define VDO_UV_D2B_ADDR_DBG_MSK                                 (((1U<<VDO_UV_D2B_ADDR_DBG_LEN)-1)<<VDO_UV_D2B_ADDR_DBG_POS)
#define VDO_UV_D2B_ADDR_DBG_UMSK                                (~(((1U<<VDO_UV_D2B_ADDR_DBG_LEN)-1)<<VDO_UV_D2B_ADDR_DBG_POS))

/* 0x1e8 : vdo_h264_yy_ofst_addr */
#define VDO_H264_YY_OFST_ADDR_OFFSET                            (0x1e8)
#define VDO_YY_MFRM_OFST_DBG                                    VDO_YY_MFRM_OFST_DBG
#define VDO_YY_MFRM_OFST_DBG_POS                                (0U)
#define VDO_YY_MFRM_OFST_DBG_LEN                                (32U)
#define VDO_YY_MFRM_OFST_DBG_MSK                                (((1U<<VDO_YY_MFRM_OFST_DBG_LEN)-1)<<VDO_YY_MFRM_OFST_DBG_POS)
#define VDO_YY_MFRM_OFST_DBG_UMSK                               (~(((1U<<VDO_YY_MFRM_OFST_DBG_LEN)-1)<<VDO_YY_MFRM_OFST_DBG_POS))

/* 0x1ec : vdo_h264_uv_ofst_addr */
#define VDO_H264_UV_OFST_ADDR_OFFSET                            (0x1ec)
#define VDO_UV_MFRM_OFST_DBG                                    VDO_UV_MFRM_OFST_DBG
#define VDO_UV_MFRM_OFST_DBG_POS                                (0U)
#define VDO_UV_MFRM_OFST_DBG_LEN                                (32U)
#define VDO_UV_MFRM_OFST_DBG_MSK                                (((1U<<VDO_UV_MFRM_OFST_DBG_LEN)-1)<<VDO_UV_MFRM_OFST_DBG_POS)
#define VDO_UV_MFRM_OFST_DBG_UMSK                               (~(((1U<<VDO_UV_MFRM_OFST_DBG_LEN)-1)<<VDO_UV_MFRM_OFST_DBG_POS))

/* 0x1f0 : vdo_h264_d2b_ml */
#define VDO_H264_D2B_ML_OFFSET                                  (0x1f0)
#define VDO_YY_D2B_ML_DBG                                       VDO_YY_D2B_ML_DBG
#define VDO_YY_D2B_ML_DBG_POS                                   (0U)
#define VDO_YY_D2B_ML_DBG_LEN                                   (16U)
#define VDO_YY_D2B_ML_DBG_MSK                                   (((1U<<VDO_YY_D2B_ML_DBG_LEN)-1)<<VDO_YY_D2B_ML_DBG_POS)
#define VDO_YY_D2B_ML_DBG_UMSK                                  (~(((1U<<VDO_YY_D2B_ML_DBG_LEN)-1)<<VDO_YY_D2B_ML_DBG_POS))
#define VDO_UV_D2B_ML_DBG                                       VDO_UV_D2B_ML_DBG
#define VDO_UV_D2B_ML_DBG_POS                                   (16U)
#define VDO_UV_D2B_ML_DBG_LEN                                   (16U)
#define VDO_UV_D2B_ML_DBG_MSK                                   (((1U<<VDO_UV_D2B_ML_DBG_LEN)-1)<<VDO_UV_D2B_ML_DBG_POS)
#define VDO_UV_D2B_ML_DBG_UMSK                                  (~(((1U<<VDO_UV_D2B_ML_DBG_LEN)-1)<<VDO_UV_D2B_ML_DBG_POS))

/* 0x1f4 : vdo_h264_load_mbidx_dbg */
#define VDO_H264_LOAD_MBIDX_DBG_OFFSET                          (0x1f4)
#define VDO_LOAD_MBIDX_DBG                                      VDO_LOAD_MBIDX_DBG
#define VDO_LOAD_MBIDX_DBG_POS                                  (0U)
#define VDO_LOAD_MBIDX_DBG_LEN                                  (32U)
#define VDO_LOAD_MBIDX_DBG_MSK                                  (((1U<<VDO_LOAD_MBIDX_DBG_LEN)-1)<<VDO_LOAD_MBIDX_DBG_POS)
#define VDO_LOAD_MBIDX_DBG_UMSK                                 (~(((1U<<VDO_LOAD_MBIDX_DBG_LEN)-1)<<VDO_LOAD_MBIDX_DBG_POS))

/* 0x1f8 : vdo_h264_yc_mb_err */
#define VDO_H264_YC_MB_ERR_OFFSET                               (0x1f8)
#define VDO_YC_MB_ERR                                           VDO_YC_MB_ERR
#define VDO_YC_MB_ERR_POS                                       (0U)
#define VDO_YC_MB_ERR_LEN                                       (3U)
#define VDO_YC_MB_ERR_MSK                                       (((1U<<VDO_YC_MB_ERR_LEN)-1)<<VDO_YC_MB_ERR_POS)
#define VDO_YC_MB_ERR_UMSK                                      (~(((1U<<VDO_YC_MB_ERR_LEN)-1)<<VDO_YC_MB_ERR_POS))

