sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x1fc : vdo_h264_s_yy_d2b_addr */
#define VDO_H264_S_YY_D2B_ADDR_OFFSET                           (0x1fc)
#define VDO_S_YY_D2B_ADDR_DBG                                   VDO_S_YY_D2B_ADDR_DBG
#define VDO_S_YY_D2B_ADDR_DBG_POS                               (0U)
#define VDO_S_YY_D2B_ADDR_DBG_LEN                               (32U)
#define VDO_S_YY_D2B_ADDR_DBG_MSK                               (((1U<<VDO_S_YY_D2B_ADDR_DBG_LEN)-1)<<VDO_S_YY_D2B_ADDR_DBG_POS)
#define VDO_S_YY_D2B_ADDR_DBG_UMSK                              (~(((1U<<VDO_S_YY_D2B_ADDR_DBG_LEN)-1)<<VDO_S_YY_D2B_ADDR_DBG_POS))

/* 0x200 : vdo_h264_s_uv_d2b_addr */
#define VDO_H264_S_UV_D2B_ADDR_OFFSET                           (0x200)
#define VDO_S_UV_D2B_ADDR_DBG                                   VDO_S_UV_D2B_ADDR_DBG
#define VDO_S_UV_D2B_ADDR_DBG_POS                               (0U)
#define VDO_S_UV_D2B_ADDR_DBG_LEN                               (32U)
#define VDO_S_UV_D2B_ADDR_DBG_MSK                               (((1U<<VDO_S_UV_D2B_ADDR_DBG_LEN)-1)<<VDO_S_UV_D2B_ADDR_DBG_POS)
#define VDO_S_UV_D2B_ADDR_DBG_UMSK                              (~(((1U<<VDO_S_UV_D2B_ADDR_DBG_LEN)-1)<<VDO_S_UV_D2B_ADDR_DBG_POS))

/* 0x204 : vdo_h264_s_yy_ofst_addr */
#define VDO_H264_S_YY_OFST_ADDR_OFFSET                          (0x204)
#define VDO_S_YY_MFRM_OFST_DBG                                  VDO_S_YY_MFRM_OFST_DBG
#define VDO_S_YY_MFRM_OFST_DBG_POS                              (0U)
#define VDO_S_YY_MFRM_OFST_DBG_LEN                              (32U)
#define VDO_S_YY_MFRM_OFST_DBG_MSK                              (((1U<<VDO_S_YY_MFRM_OFST_DBG_LEN)-1)<<VDO_S_YY_MFRM_OFST_DBG_POS)
#define VDO_S_YY_MFRM_OFST_DBG_UMSK                             (~(((1U<<VDO_S_YY_MFRM_OFST_DBG_LEN)-1)<<VDO_S_YY_MFRM_OFST_DBG_POS))

/* 0x208 : vdo_h264_s_uv_ofst_addr */
#define VDO_H264_S_UV_OFST_ADDR_OFFSET                          (0x208)
#define VDO_S_UV_MFRM_OFST_DBG                                  VDO_S_UV_MFRM_OFST_DBG
#define VDO_S_UV_MFRM_OFST_DBG_POS                              (0U)
#define VDO_S_UV_MFRM_OFST_DBG_LEN                              (32U)
#define VDO_S_UV_MFRM_OFST_DBG_MSK                              (((1U<<VDO_S_UV_MFRM_OFST_DBG_LEN)-1)<<VDO_S_UV_MFRM_OFST_DBG_POS)
#define VDO_S_UV_MFRM_OFST_DBG_UMSK                             (~(((1U<<VDO_S_UV_MFRM_OFST_DBG_LEN)-1)<<VDO_S_UV_MFRM_OFST_DBG_POS))

/* 0x20c : vdo_h264_s_d2b_ml */
#define VDO_H264_S_D2B_ML_OFFSET                                (0x20c)
#define VDO_S_YY_D2B_ML_DBG                                     VDO_S_YY_D2B_ML_DBG
#define VDO_S_YY_D2B_ML_DBG_POS                                 (0U)
#define VDO_S_YY_D2B_ML_DBG_LEN                                 (16U)
#define VDO_S_YY_D2B_ML_DBG_MSK                                 (((1U<<VDO_S_YY_D2B_ML_DBG_LEN)-1)<<VDO_S_YY_D2B_ML_DBG_POS)
#define VDO_S_YY_D2B_ML_DBG_UMSK                                (~(((1U<<VDO_S_YY_D2B_ML_DBG_LEN)-1)<<VDO_S_YY_D2B_ML_DBG_POS))
#define VDO_S_UV_D2B_ML_DBG                                     VDO_S_UV_D2B_ML_DBG
#define VDO_S_UV_D2B_ML_DBG_POS                                 (16U)
#define VDO_S_UV_D2B_ML_DBG_LEN                                 (16U)
#define VDO_S_UV_D2B_ML_DBG_MSK                                 (((1U<<VDO_S_UV_D2B_ML_DBG_LEN)-1)<<VDO_S_UV_D2B_ML_DBG_POS)
#define VDO_S_UV_D2B_ML_DBG_UMSK                                (~(((1U<<VDO_S_UV_D2B_ML_DBG_LEN)-1)<<VDO_S_UV_D2B_ML_DBG_POS))

/* 0x210 : vdo_h264_s_load_mbidx_dbg */
#define VDO_H264_S_LOAD_MBIDX_DBG_OFFSET                        (0x210)
#define VDO_S_LOAD_MBIDX_DBG                                    VDO_S_LOAD_MBIDX_DBG
#define VDO_S_LOAD_MBIDX_DBG_POS                                (0U)
#define VDO_S_LOAD_MBIDX_DBG_LEN                                (32U)
#define VDO_S_LOAD_MBIDX_DBG_MSK                                (((1U<<VDO_S_LOAD_MBIDX_DBG_LEN)-1)<<VDO_S_LOAD_MBIDX_DBG_POS)
#define VDO_S_LOAD_MBIDX_DBG_UMSK                               (~(((1U<<VDO_S_LOAD_MBIDX_DBG_LEN)-1)<<VDO_S_LOAD_MBIDX_DBG_POS))

/* 0x214 : vdo_h264_s_yc_mb_err */
#define VDO_H264_S_YC_MB_ERR_OFFSET                             (0x214)
#define VDO_S_YC_MB_ERR                                         VDO_S_YC_MB_ERR
#define VDO_S_YC_MB_ERR_POS                                     (0U)
#define VDO_S_YC_MB_ERR_LEN                                     (3U)
#define VDO_S_YC_MB_ERR_MSK                                     (((1U<<VDO_S_YC_MB_ERR_LEN)-1)<<VDO_S_YC_MB_ERR_POS)
#define VDO_S_YC_MB_ERR_UMSK                                    (~(((1U<<VDO_S_YC_MB_ERR_LEN)-1)<<VDO_S_YC_MB_ERR_POS))

/* 0x228 : vdo_h264_pfch_ctrl */
#define VDO_H264_PFCH_CTRL_OFFSET                               (0x228)
#define VDO_CFG_PFCH_MBX_S                                      VDO_CFG_PFCH_MBX_S
#define VDO_CFG_PFCH_MBX_S_POS                                  (0U)
#define VDO_CFG_PFCH_MBX_S_LEN                                  (7U)
#define VDO_CFG_PFCH_MBX_S_MSK                                  (((1U<<VDO_CFG_PFCH_MBX_S_LEN)-1)<<VDO_CFG_PFCH_MBX_S_POS)
#define VDO_CFG_PFCH_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_PFCH_MBX_S_LEN)-1)<<VDO_CFG_PFCH_MBX_S_POS))
#define VDO_CFG_PFCH_MBY_S                                      VDO_CFG_PFCH_MBY_S
#define VDO_CFG_PFCH_MBY_S_POS                                  (8U)
#define VDO_CFG_PFCH_MBY_S_LEN                                  (7U)
#define VDO_CFG_PFCH_MBY_S_MSK                                  (((1U<<VDO_CFG_PFCH_MBY_S_LEN)-1)<<VDO_CFG_PFCH_MBY_S_POS)
#define VDO_CFG_PFCH_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_PFCH_MBY_S_LEN)-1)<<VDO_CFG_PFCH_MBY_S_POS))
#define VDO_CFG_PFCH_EN                                         VDO_CFG_PFCH_EN
#define VDO_CFG_PFCH_EN_POS                                     (16U)
#define VDO_CFG_PFCH_EN_LEN                                     (1U)
#define VDO_CFG_PFCH_EN_MSK                                     (((1U<<VDO_CFG_PFCH_EN_LEN)-1)<<VDO_CFG_PFCH_EN_POS)
#define VDO_CFG_PFCH_EN_UMSK                                    (~(((1U<<VDO_CFG_PFCH_EN_LEN)-1)<<VDO_CFG_PFCH_EN_POS))

/* 0x22c : vdo_h264_pfch_base */
#define VDO_H264_PFCH_BASE_OFFSET                               (0x22c)
#define VDO_CFG_PFCH_BASE_ADDR                                  VDO_CFG_PFCH_BASE_ADDR
#define VDO_CFG_PFCH_BASE_ADDR_POS                              (0U)
#define VDO_CFG_PFCH_BASE_ADDR_LEN                              (32U)
#define VDO_CFG_PFCH_BASE_ADDR_MSK                              (((1U<<VDO_CFG_PFCH_BASE_ADDR_LEN)-1)<<VDO_CFG_PFCH_BASE_ADDR_POS)
#define VDO_CFG_PFCH_BASE_ADDR_UMSK                             (~(((1U<<VDO_CFG_PFCH_BASE_ADDR_LEN)-1)<<VDO_CFG_PFCH_BASE_ADDR_POS))

/* 0x230 : vdo_h264_pfchv_base */
#define VDO_H264_PFCHV_BASE_OFFSET                              (0x230)
#define VDO_CFG_PFCHV_BASE_ADDR                                 VDO_CFG_PFCHV_BASE_ADDR
#define VDO_CFG_PFCHV_BASE_ADDR_POS                             (0U)
#define VDO_CFG_PFCHV_BASE_ADDR_LEN                             (32U)
#define VDO_CFG_PFCHV_BASE_ADDR_MSK                             (((1U<<VDO_CFG_PFCHV_BASE_ADDR_LEN)-1)<<VDO_CFG_PFCHV_BASE_ADDR_POS)
#define VDO_CFG_PFCHV_BASE_ADDR_UMSK                            (~(((1U<<VDO_CFG_PFCHV_BASE_ADDR_LEN)-1)<<VDO_CFG_PFCHV_BASE_ADDR_POS))

/* 0x234 : vdo_h264_s_pfch_ctrl */
#define VDO_H264_S_PFCH_CTRL_OFFSET                             (0x234)
#define VDO_CFG_S_PFCH_MBX_S                                    VDO_CFG_S_PFCH_MBX_S
#define VDO_CFG_S_PFCH_MBX_S_POS                                (0U)
#define VDO_CFG_S_PFCH_MBX_S_LEN                                (7U)
#define VDO_CFG_S_PFCH_MBX_S_MSK                                (((1U<<VDO_CFG_S_PFCH_MBX_S_LEN)-1)<<VDO_CFG_S_PFCH_MBX_S_POS)
#define VDO_CFG_S_PFCH_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_PFCH_MBX_S_LEN)-1)<<VDO_CFG_S_PFCH_MBX_S_POS))
#define VDO_CFG_S_PFCH_MBY_S                                    VDO_CFG_S_PFCH_MBY_S
#define VDO_CFG_S_PFCH_MBY_S_POS                                (8U)
#define VDO_CFG_S_PFCH_MBY_S_LEN                                (7U)
#define VDO_CFG_S_PFCH_MBY_S_MSK                                (((1U<<VDO_CFG_S_PFCH_MBY_S_LEN)-1)<<VDO_CFG_S_PFCH_MBY_S_POS)
#define VDO_CFG_S_PFCH_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_PFCH_MBY_S_LEN)-1)<<VDO_CFG_S_PFCH_MBY_S_POS))
#define VDO_CFG_S_PFCH_EN                                       VDO_CFG_S_PFCH_EN
#define VDO_CFG_S_PFCH_EN_POS                                   (16U)
#define VDO_CFG_S_PFCH_EN_LEN                                   (1U)
#define VDO_CFG_S_PFCH_EN_MSK                                   (((1U<<VDO_CFG_S_PFCH_EN_LEN)-1)<<VDO_CFG_S_PFCH_EN_POS)
#define VDO_CFG_S_PFCH_EN_UMSK                                  (~(((1U<<VDO_CFG_S_PFCH_EN_LEN)-1)<<VDO_CFG_S_PFCH_EN_POS))

/* 0x238 : vdo_h264_s_pfch_base */
#define VDO_H264_S_PFCH_BASE_OFFSET                             (0x238)
#define VDO_CFG_S_PFCH_BASE_ADDR                                VDO_CFG_S_PFCH_BASE_ADDR
#define VDO_CFG_S_PFCH_BASE_ADDR_POS                            (0U)
#define VDO_CFG_S_PFCH_BASE_ADDR_LEN                            (32U)
#define VDO_CFG_S_PFCH_BASE_ADDR_MSK                            (((1U<<VDO_CFG_S_PFCH_BASE_ADDR_LEN)-1)<<VDO_CFG_S_PFCH_BASE_ADDR_POS)
#define VDO_CFG_S_PFCH_BASE_ADDR_UMSK                           (~(((1U<<VDO_CFG_S_PFCH_BASE_ADDR_LEN)-1)<<VDO_CFG_S_PFCH_BASE_ADDR_POS))

/* 0x23c : vdo_h264_s_pfchv_base */
#define VDO_H264_S_PFCHV_BASE_OFFSET                            (0x23c)
#define VDO_CFG_S_PFCHV_BASE_ADDR                               VDO_CFG_S_PFCHV_BASE_ADDR
#define VDO_CFG_S_PFCHV_BASE_ADDR_POS                           (0U)
#define VDO_CFG_S_PFCHV_BASE_ADDR_LEN                           (32U)
#define VDO_CFG_S_PFCHV_BASE_ADDR_MSK                           (((1U<<VDO_CFG_S_PFCHV_BASE_ADDR_LEN)-1)<<VDO_CFG_S_PFCHV_BASE_ADDR_POS)
#define VDO_CFG_S_PFCHV_BASE_ADDR_UMSK                          (~(((1U<<VDO_CFG_S_PFCHV_BASE_ADDR_LEN)-1)<<VDO_CFG_S_PFCHV_BASE_ADDR_POS))

