sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x240 : vdo_h264_hwback_mode */
#define VDO_H264_HWBACK_MODE_OFFSET                             (0x240)
#define VDO_CFG_SRAMCK_MODE                                     VDO_CFG_SRAMCK_MODE
#define VDO_CFG_SRAMCK_MODE_POS                                 (0U)
#define VDO_CFG_SRAMCK_MODE_LEN                                 (1U)
#define VDO_CFG_SRAMCK_MODE_MSK                                 (((1U<<VDO_CFG_SRAMCK_MODE_LEN)-1)<<VDO_CFG_SRAMCK_MODE_POS)
#define VDO_CFG_SRAMCK_MODE_UMSK                                (~(((1U<<VDO_CFG_SRAMCK_MODE_LEN)-1)<<VDO_CFG_SRAMCK_MODE_POS))
#define VDO_CFG_NAL_MP_MODE                                     VDO_CFG_NAL_MP_MODE
#define VDO_CFG_NAL_MP_MODE_POS                                 (1U)
#define VDO_CFG_NAL_MP_MODE_LEN                                 (1U)
#define VDO_CFG_NAL_MP_MODE_MSK                                 (((1U<<VDO_CFG_NAL_MP_MODE_LEN)-1)<<VDO_CFG_NAL_MP_MODE_POS)
#define VDO_CFG_NAL_MP_MODE_UMSK                                (~(((1U<<VDO_CFG_NAL_MP_MODE_LEN)-1)<<VDO_CFG_NAL_MP_MODE_POS))
#define VDO_CFG_S_NAL_MP_MODE                                   VDO_CFG_S_NAL_MP_MODE
#define VDO_CFG_S_NAL_MP_MODE_POS                               (2U)
#define VDO_CFG_S_NAL_MP_MODE_LEN                               (1U)
#define VDO_CFG_S_NAL_MP_MODE_MSK                               (((1U<<VDO_CFG_S_NAL_MP_MODE_LEN)-1)<<VDO_CFG_S_NAL_MP_MODE_POS)
#define VDO_CFG_S_NAL_MP_MODE_UMSK                              (~(((1U<<VDO_CFG_S_NAL_MP_MODE_LEN)-1)<<VDO_CFG_S_NAL_MP_MODE_POS))

/* 0x244 : vdo_h264_roi_mode */
#define VDO_H264_ROI_MODE_OFFSET                                (0x244)
#define VDO_CFG_ROI_EN                                          VDO_CFG_ROI_EN
#define VDO_CFG_ROI_EN_POS                                      (0U)
#define VDO_CFG_ROI_EN_LEN                                      (8U)
#define VDO_CFG_ROI_EN_MSK                                      (((1U<<VDO_CFG_ROI_EN_LEN)-1)<<VDO_CFG_ROI_EN_POS)
#define VDO_CFG_ROI_EN_UMSK                                     (~(((1U<<VDO_CFG_ROI_EN_LEN)-1)<<VDO_CFG_ROI_EN_POS))
#define VDO_CFG_ROI_UPD                                         VDO_CFG_ROI_UPD
#define VDO_CFG_ROI_UPD_POS                                     (8U)
#define VDO_CFG_ROI_UPD_LEN                                     (1U)
#define VDO_CFG_ROI_UPD_MSK                                     (((1U<<VDO_CFG_ROI_UPD_LEN)-1)<<VDO_CFG_ROI_UPD_POS)
#define VDO_CFG_ROI_UPD_UMSK                                    (~(((1U<<VDO_CFG_ROI_UPD_LEN)-1)<<VDO_CFG_ROI_UPD_POS))

/* 0x248 : vdo_h264_roi_bit */
#define VDO_H264_ROI_BIT_OFFSET                                 (0x248)
#define VDO_CFG_PBIT_RATIO                                      VDO_CFG_PBIT_RATIO
#define VDO_CFG_PBIT_RATIO_POS                                  (0U)
#define VDO_CFG_PBIT_RATIO_LEN                                  (13U)
#define VDO_CFG_PBIT_RATIO_MSK                                  (((1U<<VDO_CFG_PBIT_RATIO_LEN)-1)<<VDO_CFG_PBIT_RATIO_POS)
#define VDO_CFG_PBIT_RATIO_UMSK                                 (~(((1U<<VDO_CFG_PBIT_RATIO_LEN)-1)<<VDO_CFG_PBIT_RATIO_POS))
#define VDO_CFG_IBIT_RATIO                                      VDO_CFG_IBIT_RATIO
#define VDO_CFG_IBIT_RATIO_POS                                  (13U)
#define VDO_CFG_IBIT_RATIO_LEN                                  (13U)
#define VDO_CFG_IBIT_RATIO_MSK                                  (((1U<<VDO_CFG_IBIT_RATIO_LEN)-1)<<VDO_CFG_IBIT_RATIO_POS)
#define VDO_CFG_IBIT_RATIO_UMSK                                 (~(((1U<<VDO_CFG_IBIT_RATIO_LEN)-1)<<VDO_CFG_IBIT_RATIO_POS))
#define VDO_CFG_ITHRE                                           VDO_CFG_ITHRE
#define VDO_CFG_ITHRE_POS                                       (26U)
#define VDO_CFG_ITHRE_LEN                                       (6U)
#define VDO_CFG_ITHRE_MSK                                       (((1U<<VDO_CFG_ITHRE_LEN)-1)<<VDO_CFG_ITHRE_POS)
#define VDO_CFG_ITHRE_UMSK                                      (~(((1U<<VDO_CFG_ITHRE_LEN)-1)<<VDO_CFG_ITHRE_POS))

/* 0x24c : vdo_h264_roi_qptune */
#define VDO_H264_ROI_QPTUNE_OFFSET                              (0x24c)
#define VDO_CFG_PQP_DECR                                        VDO_CFG_PQP_DECR
#define VDO_CFG_PQP_DECR_POS                                    (0U)
#define VDO_CFG_PQP_DECR_LEN                                    (6U)
#define VDO_CFG_PQP_DECR_MSK                                    (((1U<<VDO_CFG_PQP_DECR_LEN)-1)<<VDO_CFG_PQP_DECR_POS)
#define VDO_CFG_PQP_DECR_UMSK                                   (~(((1U<<VDO_CFG_PQP_DECR_LEN)-1)<<VDO_CFG_PQP_DECR_POS))
#define VDO_CFG_IQP_DECR                                        VDO_CFG_IQP_DECR
#define VDO_CFG_IQP_DECR_POS                                    (8U)
#define VDO_CFG_IQP_DECR_LEN                                    (6U)
#define VDO_CFG_IQP_DECR_MSK                                    (((1U<<VDO_CFG_IQP_DECR_LEN)-1)<<VDO_CFG_IQP_DECR_POS)
#define VDO_CFG_IQP_DECR_UMSK                                   (~(((1U<<VDO_CFG_IQP_DECR_LEN)-1)<<VDO_CFG_IQP_DECR_POS))
#define VDO_CFG_N2R_QP_DECR                                     VDO_CFG_N2R_QP_DECR
#define VDO_CFG_N2R_QP_DECR_POS                                 (16U)
#define VDO_CFG_N2R_QP_DECR_LEN                                 (6U)
#define VDO_CFG_N2R_QP_DECR_MSK                                 (((1U<<VDO_CFG_N2R_QP_DECR_LEN)-1)<<VDO_CFG_N2R_QP_DECR_POS)
#define VDO_CFG_N2R_QP_DECR_UMSK                                (~(((1U<<VDO_CFG_N2R_QP_DECR_LEN)-1)<<VDO_CFG_N2R_QP_DECR_POS))
#define VDO_CFG_FIXQP                                           VDO_CFG_FIXQP
#define VDO_CFG_FIXQP_POS                                       (24U)
#define VDO_CFG_FIXQP_LEN                                       (6U)
#define VDO_CFG_FIXQP_MSK                                       (((1U<<VDO_CFG_FIXQP_LEN)-1)<<VDO_CFG_FIXQP_POS)
#define VDO_CFG_FIXQP_UMSK                                      (~(((1U<<VDO_CFG_FIXQP_LEN)-1)<<VDO_CFG_FIXQP_POS))

/* 0x250 : vdo_h264_roi_bittune */
#define VDO_H264_ROI_BITTUNE_OFFSET                             (0x250)
#define VDO_CFG_ROI_PBIT_OFST                                   VDO_CFG_ROI_PBIT_OFST
#define VDO_CFG_ROI_PBIT_OFST_POS                               (0U)
#define VDO_CFG_ROI_PBIT_OFST_LEN                               (5U)
#define VDO_CFG_ROI_PBIT_OFST_MSK                               (((1U<<VDO_CFG_ROI_PBIT_OFST_LEN)-1)<<VDO_CFG_ROI_PBIT_OFST_POS)
#define VDO_CFG_ROI_PBIT_OFST_UMSK                              (~(((1U<<VDO_CFG_ROI_PBIT_OFST_LEN)-1)<<VDO_CFG_ROI_PBIT_OFST_POS))
#define VDO_CFG_ROI_IBIT_OFST                                   VDO_CFG_ROI_IBIT_OFST
#define VDO_CFG_ROI_IBIT_OFST_POS                               (8U)
#define VDO_CFG_ROI_IBIT_OFST_LEN                               (8U)
#define VDO_CFG_ROI_IBIT_OFST_MSK                               (((1U<<VDO_CFG_ROI_IBIT_OFST_LEN)-1)<<VDO_CFG_ROI_IBIT_OFST_POS)
#define VDO_CFG_ROI_IBIT_OFST_UMSK                              (~(((1U<<VDO_CFG_ROI_IBIT_OFST_LEN)-1)<<VDO_CFG_ROI_IBIT_OFST_POS))
#define VDO_CFG_NROI_PBIT_OFST                                  VDO_CFG_NROI_PBIT_OFST
#define VDO_CFG_NROI_PBIT_OFST_POS                              (16U)
#define VDO_CFG_NROI_PBIT_OFST_LEN                              (5U)
#define VDO_CFG_NROI_PBIT_OFST_MSK                              (((1U<<VDO_CFG_NROI_PBIT_OFST_LEN)-1)<<VDO_CFG_NROI_PBIT_OFST_POS)
#define VDO_CFG_NROI_PBIT_OFST_UMSK                             (~(((1U<<VDO_CFG_NROI_PBIT_OFST_LEN)-1)<<VDO_CFG_NROI_PBIT_OFST_POS))
#define VDO_CFG_NROI_IBIT_OFST                                  VDO_CFG_NROI_IBIT_OFST
#define VDO_CFG_NROI_IBIT_OFST_POS                              (24U)
#define VDO_CFG_NROI_IBIT_OFST_LEN                              (8U)
#define VDO_CFG_NROI_IBIT_OFST_MSK                              (((1U<<VDO_CFG_NROI_IBIT_OFST_LEN)-1)<<VDO_CFG_NROI_IBIT_OFST_POS)
#define VDO_CFG_NROI_IBIT_OFST_UMSK                             (~(((1U<<VDO_CFG_NROI_IBIT_OFST_LEN)-1)<<VDO_CFG_NROI_IBIT_OFST_POS))

