sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x254 : vdo_h264_roi0 */
#define VDO_H264_ROI0_OFFSET                                    (0x254)
#define VDO_CFG_ROI0_MBX_S                                      VDO_CFG_ROI0_MBX_S
#define VDO_CFG_ROI0_MBX_S_POS                                  (0U)
#define VDO_CFG_ROI0_MBX_S_LEN                                  (7U)
#define VDO_CFG_ROI0_MBX_S_MSK                                  (((1U<<VDO_CFG_ROI0_MBX_S_LEN)-1)<<VDO_CFG_ROI0_MBX_S_POS)
#define VDO_CFG_ROI0_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_ROI0_MBX_S_LEN)-1)<<VDO_CFG_ROI0_MBX_S_POS))
#define VDO_CFG_ROI0_MBX_E                                      VDO_CFG_ROI0_MBX_E
#define VDO_CFG_ROI0_MBX_E_POS                                  (8U)
#define VDO_CFG_ROI0_MBX_E_LEN                                  (7U)
#define VDO_CFG_ROI0_MBX_E_MSK                                  (((1U<<VDO_CFG_ROI0_MBX_E_LEN)-1)<<VDO_CFG_ROI0_MBX_E_POS)
#define VDO_CFG_ROI0_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_ROI0_MBX_E_LEN)-1)<<VDO_CFG_ROI0_MBX_E_POS))
#define VDO_CFG_ROI0_MBY_S                                      VDO_CFG_ROI0_MBY_S
#define VDO_CFG_ROI0_MBY_S_POS                                  (16U)
#define VDO_CFG_ROI0_MBY_S_LEN                                  (7U)
#define VDO_CFG_ROI0_MBY_S_MSK                                  (((1U<<VDO_CFG_ROI0_MBY_S_LEN)-1)<<VDO_CFG_ROI0_MBY_S_POS)
#define VDO_CFG_ROI0_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_ROI0_MBY_S_LEN)-1)<<VDO_CFG_ROI0_MBY_S_POS))
#define VDO_CFG_ROI0_MBY_E                                      VDO_CFG_ROI0_MBY_E
#define VDO_CFG_ROI0_MBY_E_POS                                  (24U)
#define VDO_CFG_ROI0_MBY_E_LEN                                  (7U)
#define VDO_CFG_ROI0_MBY_E_MSK                                  (((1U<<VDO_CFG_ROI0_MBY_E_LEN)-1)<<VDO_CFG_ROI0_MBY_E_POS)
#define VDO_CFG_ROI0_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_ROI0_MBY_E_LEN)-1)<<VDO_CFG_ROI0_MBY_E_POS))

/* 0x258 : vdo_h264_roi1 */
#define VDO_H264_ROI1_OFFSET                                    (0x258)
#define VDO_CFG_ROI1_MBX_S                                      VDO_CFG_ROI1_MBX_S
#define VDO_CFG_ROI1_MBX_S_POS                                  (0U)
#define VDO_CFG_ROI1_MBX_S_LEN                                  (7U)
#define VDO_CFG_ROI1_MBX_S_MSK                                  (((1U<<VDO_CFG_ROI1_MBX_S_LEN)-1)<<VDO_CFG_ROI1_MBX_S_POS)
#define VDO_CFG_ROI1_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_ROI1_MBX_S_LEN)-1)<<VDO_CFG_ROI1_MBX_S_POS))
#define VDO_CFG_ROI1_MBX_E                                      VDO_CFG_ROI1_MBX_E
#define VDO_CFG_ROI1_MBX_E_POS                                  (8U)
#define VDO_CFG_ROI1_MBX_E_LEN                                  (7U)
#define VDO_CFG_ROI1_MBX_E_MSK                                  (((1U<<VDO_CFG_ROI1_MBX_E_LEN)-1)<<VDO_CFG_ROI1_MBX_E_POS)
#define VDO_CFG_ROI1_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_ROI1_MBX_E_LEN)-1)<<VDO_CFG_ROI1_MBX_E_POS))
#define VDO_CFG_ROI1_MBY_S                                      VDO_CFG_ROI1_MBY_S
#define VDO_CFG_ROI1_MBY_S_POS                                  (16U)
#define VDO_CFG_ROI1_MBY_S_LEN                                  (7U)
#define VDO_CFG_ROI1_MBY_S_MSK                                  (((1U<<VDO_CFG_ROI1_MBY_S_LEN)-1)<<VDO_CFG_ROI1_MBY_S_POS)
#define VDO_CFG_ROI1_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_ROI1_MBY_S_LEN)-1)<<VDO_CFG_ROI1_MBY_S_POS))
#define VDO_CFG_ROI1_MBY_E                                      VDO_CFG_ROI1_MBY_E
#define VDO_CFG_ROI1_MBY_E_POS                                  (24U)
#define VDO_CFG_ROI1_MBY_E_LEN                                  (7U)
#define VDO_CFG_ROI1_MBY_E_MSK                                  (((1U<<VDO_CFG_ROI1_MBY_E_LEN)-1)<<VDO_CFG_ROI1_MBY_E_POS)
#define VDO_CFG_ROI1_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_ROI1_MBY_E_LEN)-1)<<VDO_CFG_ROI1_MBY_E_POS))

/* 0x25c : vdo_h264_roi2 */
#define VDO_H264_ROI2_OFFSET                                    (0x25c)
#define VDO_CFG_ROI2_MBX_S                                      VDO_CFG_ROI2_MBX_S
#define VDO_CFG_ROI2_MBX_S_POS                                  (0U)
#define VDO_CFG_ROI2_MBX_S_LEN                                  (7U)
#define VDO_CFG_ROI2_MBX_S_MSK                                  (((1U<<VDO_CFG_ROI2_MBX_S_LEN)-1)<<VDO_CFG_ROI2_MBX_S_POS)
#define VDO_CFG_ROI2_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_ROI2_MBX_S_LEN)-1)<<VDO_CFG_ROI2_MBX_S_POS))
#define VDO_CFG_ROI2_MBX_E                                      VDO_CFG_ROI2_MBX_E
#define VDO_CFG_ROI2_MBX_E_POS                                  (8U)
#define VDO_CFG_ROI2_MBX_E_LEN                                  (7U)
#define VDO_CFG_ROI2_MBX_E_MSK                                  (((1U<<VDO_CFG_ROI2_MBX_E_LEN)-1)<<VDO_CFG_ROI2_MBX_E_POS)
#define VDO_CFG_ROI2_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_ROI2_MBX_E_LEN)-1)<<VDO_CFG_ROI2_MBX_E_POS))
#define VDO_CFG_ROI2_MBY_S                                      VDO_CFG_ROI2_MBY_S
#define VDO_CFG_ROI2_MBY_S_POS                                  (16U)
#define VDO_CFG_ROI2_MBY_S_LEN                                  (7U)
#define VDO_CFG_ROI2_MBY_S_MSK                                  (((1U<<VDO_CFG_ROI2_MBY_S_LEN)-1)<<VDO_CFG_ROI2_MBY_S_POS)
#define VDO_CFG_ROI2_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_ROI2_MBY_S_LEN)-1)<<VDO_CFG_ROI2_MBY_S_POS))
#define VDO_CFG_ROI2_MBY_E                                      VDO_CFG_ROI2_MBY_E
#define VDO_CFG_ROI2_MBY_E_POS                                  (24U)
#define VDO_CFG_ROI2_MBY_E_LEN                                  (7U)
#define VDO_CFG_ROI2_MBY_E_MSK                                  (((1U<<VDO_CFG_ROI2_MBY_E_LEN)-1)<<VDO_CFG_ROI2_MBY_E_POS)
#define VDO_CFG_ROI2_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_ROI2_MBY_E_LEN)-1)<<VDO_CFG_ROI2_MBY_E_POS))

/* 0x260 : vdo_h264_roi3 */
#define VDO_H264_ROI3_OFFSET                                    (0x260)
#define VDO_CFG_ROI3_MBX_S                                      VDO_CFG_ROI3_MBX_S
#define VDO_CFG_ROI3_MBX_S_POS                                  (0U)
#define VDO_CFG_ROI3_MBX_S_LEN                                  (7U)
#define VDO_CFG_ROI3_MBX_S_MSK                                  (((1U<<VDO_CFG_ROI3_MBX_S_LEN)-1)<<VDO_CFG_ROI3_MBX_S_POS)
#define VDO_CFG_ROI3_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_ROI3_MBX_S_LEN)-1)<<VDO_CFG_ROI3_MBX_S_POS))
#define VDO_CFG_ROI3_MBX_E                                      VDO_CFG_ROI3_MBX_E
#define VDO_CFG_ROI3_MBX_E_POS                                  (8U)
#define VDO_CFG_ROI3_MBX_E_LEN                                  (7U)
#define VDO_CFG_ROI3_MBX_E_MSK                                  (((1U<<VDO_CFG_ROI3_MBX_E_LEN)-1)<<VDO_CFG_ROI3_MBX_E_POS)
#define VDO_CFG_ROI3_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_ROI3_MBX_E_LEN)-1)<<VDO_CFG_ROI3_MBX_E_POS))
#define VDO_CFG_ROI3_MBY_S                                      VDO_CFG_ROI3_MBY_S
#define VDO_CFG_ROI3_MBY_S_POS                                  (16U)
#define VDO_CFG_ROI3_MBY_S_LEN                                  (7U)
#define VDO_CFG_ROI3_MBY_S_MSK                                  (((1U<<VDO_CFG_ROI3_MBY_S_LEN)-1)<<VDO_CFG_ROI3_MBY_S_POS)
#define VDO_CFG_ROI3_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_ROI3_MBY_S_LEN)-1)<<VDO_CFG_ROI3_MBY_S_POS))
#define VDO_CFG_ROI3_MBY_E                                      VDO_CFG_ROI3_MBY_E
#define VDO_CFG_ROI3_MBY_E_POS                                  (24U)
#define VDO_CFG_ROI3_MBY_E_LEN                                  (7U)
#define VDO_CFG_ROI3_MBY_E_MSK                                  (((1U<<VDO_CFG_ROI3_MBY_E_LEN)-1)<<VDO_CFG_ROI3_MBY_E_POS)
#define VDO_CFG_ROI3_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_ROI3_MBY_E_LEN)-1)<<VDO_CFG_ROI3_MBY_E_POS))

