sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x264 : vdo_h264_roi4 */
#define VDO_H264_ROI4_OFFSET                                    (0x264)
#define VDO_CFG_ROI4_MBX_S                                      VDO_CFG_ROI4_MBX_S
#define VDO_CFG_ROI4_MBX_S_POS                                  (0U)
#define VDO_CFG_ROI4_MBX_S_LEN                                  (7U)
#define VDO_CFG_ROI4_MBX_S_MSK                                  (((1U<<VDO_CFG_ROI4_MBX_S_LEN)-1)<<VDO_CFG_ROI4_MBX_S_POS)
#define VDO_CFG_ROI4_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_ROI4_MBX_S_LEN)-1)<<VDO_CFG_ROI4_MBX_S_POS))
#define VDO_CFG_ROI4_MBX_E                                      VDO_CFG_ROI4_MBX_E
#define VDO_CFG_ROI4_MBX_E_POS                                  (8U)
#define VDO_CFG_ROI4_MBX_E_LEN                                  (7U)
#define VDO_CFG_ROI4_MBX_E_MSK                                  (((1U<<VDO_CFG_ROI4_MBX_E_LEN)-1)<<VDO_CFG_ROI4_MBX_E_POS)
#define VDO_CFG_ROI4_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_ROI4_MBX_E_LEN)-1)<<VDO_CFG_ROI4_MBX_E_POS))
#define VDO_CFG_ROI4_MBY_S                                      VDO_CFG_ROI4_MBY_S
#define VDO_CFG_ROI4_MBY_S_POS                                  (16U)
#define VDO_CFG_ROI4_MBY_S_LEN                                  (7U)
#define VDO_CFG_ROI4_MBY_S_MSK                                  (((1U<<VDO_CFG_ROI4_MBY_S_LEN)-1)<<VDO_CFG_ROI4_MBY_S_POS)
#define VDO_CFG_ROI4_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_ROI4_MBY_S_LEN)-1)<<VDO_CFG_ROI4_MBY_S_POS))
#define VDO_CFG_ROI4_MBY_E                                      VDO_CFG_ROI4_MBY_E
#define VDO_CFG_ROI4_MBY_E_POS                                  (24U)
#define VDO_CFG_ROI4_MBY_E_LEN                                  (7U)
#define VDO_CFG_ROI4_MBY_E_MSK                                  (((1U<<VDO_CFG_ROI4_MBY_E_LEN)-1)<<VDO_CFG_ROI4_MBY_E_POS)
#define VDO_CFG_ROI4_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_ROI4_MBY_E_LEN)-1)<<VDO_CFG_ROI4_MBY_E_POS))

/* 0x268 : vdo_h264_roi5 */
#define VDO_H264_ROI5_OFFSET                                    (0x268)
#define VDO_CFG_ROI5_MBX_S                                      VDO_CFG_ROI5_MBX_S
#define VDO_CFG_ROI5_MBX_S_POS                                  (0U)
#define VDO_CFG_ROI5_MBX_S_LEN                                  (7U)
#define VDO_CFG_ROI5_MBX_S_MSK                                  (((1U<<VDO_CFG_ROI5_MBX_S_LEN)-1)<<VDO_CFG_ROI5_MBX_S_POS)
#define VDO_CFG_ROI5_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_ROI5_MBX_S_LEN)-1)<<VDO_CFG_ROI5_MBX_S_POS))
#define VDO_CFG_ROI5_MBX_E                                      VDO_CFG_ROI5_MBX_E
#define VDO_CFG_ROI5_MBX_E_POS                                  (8U)
#define VDO_CFG_ROI5_MBX_E_LEN                                  (7U)
#define VDO_CFG_ROI5_MBX_E_MSK                                  (((1U<<VDO_CFG_ROI5_MBX_E_LEN)-1)<<VDO_CFG_ROI5_MBX_E_POS)
#define VDO_CFG_ROI5_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_ROI5_MBX_E_LEN)-1)<<VDO_CFG_ROI5_MBX_E_POS))
#define VDO_CFG_ROI5_MBY_S                                      VDO_CFG_ROI5_MBY_S
#define VDO_CFG_ROI5_MBY_S_POS                                  (16U)
#define VDO_CFG_ROI5_MBY_S_LEN                                  (7U)
#define VDO_CFG_ROI5_MBY_S_MSK                                  (((1U<<VDO_CFG_ROI5_MBY_S_LEN)-1)<<VDO_CFG_ROI5_MBY_S_POS)
#define VDO_CFG_ROI5_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_ROI5_MBY_S_LEN)-1)<<VDO_CFG_ROI5_MBY_S_POS))
#define VDO_CFG_ROI5_MBY_E                                      VDO_CFG_ROI5_MBY_E
#define VDO_CFG_ROI5_MBY_E_POS                                  (24U)
#define VDO_CFG_ROI5_MBY_E_LEN                                  (7U)
#define VDO_CFG_ROI5_MBY_E_MSK                                  (((1U<<VDO_CFG_ROI5_MBY_E_LEN)-1)<<VDO_CFG_ROI5_MBY_E_POS)
#define VDO_CFG_ROI5_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_ROI5_MBY_E_LEN)-1)<<VDO_CFG_ROI5_MBY_E_POS))

/* 0x26c : vdo_h264_roi6 */
#define VDO_H264_ROI6_OFFSET                                    (0x26c)
#define VDO_CFG_ROI6_MBX_S                                      VDO_CFG_ROI6_MBX_S
#define VDO_CFG_ROI6_MBX_S_POS                                  (0U)
#define VDO_CFG_ROI6_MBX_S_LEN                                  (7U)
#define VDO_CFG_ROI6_MBX_S_MSK                                  (((1U<<VDO_CFG_ROI6_MBX_S_LEN)-1)<<VDO_CFG_ROI6_MBX_S_POS)
#define VDO_CFG_ROI6_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_ROI6_MBX_S_LEN)-1)<<VDO_CFG_ROI6_MBX_S_POS))
#define VDO_CFG_ROI6_MBX_E                                      VDO_CFG_ROI6_MBX_E
#define VDO_CFG_ROI6_MBX_E_POS                                  (8U)
#define VDO_CFG_ROI6_MBX_E_LEN                                  (7U)
#define VDO_CFG_ROI6_MBX_E_MSK                                  (((1U<<VDO_CFG_ROI6_MBX_E_LEN)-1)<<VDO_CFG_ROI6_MBX_E_POS)
#define VDO_CFG_ROI6_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_ROI6_MBX_E_LEN)-1)<<VDO_CFG_ROI6_MBX_E_POS))
#define VDO_CFG_ROI6_MBY_S                                      VDO_CFG_ROI6_MBY_S
#define VDO_CFG_ROI6_MBY_S_POS                                  (16U)
#define VDO_CFG_ROI6_MBY_S_LEN                                  (7U)
#define VDO_CFG_ROI6_MBY_S_MSK                                  (((1U<<VDO_CFG_ROI6_MBY_S_LEN)-1)<<VDO_CFG_ROI6_MBY_S_POS)
#define VDO_CFG_ROI6_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_ROI6_MBY_S_LEN)-1)<<VDO_CFG_ROI6_MBY_S_POS))
#define VDO_CFG_ROI6_MBY_E                                      VDO_CFG_ROI6_MBY_E
#define VDO_CFG_ROI6_MBY_E_POS                                  (24U)
#define VDO_CFG_ROI6_MBY_E_LEN                                  (7U)
#define VDO_CFG_ROI6_MBY_E_MSK                                  (((1U<<VDO_CFG_ROI6_MBY_E_LEN)-1)<<VDO_CFG_ROI6_MBY_E_POS)
#define VDO_CFG_ROI6_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_ROI6_MBY_E_LEN)-1)<<VDO_CFG_ROI6_MBY_E_POS))

/* 0x270 : vdo_h264_roi7 */
#define VDO_H264_ROI7_OFFSET                                    (0x270)
#define VDO_CFG_ROI7_MBX_S                                      VDO_CFG_ROI7_MBX_S
#define VDO_CFG_ROI7_MBX_S_POS                                  (0U)
#define VDO_CFG_ROI7_MBX_S_LEN                                  (7U)
#define VDO_CFG_ROI7_MBX_S_MSK                                  (((1U<<VDO_CFG_ROI7_MBX_S_LEN)-1)<<VDO_CFG_ROI7_MBX_S_POS)
#define VDO_CFG_ROI7_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_ROI7_MBX_S_LEN)-1)<<VDO_CFG_ROI7_MBX_S_POS))
#define VDO_CFG_ROI7_MBX_E                                      VDO_CFG_ROI7_MBX_E
#define VDO_CFG_ROI7_MBX_E_POS                                  (8U)
#define VDO_CFG_ROI7_MBX_E_LEN                                  (7U)
#define VDO_CFG_ROI7_MBX_E_MSK                                  (((1U<<VDO_CFG_ROI7_MBX_E_LEN)-1)<<VDO_CFG_ROI7_MBX_E_POS)
#define VDO_CFG_ROI7_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_ROI7_MBX_E_LEN)-1)<<VDO_CFG_ROI7_MBX_E_POS))
#define VDO_CFG_ROI7_MBY_S                                      VDO_CFG_ROI7_MBY_S
#define VDO_CFG_ROI7_MBY_S_POS                                  (16U)
#define VDO_CFG_ROI7_MBY_S_LEN                                  (7U)
#define VDO_CFG_ROI7_MBY_S_MSK                                  (((1U<<VDO_CFG_ROI7_MBY_S_LEN)-1)<<VDO_CFG_ROI7_MBY_S_POS)
#define VDO_CFG_ROI7_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_ROI7_MBY_S_LEN)-1)<<VDO_CFG_ROI7_MBY_S_POS))
#define VDO_CFG_ROI7_MBY_E                                      VDO_CFG_ROI7_MBY_E
#define VDO_CFG_ROI7_MBY_E_POS                                  (24U)
#define VDO_CFG_ROI7_MBY_E_LEN                                  (7U)
#define VDO_CFG_ROI7_MBY_E_MSK                                  (((1U<<VDO_CFG_ROI7_MBY_E_LEN)-1)<<VDO_CFG_ROI7_MBY_E_POS)
#define VDO_CFG_ROI7_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_ROI7_MBY_E_LEN)-1)<<VDO_CFG_ROI7_MBY_E_POS))

/* 0x274 : vdo_h264_s_roi_mode */
#define VDO_H264_S_ROI_MODE_OFFSET                              (0x274)
#define VDO_CFG_S_ROI_EN                                        VDO_CFG_S_ROI_EN
#define VDO_CFG_S_ROI_EN_POS                                    (0U)
#define VDO_CFG_S_ROI_EN_LEN                                    (8U)
#define VDO_CFG_S_ROI_EN_MSK                                    (((1U<<VDO_CFG_S_ROI_EN_LEN)-1)<<VDO_CFG_S_ROI_EN_POS)
#define VDO_CFG_S_ROI_EN_UMSK                                   (~(((1U<<VDO_CFG_S_ROI_EN_LEN)-1)<<VDO_CFG_S_ROI_EN_POS))
#define VDO_CFG_S_ROI_UPD                                       VDO_CFG_S_ROI_UPD
#define VDO_CFG_S_ROI_UPD_POS                                   (8U)
#define VDO_CFG_S_ROI_UPD_LEN                                   (1U)
#define VDO_CFG_S_ROI_UPD_MSK                                   (((1U<<VDO_CFG_S_ROI_UPD_LEN)-1)<<VDO_CFG_S_ROI_UPD_POS)
#define VDO_CFG_S_ROI_UPD_UMSK                                  (~(((1U<<VDO_CFG_S_ROI_UPD_LEN)-1)<<VDO_CFG_S_ROI_UPD_POS))

