sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x278 : vdo_h264_s_roi_bit */
#define VDO_H264_S_ROI_BIT_OFFSET                               (0x278)
#define VDO_CFG_S_PBIT_RATIO                                    VDO_CFG_S_PBIT_RATIO
#define VDO_CFG_S_PBIT_RATIO_POS                                (0U)
#define VDO_CFG_S_PBIT_RATIO_LEN                                (13U)
#define VDO_CFG_S_PBIT_RATIO_MSK                                (((1U<<VDO_CFG_S_PBIT_RATIO_LEN)-1)<<VDO_CFG_S_PBIT_RATIO_POS)
#define VDO_CFG_S_PBIT_RATIO_UMSK                               (~(((1U<<VDO_CFG_S_PBIT_RATIO_LEN)-1)<<VDO_CFG_S_PBIT_RATIO_POS))
#define VDO_CFG_S_IBIT_RATIO                                    VDO_CFG_S_IBIT_RATIO
#define VDO_CFG_S_IBIT_RATIO_POS                                (13U)
#define VDO_CFG_S_IBIT_RATIO_LEN                                (13U)
#define VDO_CFG_S_IBIT_RATIO_MSK                                (((1U<<VDO_CFG_S_IBIT_RATIO_LEN)-1)<<VDO_CFG_S_IBIT_RATIO_POS)
#define VDO_CFG_S_IBIT_RATIO_UMSK                               (~(((1U<<VDO_CFG_S_IBIT_RATIO_LEN)-1)<<VDO_CFG_S_IBIT_RATIO_POS))
#define VDO_CFG_S_ITHRE                                         VDO_CFG_S_ITHRE
#define VDO_CFG_S_ITHRE_POS                                     (26U)
#define VDO_CFG_S_ITHRE_LEN                                     (6U)
#define VDO_CFG_S_ITHRE_MSK                                     (((1U<<VDO_CFG_S_ITHRE_LEN)-1)<<VDO_CFG_S_ITHRE_POS)
#define VDO_CFG_S_ITHRE_UMSK                                    (~(((1U<<VDO_CFG_S_ITHRE_LEN)-1)<<VDO_CFG_S_ITHRE_POS))

/* 0x27c : vdo_h264_s_roi_qptune */
#define VDO_H264_S_ROI_QPTUNE_OFFSET                            (0x27c)
#define VDO_CFG_S_PQP_DECR                                      VDO_CFG_S_PQP_DECR
#define VDO_CFG_S_PQP_DECR_POS                                  (0U)
#define VDO_CFG_S_PQP_DECR_LEN                                  (6U)
#define VDO_CFG_S_PQP_DECR_MSK                                  (((1U<<VDO_CFG_S_PQP_DECR_LEN)-1)<<VDO_CFG_S_PQP_DECR_POS)
#define VDO_CFG_S_PQP_DECR_UMSK                                 (~(((1U<<VDO_CFG_S_PQP_DECR_LEN)-1)<<VDO_CFG_S_PQP_DECR_POS))
#define VDO_CFG_S_IQP_DECR                                      VDO_CFG_S_IQP_DECR
#define VDO_CFG_S_IQP_DECR_POS                                  (8U)
#define VDO_CFG_S_IQP_DECR_LEN                                  (6U)
#define VDO_CFG_S_IQP_DECR_MSK                                  (((1U<<VDO_CFG_S_IQP_DECR_LEN)-1)<<VDO_CFG_S_IQP_DECR_POS)
#define VDO_CFG_S_IQP_DECR_UMSK                                 (~(((1U<<VDO_CFG_S_IQP_DECR_LEN)-1)<<VDO_CFG_S_IQP_DECR_POS))
#define VDO_CFG_S_N2R_QP_DECR                                   VDO_CFG_S_N2R_QP_DECR
#define VDO_CFG_S_N2R_QP_DECR_POS                               (16U)
#define VDO_CFG_S_N2R_QP_DECR_LEN                               (6U)
#define VDO_CFG_S_N2R_QP_DECR_MSK                               (((1U<<VDO_CFG_S_N2R_QP_DECR_LEN)-1)<<VDO_CFG_S_N2R_QP_DECR_POS)
#define VDO_CFG_S_N2R_QP_DECR_UMSK                              (~(((1U<<VDO_CFG_S_N2R_QP_DECR_LEN)-1)<<VDO_CFG_S_N2R_QP_DECR_POS))
#define VDO_CFG_S_FIXQP                                         VDO_CFG_S_FIXQP
#define VDO_CFG_S_FIXQP_POS                                     (24U)
#define VDO_CFG_S_FIXQP_LEN                                     (6U)
#define VDO_CFG_S_FIXQP_MSK                                     (((1U<<VDO_CFG_S_FIXQP_LEN)-1)<<VDO_CFG_S_FIXQP_POS)
#define VDO_CFG_S_FIXQP_UMSK                                    (~(((1U<<VDO_CFG_S_FIXQP_LEN)-1)<<VDO_CFG_S_FIXQP_POS))

/* 0x280 : vdo_h264_s_roi_bittune */
#define VDO_H264_S_ROI_BITTUNE_OFFSET                           (0x280)
#define VDO_CFG_S_ROI_PBIT_OFST                                 VDO_CFG_S_ROI_PBIT_OFST
#define VDO_CFG_S_ROI_PBIT_OFST_POS                             (0U)
#define VDO_CFG_S_ROI_PBIT_OFST_LEN                             (5U)
#define VDO_CFG_S_ROI_PBIT_OFST_MSK                             (((1U<<VDO_CFG_S_ROI_PBIT_OFST_LEN)-1)<<VDO_CFG_S_ROI_PBIT_OFST_POS)
#define VDO_CFG_S_ROI_PBIT_OFST_UMSK                            (~(((1U<<VDO_CFG_S_ROI_PBIT_OFST_LEN)-1)<<VDO_CFG_S_ROI_PBIT_OFST_POS))
#define VDO_CFG_S_ROI_IBIT_OFST                                 VDO_CFG_S_ROI_IBIT_OFST
#define VDO_CFG_S_ROI_IBIT_OFST_POS                             (8U)
#define VDO_CFG_S_ROI_IBIT_OFST_LEN                             (8U)
#define VDO_CFG_S_ROI_IBIT_OFST_MSK                             (((1U<<VDO_CFG_S_ROI_IBIT_OFST_LEN)-1)<<VDO_CFG_S_ROI_IBIT_OFST_POS)
#define VDO_CFG_S_ROI_IBIT_OFST_UMSK                            (~(((1U<<VDO_CFG_S_ROI_IBIT_OFST_LEN)-1)<<VDO_CFG_S_ROI_IBIT_OFST_POS))
#define VDO_CFG_S_NROI_PBIT_OFST                                VDO_CFG_S_NROI_PBIT_OFST
#define VDO_CFG_S_NROI_PBIT_OFST_POS                            (16U)
#define VDO_CFG_S_NROI_PBIT_OFST_LEN                            (5U)
#define VDO_CFG_S_NROI_PBIT_OFST_MSK                            (((1U<<VDO_CFG_S_NROI_PBIT_OFST_LEN)-1)<<VDO_CFG_S_NROI_PBIT_OFST_POS)
#define VDO_CFG_S_NROI_PBIT_OFST_UMSK                           (~(((1U<<VDO_CFG_S_NROI_PBIT_OFST_LEN)-1)<<VDO_CFG_S_NROI_PBIT_OFST_POS))
#define VDO_CFG_S_NROI_IBIT_OFST                                VDO_CFG_S_NROI_IBIT_OFST
#define VDO_CFG_S_NROI_IBIT_OFST_POS                            (24U)
#define VDO_CFG_S_NROI_IBIT_OFST_LEN                            (8U)
#define VDO_CFG_S_NROI_IBIT_OFST_MSK                            (((1U<<VDO_CFG_S_NROI_IBIT_OFST_LEN)-1)<<VDO_CFG_S_NROI_IBIT_OFST_POS)
#define VDO_CFG_S_NROI_IBIT_OFST_UMSK                           (~(((1U<<VDO_CFG_S_NROI_IBIT_OFST_LEN)-1)<<VDO_CFG_S_NROI_IBIT_OFST_POS))

/* 0x284 : vdo_h264_s_roi0 */
#define VDO_H264_S_ROI0_OFFSET                                  (0x284)
#define VDO_CFG_S_ROI0_MBX_S                                    VDO_CFG_S_ROI0_MBX_S
#define VDO_CFG_S_ROI0_MBX_S_POS                                (0U)
#define VDO_CFG_S_ROI0_MBX_S_LEN                                (7U)
#define VDO_CFG_S_ROI0_MBX_S_MSK                                (((1U<<VDO_CFG_S_ROI0_MBX_S_LEN)-1)<<VDO_CFG_S_ROI0_MBX_S_POS)
#define VDO_CFG_S_ROI0_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI0_MBX_S_LEN)-1)<<VDO_CFG_S_ROI0_MBX_S_POS))
#define VDO_CFG_S_ROI0_MBX_E                                    VDO_CFG_S_ROI0_MBX_E
#define VDO_CFG_S_ROI0_MBX_E_POS                                (8U)
#define VDO_CFG_S_ROI0_MBX_E_LEN                                (7U)
#define VDO_CFG_S_ROI0_MBX_E_MSK                                (((1U<<VDO_CFG_S_ROI0_MBX_E_LEN)-1)<<VDO_CFG_S_ROI0_MBX_E_POS)
#define VDO_CFG_S_ROI0_MBX_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI0_MBX_E_LEN)-1)<<VDO_CFG_S_ROI0_MBX_E_POS))
#define VDO_CFG_S_ROI0_MBY_S                                    VDO_CFG_S_ROI0_MBY_S
#define VDO_CFG_S_ROI0_MBY_S_POS                                (16U)
#define VDO_CFG_S_ROI0_MBY_S_LEN                                (7U)
#define VDO_CFG_S_ROI0_MBY_S_MSK                                (((1U<<VDO_CFG_S_ROI0_MBY_S_LEN)-1)<<VDO_CFG_S_ROI0_MBY_S_POS)
#define VDO_CFG_S_ROI0_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI0_MBY_S_LEN)-1)<<VDO_CFG_S_ROI0_MBY_S_POS))
#define VDO_CFG_S_ROI0_MBY_E                                    VDO_CFG_S_ROI0_MBY_E
#define VDO_CFG_S_ROI0_MBY_E_POS                                (24U)
#define VDO_CFG_S_ROI0_MBY_E_LEN                                (7U)
#define VDO_CFG_S_ROI0_MBY_E_MSK                                (((1U<<VDO_CFG_S_ROI0_MBY_E_LEN)-1)<<VDO_CFG_S_ROI0_MBY_E_POS)
#define VDO_CFG_S_ROI0_MBY_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI0_MBY_E_LEN)-1)<<VDO_CFG_S_ROI0_MBY_E_POS))

/* 0x288 : vdo_h264_s_roi1 */
#define VDO_H264_S_ROI1_OFFSET                                  (0x288)
#define VDO_CFG_S_ROI1_MBX_S                                    VDO_CFG_S_ROI1_MBX_S
#define VDO_CFG_S_ROI1_MBX_S_POS                                (0U)
#define VDO_CFG_S_ROI1_MBX_S_LEN                                (7U)
#define VDO_CFG_S_ROI1_MBX_S_MSK                                (((1U<<VDO_CFG_S_ROI1_MBX_S_LEN)-1)<<VDO_CFG_S_ROI1_MBX_S_POS)
#define VDO_CFG_S_ROI1_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI1_MBX_S_LEN)-1)<<VDO_CFG_S_ROI1_MBX_S_POS))
#define VDO_CFG_S_ROI1_MBX_E                                    VDO_CFG_S_ROI1_MBX_E
#define VDO_CFG_S_ROI1_MBX_E_POS                                (8U)
#define VDO_CFG_S_ROI1_MBX_E_LEN                                (7U)
#define VDO_CFG_S_ROI1_MBX_E_MSK                                (((1U<<VDO_CFG_S_ROI1_MBX_E_LEN)-1)<<VDO_CFG_S_ROI1_MBX_E_POS)
#define VDO_CFG_S_ROI1_MBX_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI1_MBX_E_LEN)-1)<<VDO_CFG_S_ROI1_MBX_E_POS))
#define VDO_CFG_S_ROI1_MBY_S                                    VDO_CFG_S_ROI1_MBY_S
#define VDO_CFG_S_ROI1_MBY_S_POS                                (16U)
#define VDO_CFG_S_ROI1_MBY_S_LEN                                (7U)
#define VDO_CFG_S_ROI1_MBY_S_MSK                                (((1U<<VDO_CFG_S_ROI1_MBY_S_LEN)-1)<<VDO_CFG_S_ROI1_MBY_S_POS)
#define VDO_CFG_S_ROI1_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI1_MBY_S_LEN)-1)<<VDO_CFG_S_ROI1_MBY_S_POS))
#define VDO_CFG_S_ROI1_MBY_E                                    VDO_CFG_S_ROI1_MBY_E
#define VDO_CFG_S_ROI1_MBY_E_POS                                (24U)
#define VDO_CFG_S_ROI1_MBY_E_LEN                                (7U)
#define VDO_CFG_S_ROI1_MBY_E_MSK                                (((1U<<VDO_CFG_S_ROI1_MBY_E_LEN)-1)<<VDO_CFG_S_ROI1_MBY_E_POS)
#define VDO_CFG_S_ROI1_MBY_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI1_MBY_E_LEN)-1)<<VDO_CFG_S_ROI1_MBY_E_POS))

/* 0x28c : vdo_h264_s_roi2 */
#define VDO_H264_S_ROI2_OFFSET                                  (0x28c)
#define VDO_CFG_S_ROI2_MBX_S                                    VDO_CFG_S_ROI2_MBX_S
#define VDO_CFG_S_ROI2_MBX_S_POS                                (0U)
#define VDO_CFG_S_ROI2_MBX_S_LEN                                (7U)
#define VDO_CFG_S_ROI2_MBX_S_MSK                                (((1U<<VDO_CFG_S_ROI2_MBX_S_LEN)-1)<<VDO_CFG_S_ROI2_MBX_S_POS)
#define VDO_CFG_S_ROI2_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI2_MBX_S_LEN)-1)<<VDO_CFG_S_ROI2_MBX_S_POS))
#define VDO_CFG_S_ROI2_MBX_E                                    VDO_CFG_S_ROI2_MBX_E
#define VDO_CFG_S_ROI2_MBX_E_POS                                (8U)
#define VDO_CFG_S_ROI2_MBX_E_LEN                                (7U)
#define VDO_CFG_S_ROI2_MBX_E_MSK                                (((1U<<VDO_CFG_S_ROI2_MBX_E_LEN)-1)<<VDO_CFG_S_ROI2_MBX_E_POS)
#define VDO_CFG_S_ROI2_MBX_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI2_MBX_E_LEN)-1)<<VDO_CFG_S_ROI2_MBX_E_POS))
#define VDO_CFG_S_ROI2_MBY_S                                    VDO_CFG_S_ROI2_MBY_S
#define VDO_CFG_S_ROI2_MBY_S_POS                                (16U)
#define VDO_CFG_S_ROI2_MBY_S_LEN                                (7U)
#define VDO_CFG_S_ROI2_MBY_S_MSK                                (((1U<<VDO_CFG_S_ROI2_MBY_S_LEN)-1)<<VDO_CFG_S_ROI2_MBY_S_POS)
#define VDO_CFG_S_ROI2_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI2_MBY_S_LEN)-1)<<VDO_CFG_S_ROI2_MBY_S_POS))
#define VDO_CFG_S_ROI2_MBY_E                                    VDO_CFG_S_ROI2_MBY_E
#define VDO_CFG_S_ROI2_MBY_E_POS                                (24U)
#define VDO_CFG_S_ROI2_MBY_E_LEN                                (7U)
#define VDO_CFG_S_ROI2_MBY_E_MSK                                (((1U<<VDO_CFG_S_ROI2_MBY_E_LEN)-1)<<VDO_CFG_S_ROI2_MBY_E_POS)
#define VDO_CFG_S_ROI2_MBY_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI2_MBY_E_LEN)-1)<<VDO_CFG_S_ROI2_MBY_E_POS))

