sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x290 : vdo_h264_s_roi3 */
#define VDO_H264_S_ROI3_OFFSET                                  (0x290)
#define VDO_CFG_S_ROI3_MBX_S                                    VDO_CFG_S_ROI3_MBX_S
#define VDO_CFG_S_ROI3_MBX_S_POS                                (0U)
#define VDO_CFG_S_ROI3_MBX_S_LEN                                (7U)
#define VDO_CFG_S_ROI3_MBX_S_MSK                                (((1U<<VDO_CFG_S_ROI3_MBX_S_LEN)-1)<<VDO_CFG_S_ROI3_MBX_S_POS)
#define VDO_CFG_S_ROI3_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI3_MBX_S_LEN)-1)<<VDO_CFG_S_ROI3_MBX_S_POS))
#define VDO_CFG_S_ROI3_MBX_E                                    VDO_CFG_S_ROI3_MBX_E
#define VDO_CFG_S_ROI3_MBX_E_POS                                (8U)
#define VDO_CFG_S_ROI3_MBX_E_LEN                                (7U)
#define VDO_CFG_S_ROI3_MBX_E_MSK                                (((1U<<VDO_CFG_S_ROI3_MBX_E_LEN)-1)<<VDO_CFG_S_ROI3_MBX_E_POS)
#define VDO_CFG_S_ROI3_MBX_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI3_MBX_E_LEN)-1)<<VDO_CFG_S_ROI3_MBX_E_POS))
#define VDO_CFG_S_ROI3_MBY_S                                    VDO_CFG_S_ROI3_MBY_S
#define VDO_CFG_S_ROI3_MBY_S_POS                                (16U)
#define VDO_CFG_S_ROI3_MBY_S_LEN                                (7U)
#define VDO_CFG_S_ROI3_MBY_S_MSK                                (((1U<<VDO_CFG_S_ROI3_MBY_S_LEN)-1)<<VDO_CFG_S_ROI3_MBY_S_POS)
#define VDO_CFG_S_ROI3_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI3_MBY_S_LEN)-1)<<VDO_CFG_S_ROI3_MBY_S_POS))
#define VDO_CFG_S_ROI3_MBY_E                                    VDO_CFG_S_ROI3_MBY_E
#define VDO_CFG_S_ROI3_MBY_E_POS                                (24U)
#define VDO_CFG_S_ROI3_MBY_E_LEN                                (7U)
#define VDO_CFG_S_ROI3_MBY_E_MSK                                (((1U<<VDO_CFG_S_ROI3_MBY_E_LEN)-1)<<VDO_CFG_S_ROI3_MBY_E_POS)
#define VDO_CFG_S_ROI3_MBY_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI3_MBY_E_LEN)-1)<<VDO_CFG_S_ROI3_MBY_E_POS))

/* 0x294 : vdo_h264_s_roi4 */
#define VDO_H264_S_ROI4_OFFSET                                  (0x294)
#define VDO_CFG_S_ROI4_MBX_S                                    VDO_CFG_S_ROI4_MBX_S
#define VDO_CFG_S_ROI4_MBX_S_POS                                (0U)
#define VDO_CFG_S_ROI4_MBX_S_LEN                                (7U)
#define VDO_CFG_S_ROI4_MBX_S_MSK                                (((1U<<VDO_CFG_S_ROI4_MBX_S_LEN)-1)<<VDO_CFG_S_ROI4_MBX_S_POS)
#define VDO_CFG_S_ROI4_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI4_MBX_S_LEN)-1)<<VDO_CFG_S_ROI4_MBX_S_POS))
#define VDO_CFG_S_ROI4_MBX_E                                    VDO_CFG_S_ROI4_MBX_E
#define VDO_CFG_S_ROI4_MBX_E_POS                                (8U)
#define VDO_CFG_S_ROI4_MBX_E_LEN                                (7U)
#define VDO_CFG_S_ROI4_MBX_E_MSK                                (((1U<<VDO_CFG_S_ROI4_MBX_E_LEN)-1)<<VDO_CFG_S_ROI4_MBX_E_POS)
#define VDO_CFG_S_ROI4_MBX_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI4_MBX_E_LEN)-1)<<VDO_CFG_S_ROI4_MBX_E_POS))
#define VDO_CFG_S_ROI4_MBY_S                                    VDO_CFG_S_ROI4_MBY_S
#define VDO_CFG_S_ROI4_MBY_S_POS                                (16U)
#define VDO_CFG_S_ROI4_MBY_S_LEN                                (7U)
#define VDO_CFG_S_ROI4_MBY_S_MSK                                (((1U<<VDO_CFG_S_ROI4_MBY_S_LEN)-1)<<VDO_CFG_S_ROI4_MBY_S_POS)
#define VDO_CFG_S_ROI4_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI4_MBY_S_LEN)-1)<<VDO_CFG_S_ROI4_MBY_S_POS))
#define VDO_CFG_S_ROI4_MBY_E                                    VDO_CFG_S_ROI4_MBY_E
#define VDO_CFG_S_ROI4_MBY_E_POS                                (24U)
#define VDO_CFG_S_ROI4_MBY_E_LEN                                (7U)
#define VDO_CFG_S_ROI4_MBY_E_MSK                                (((1U<<VDO_CFG_S_ROI4_MBY_E_LEN)-1)<<VDO_CFG_S_ROI4_MBY_E_POS)
#define VDO_CFG_S_ROI4_MBY_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI4_MBY_E_LEN)-1)<<VDO_CFG_S_ROI4_MBY_E_POS))

/* 0x298 : vdo_h264_s_roi5 */
#define VDO_H264_S_ROI5_OFFSET                                  (0x298)
#define VDO_CFG_S_ROI5_MBX_S                                    VDO_CFG_S_ROI5_MBX_S
#define VDO_CFG_S_ROI5_MBX_S_POS                                (0U)
#define VDO_CFG_S_ROI5_MBX_S_LEN                                (7U)
#define VDO_CFG_S_ROI5_MBX_S_MSK                                (((1U<<VDO_CFG_S_ROI5_MBX_S_LEN)-1)<<VDO_CFG_S_ROI5_MBX_S_POS)
#define VDO_CFG_S_ROI5_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI5_MBX_S_LEN)-1)<<VDO_CFG_S_ROI5_MBX_S_POS))
#define VDO_CFG_S_ROI5_MBX_E                                    VDO_CFG_S_ROI5_MBX_E
#define VDO_CFG_S_ROI5_MBX_E_POS                                (8U)
#define VDO_CFG_S_ROI5_MBX_E_LEN                                (7U)
#define VDO_CFG_S_ROI5_MBX_E_MSK                                (((1U<<VDO_CFG_S_ROI5_MBX_E_LEN)-1)<<VDO_CFG_S_ROI5_MBX_E_POS)
#define VDO_CFG_S_ROI5_MBX_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI5_MBX_E_LEN)-1)<<VDO_CFG_S_ROI5_MBX_E_POS))
#define VDO_CFG_S_ROI5_MBY_S                                    VDO_CFG_S_ROI5_MBY_S
#define VDO_CFG_S_ROI5_MBY_S_POS                                (16U)
#define VDO_CFG_S_ROI5_MBY_S_LEN                                (7U)
#define VDO_CFG_S_ROI5_MBY_S_MSK                                (((1U<<VDO_CFG_S_ROI5_MBY_S_LEN)-1)<<VDO_CFG_S_ROI5_MBY_S_POS)
#define VDO_CFG_S_ROI5_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI5_MBY_S_LEN)-1)<<VDO_CFG_S_ROI5_MBY_S_POS))
#define VDO_CFG_S_ROI5_MBY_E                                    VDO_CFG_S_ROI5_MBY_E
#define VDO_CFG_S_ROI5_MBY_E_POS                                (24U)
#define VDO_CFG_S_ROI5_MBY_E_LEN                                (7U)
#define VDO_CFG_S_ROI5_MBY_E_MSK                                (((1U<<VDO_CFG_S_ROI5_MBY_E_LEN)-1)<<VDO_CFG_S_ROI5_MBY_E_POS)
#define VDO_CFG_S_ROI5_MBY_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI5_MBY_E_LEN)-1)<<VDO_CFG_S_ROI5_MBY_E_POS))

