sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x29c : vdo_h264_s_roi6 */
#define VDO_H264_S_ROI6_OFFSET                                  (0x29c)
#define VDO_CFG_S_ROI6_MBX_S                                    VDO_CFG_S_ROI6_MBX_S
#define VDO_CFG_S_ROI6_MBX_S_POS                                (0U)
#define VDO_CFG_S_ROI6_MBX_S_LEN                                (7U)
#define VDO_CFG_S_ROI6_MBX_S_MSK                                (((1U<<VDO_CFG_S_ROI6_MBX_S_LEN)-1)<<VDO_CFG_S_ROI6_MBX_S_POS)
#define VDO_CFG_S_ROI6_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI6_MBX_S_LEN)-1)<<VDO_CFG_S_ROI6_MBX_S_POS))
#define VDO_CFG_S_ROI6_MBX_E                                    VDO_CFG_S_ROI6_MBX_E
#define VDO_CFG_S_ROI6_MBX_E_POS                                (8U)
#define VDO_CFG_S_ROI6_MBX_E_LEN                                (7U)
#define VDO_CFG_S_ROI6_MBX_E_MSK                                (((1U<<VDO_CFG_S_ROI6_MBX_E_LEN)-1)<<VDO_CFG_S_ROI6_MBX_E_POS)
#define VDO_CFG_S_ROI6_MBX_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI6_MBX_E_LEN)-1)<<VDO_CFG_S_ROI6_MBX_E_POS))
#define VDO_CFG_S_ROI6_MBY_S                                    VDO_CFG_S_ROI6_MBY_S
#define VDO_CFG_S_ROI6_MBY_S_POS                                (16U)
#define VDO_CFG_S_ROI6_MBY_S_LEN                                (7U)
#define VDO_CFG_S_ROI6_MBY_S_MSK                                (((1U<<VDO_CFG_S_ROI6_MBY_S_LEN)-1)<<VDO_CFG_S_ROI6_MBY_S_POS)
#define VDO_CFG_S_ROI6_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI6_MBY_S_LEN)-1)<<VDO_CFG_S_ROI6_MBY_S_POS))
#define VDO_CFG_S_ROI6_MBY_E                                    VDO_CFG_S_ROI6_MBY_E
#define VDO_CFG_S_ROI6_MBY_E_POS                                (24U)
#define VDO_CFG_S_ROI6_MBY_E_LEN                                (7U)
#define VDO_CFG_S_ROI6_MBY_E_MSK                                (((1U<<VDO_CFG_S_ROI6_MBY_E_LEN)-1)<<VDO_CFG_S_ROI6_MBY_E_POS)
#define VDO_CFG_S_ROI6_MBY_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI6_MBY_E_LEN)-1)<<VDO_CFG_S_ROI6_MBY_E_POS))

/* 0x300 : vdo_h264_s_roi7 */
#define VDO_H264_S_ROI7_OFFSET                                  (0x300)
#define VDO_CFG_S_ROI7_MBX_S                                    VDO_CFG_S_ROI7_MBX_S
#define VDO_CFG_S_ROI7_MBX_S_POS                                (0U)
#define VDO_CFG_S_ROI7_MBX_S_LEN                                (7U)
#define VDO_CFG_S_ROI7_MBX_S_MSK                                (((1U<<VDO_CFG_S_ROI7_MBX_S_LEN)-1)<<VDO_CFG_S_ROI7_MBX_S_POS)
#define VDO_CFG_S_ROI7_MBX_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI7_MBX_S_LEN)-1)<<VDO_CFG_S_ROI7_MBX_S_POS))
#define VDO_CFG_S_ROI7_MBX_E                                    VDO_CFG_S_ROI7_MBX_E
#define VDO_CFG_S_ROI7_MBX_E_POS                                (8U)
#define VDO_CFG_S_ROI7_MBX_E_LEN                                (7U)
#define VDO_CFG_S_ROI7_MBX_E_MSK                                (((1U<<VDO_CFG_S_ROI7_MBX_E_LEN)-1)<<VDO_CFG_S_ROI7_MBX_E_POS)
#define VDO_CFG_S_ROI7_MBX_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI7_MBX_E_LEN)-1)<<VDO_CFG_S_ROI7_MBX_E_POS))
#define VDO_CFG_S_ROI7_MBY_S                                    VDO_CFG_S_ROI7_MBY_S
#define VDO_CFG_S_ROI7_MBY_S_POS                                (16U)
#define VDO_CFG_S_ROI7_MBY_S_LEN                                (7U)
#define VDO_CFG_S_ROI7_MBY_S_MSK                                (((1U<<VDO_CFG_S_ROI7_MBY_S_LEN)-1)<<VDO_CFG_S_ROI7_MBY_S_POS)
#define VDO_CFG_S_ROI7_MBY_S_UMSK                               (~(((1U<<VDO_CFG_S_ROI7_MBY_S_LEN)-1)<<VDO_CFG_S_ROI7_MBY_S_POS))
#define VDO_CFG_S_ROI7_MBY_E                                    VDO_CFG_S_ROI7_MBY_E
#define VDO_CFG_S_ROI7_MBY_E_POS                                (24U)
#define VDO_CFG_S_ROI7_MBY_E_LEN                                (7U)
#define VDO_CFG_S_ROI7_MBY_E_MSK                                (((1U<<VDO_CFG_S_ROI7_MBY_E_LEN)-1)<<VDO_CFG_S_ROI7_MBY_E_POS)
#define VDO_CFG_S_ROI7_MBY_E_UMSK                               (~(((1U<<VDO_CFG_S_ROI7_MBY_E_LEN)-1)<<VDO_CFG_S_ROI7_MBY_E_POS))

/* 0x304 : vdo_h264_osd_en */
#define VDO_H264_OSD_EN_OFFSET                                  (0x304)
#define VDO_CFG_OSD_EN                                          VDO_CFG_OSD_EN
#define VDO_CFG_OSD_EN_POS                                      (0U)
#define VDO_CFG_OSD_EN_LEN                                      (16U)
#define VDO_CFG_OSD_EN_MSK                                      (((1U<<VDO_CFG_OSD_EN_LEN)-1)<<VDO_CFG_OSD_EN_POS)
#define VDO_CFG_OSD_EN_UMSK                                     (~(((1U<<VDO_CFG_OSD_EN_LEN)-1)<<VDO_CFG_OSD_EN_POS))
#define VDO_CFG_OSD_MSSEL                                       VDO_CFG_OSD_MSSEL
#define VDO_CFG_OSD_MSSEL_POS                                   (16U)
#define VDO_CFG_OSD_MSSEL_LEN                                   (16U)
#define VDO_CFG_OSD_MSSEL_MSK                                   (((1U<<VDO_CFG_OSD_MSSEL_LEN)-1)<<VDO_CFG_OSD_MSSEL_POS)
#define VDO_CFG_OSD_MSSEL_UMSK                                  (~(((1U<<VDO_CFG_OSD_MSSEL_LEN)-1)<<VDO_CFG_OSD_MSSEL_POS))

/* 0x308 : vdo_h264_osd0 */
#define VDO_H264_OSD0_OFFSET                                    (0x308)
#define VDO_CFG_OSD0_MBX_S                                      VDO_CFG_OSD0_MBX_S
#define VDO_CFG_OSD0_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD0_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD0_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD0_MBX_S_LEN)-1)<<VDO_CFG_OSD0_MBX_S_POS)
#define VDO_CFG_OSD0_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD0_MBX_S_LEN)-1)<<VDO_CFG_OSD0_MBX_S_POS))
#define VDO_CFG_OSD0_MBX_E                                      VDO_CFG_OSD0_MBX_E
#define VDO_CFG_OSD0_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD0_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD0_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD0_MBX_E_LEN)-1)<<VDO_CFG_OSD0_MBX_E_POS)
#define VDO_CFG_OSD0_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD0_MBX_E_LEN)-1)<<VDO_CFG_OSD0_MBX_E_POS))
#define VDO_CFG_OSD0_MBY_S                                      VDO_CFG_OSD0_MBY_S
#define VDO_CFG_OSD0_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD0_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD0_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD0_MBY_S_LEN)-1)<<VDO_CFG_OSD0_MBY_S_POS)
#define VDO_CFG_OSD0_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD0_MBY_S_LEN)-1)<<VDO_CFG_OSD0_MBY_S_POS))
#define VDO_CFG_OSD0_MBY_E                                      VDO_CFG_OSD0_MBY_E
#define VDO_CFG_OSD0_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD0_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD0_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD0_MBY_E_LEN)-1)<<VDO_CFG_OSD0_MBY_E_POS)
#define VDO_CFG_OSD0_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD0_MBY_E_LEN)-1)<<VDO_CFG_OSD0_MBY_E_POS))

/* 0x30c : vdo_h264_osd1 */
#define VDO_H264_OSD1_OFFSET                                    (0x30c)
#define VDO_CFG_OSD1_MBX_S                                      VDO_CFG_OSD1_MBX_S
#define VDO_CFG_OSD1_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD1_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD1_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD1_MBX_S_LEN)-1)<<VDO_CFG_OSD1_MBX_S_POS)
#define VDO_CFG_OSD1_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD1_MBX_S_LEN)-1)<<VDO_CFG_OSD1_MBX_S_POS))
#define VDO_CFG_OSD1_MBX_E                                      VDO_CFG_OSD1_MBX_E
#define VDO_CFG_OSD1_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD1_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD1_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD1_MBX_E_LEN)-1)<<VDO_CFG_OSD1_MBX_E_POS)
#define VDO_CFG_OSD1_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD1_MBX_E_LEN)-1)<<VDO_CFG_OSD1_MBX_E_POS))
#define VDO_CFG_OSD1_MBY_S                                      VDO_CFG_OSD1_MBY_S
#define VDO_CFG_OSD1_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD1_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD1_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD1_MBY_S_LEN)-1)<<VDO_CFG_OSD1_MBY_S_POS)
#define VDO_CFG_OSD1_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD1_MBY_S_LEN)-1)<<VDO_CFG_OSD1_MBY_S_POS))
#define VDO_CFG_OSD1_MBY_E                                      VDO_CFG_OSD1_MBY_E
#define VDO_CFG_OSD1_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD1_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD1_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD1_MBY_E_LEN)-1)<<VDO_CFG_OSD1_MBY_E_POS)
#define VDO_CFG_OSD1_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD1_MBY_E_LEN)-1)<<VDO_CFG_OSD1_MBY_E_POS))

/* 0x310 : vdo_h264_osd2 */
#define VDO_H264_OSD2_OFFSET                                    (0x310)
#define VDO_CFG_OSD2_MBX_S                                      VDO_CFG_OSD2_MBX_S
#define VDO_CFG_OSD2_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD2_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD2_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD2_MBX_S_LEN)-1)<<VDO_CFG_OSD2_MBX_S_POS)
#define VDO_CFG_OSD2_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD2_MBX_S_LEN)-1)<<VDO_CFG_OSD2_MBX_S_POS))
#define VDO_CFG_OSD2_MBX_E                                      VDO_CFG_OSD2_MBX_E
#define VDO_CFG_OSD2_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD2_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD2_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD2_MBX_E_LEN)-1)<<VDO_CFG_OSD2_MBX_E_POS)
#define VDO_CFG_OSD2_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD2_MBX_E_LEN)-1)<<VDO_CFG_OSD2_MBX_E_POS))
#define VDO_CFG_OSD2_MBY_S                                      VDO_CFG_OSD2_MBY_S
#define VDO_CFG_OSD2_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD2_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD2_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD2_MBY_S_LEN)-1)<<VDO_CFG_OSD2_MBY_S_POS)
#define VDO_CFG_OSD2_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD2_MBY_S_LEN)-1)<<VDO_CFG_OSD2_MBY_S_POS))
#define VDO_CFG_OSD2_MBY_E                                      VDO_CFG_OSD2_MBY_E
#define VDO_CFG_OSD2_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD2_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD2_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD2_MBY_E_LEN)-1)<<VDO_CFG_OSD2_MBY_E_POS)
#define VDO_CFG_OSD2_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD2_MBY_E_LEN)-1)<<VDO_CFG_OSD2_MBY_E_POS))

/* 0x314 : vdo_h264_osd3 */
#define VDO_H264_OSD3_OFFSET                                    (0x314)
#define VDO_CFG_OSD3_MBX_S                                      VDO_CFG_OSD3_MBX_S
#define VDO_CFG_OSD3_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD3_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD3_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD3_MBX_S_LEN)-1)<<VDO_CFG_OSD3_MBX_S_POS)
#define VDO_CFG_OSD3_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD3_MBX_S_LEN)-1)<<VDO_CFG_OSD3_MBX_S_POS))
#define VDO_CFG_OSD3_MBX_E                                      VDO_CFG_OSD3_MBX_E
#define VDO_CFG_OSD3_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD3_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD3_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD3_MBX_E_LEN)-1)<<VDO_CFG_OSD3_MBX_E_POS)
#define VDO_CFG_OSD3_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD3_MBX_E_LEN)-1)<<VDO_CFG_OSD3_MBX_E_POS))
#define VDO_CFG_OSD3_MBY_S                                      VDO_CFG_OSD3_MBY_S
#define VDO_CFG_OSD3_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD3_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD3_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD3_MBY_S_LEN)-1)<<VDO_CFG_OSD3_MBY_S_POS)
#define VDO_CFG_OSD3_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD3_MBY_S_LEN)-1)<<VDO_CFG_OSD3_MBY_S_POS))
#define VDO_CFG_OSD3_MBY_E                                      VDO_CFG_OSD3_MBY_E
#define VDO_CFG_OSD3_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD3_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD3_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD3_MBY_E_LEN)-1)<<VDO_CFG_OSD3_MBY_E_POS)
#define VDO_CFG_OSD3_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD3_MBY_E_LEN)-1)<<VDO_CFG_OSD3_MBY_E_POS))

