sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x318 : vdo_h264_osd4 */
#define VDO_H264_OSD4_OFFSET                                    (0x318)
#define VDO_CFG_OSD4_MBX_S                                      VDO_CFG_OSD4_MBX_S
#define VDO_CFG_OSD4_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD4_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD4_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD4_MBX_S_LEN)-1)<<VDO_CFG_OSD4_MBX_S_POS)
#define VDO_CFG_OSD4_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD4_MBX_S_LEN)-1)<<VDO_CFG_OSD4_MBX_S_POS))
#define VDO_CFG_OSD4_MBX_E                                      VDO_CFG_OSD4_MBX_E
#define VDO_CFG_OSD4_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD4_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD4_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD4_MBX_E_LEN)-1)<<VDO_CFG_OSD4_MBX_E_POS)
#define VDO_CFG_OSD4_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD4_MBX_E_LEN)-1)<<VDO_CFG_OSD4_MBX_E_POS))
#define VDO_CFG_OSD4_MBY_S                                      VDO_CFG_OSD4_MBY_S
#define VDO_CFG_OSD4_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD4_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD4_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD4_MBY_S_LEN)-1)<<VDO_CFG_OSD4_MBY_S_POS)
#define VDO_CFG_OSD4_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD4_MBY_S_LEN)-1)<<VDO_CFG_OSD4_MBY_S_POS))
#define VDO_CFG_OSD4_MBY_E                                      VDO_CFG_OSD4_MBY_E
#define VDO_CFG_OSD4_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD4_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD4_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD4_MBY_E_LEN)-1)<<VDO_CFG_OSD4_MBY_E_POS)
#define VDO_CFG_OSD4_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD4_MBY_E_LEN)-1)<<VDO_CFG_OSD4_MBY_E_POS))

/* 0x31c : vdo_h264_osd5 */
#define VDO_H264_OSD5_OFFSET                                    (0x31c)
#define VDO_CFG_OSD5_MBX_S                                      VDO_CFG_OSD5_MBX_S
#define VDO_CFG_OSD5_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD5_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD5_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD5_MBX_S_LEN)-1)<<VDO_CFG_OSD5_MBX_S_POS)
#define VDO_CFG_OSD5_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD5_MBX_S_LEN)-1)<<VDO_CFG_OSD5_MBX_S_POS))
#define VDO_CFG_OSD5_MBX_E                                      VDO_CFG_OSD5_MBX_E
#define VDO_CFG_OSD5_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD5_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD5_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD5_MBX_E_LEN)-1)<<VDO_CFG_OSD5_MBX_E_POS)
#define VDO_CFG_OSD5_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD5_MBX_E_LEN)-1)<<VDO_CFG_OSD5_MBX_E_POS))
#define VDO_CFG_OSD5_MBY_S                                      VDO_CFG_OSD5_MBY_S
#define VDO_CFG_OSD5_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD5_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD5_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD5_MBY_S_LEN)-1)<<VDO_CFG_OSD5_MBY_S_POS)
#define VDO_CFG_OSD5_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD5_MBY_S_LEN)-1)<<VDO_CFG_OSD5_MBY_S_POS))
#define VDO_CFG_OSD5_MBY_E                                      VDO_CFG_OSD5_MBY_E
#define VDO_CFG_OSD5_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD5_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD5_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD5_MBY_E_LEN)-1)<<VDO_CFG_OSD5_MBY_E_POS)
#define VDO_CFG_OSD5_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD5_MBY_E_LEN)-1)<<VDO_CFG_OSD5_MBY_E_POS))

/* 0x320 : vdo_h264_osd6 */
#define VDO_H264_OSD6_OFFSET                                    (0x320)
#define VDO_CFG_OSD6_MBX_S                                      VDO_CFG_OSD6_MBX_S
#define VDO_CFG_OSD6_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD6_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD6_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD6_MBX_S_LEN)-1)<<VDO_CFG_OSD6_MBX_S_POS)
#define VDO_CFG_OSD6_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD6_MBX_S_LEN)-1)<<VDO_CFG_OSD6_MBX_S_POS))
#define VDO_CFG_OSD6_MBX_E                                      VDO_CFG_OSD6_MBX_E
#define VDO_CFG_OSD6_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD6_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD6_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD6_MBX_E_LEN)-1)<<VDO_CFG_OSD6_MBX_E_POS)
#define VDO_CFG_OSD6_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD6_MBX_E_LEN)-1)<<VDO_CFG_OSD6_MBX_E_POS))
#define VDO_CFG_OSD6_MBY_S                                      VDO_CFG_OSD6_MBY_S
#define VDO_CFG_OSD6_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD6_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD6_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD6_MBY_S_LEN)-1)<<VDO_CFG_OSD6_MBY_S_POS)
#define VDO_CFG_OSD6_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD6_MBY_S_LEN)-1)<<VDO_CFG_OSD6_MBY_S_POS))
#define VDO_CFG_OSD6_MBY_E                                      VDO_CFG_OSD6_MBY_E
#define VDO_CFG_OSD6_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD6_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD6_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD6_MBY_E_LEN)-1)<<VDO_CFG_OSD6_MBY_E_POS)
#define VDO_CFG_OSD6_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD6_MBY_E_LEN)-1)<<VDO_CFG_OSD6_MBY_E_POS))

/* 0x324 : vdo_h264_osd7 */
#define VDO_H264_OSD7_OFFSET                                    (0x324)
#define VDO_CFG_OSD7_MBX_S                                      VDO_CFG_OSD7_MBX_S
#define VDO_CFG_OSD7_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD7_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD7_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD7_MBX_S_LEN)-1)<<VDO_CFG_OSD7_MBX_S_POS)
#define VDO_CFG_OSD7_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD7_MBX_S_LEN)-1)<<VDO_CFG_OSD7_MBX_S_POS))
#define VDO_CFG_OSD7_MBX_E                                      VDO_CFG_OSD7_MBX_E
#define VDO_CFG_OSD7_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD7_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD7_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD7_MBX_E_LEN)-1)<<VDO_CFG_OSD7_MBX_E_POS)
#define VDO_CFG_OSD7_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD7_MBX_E_LEN)-1)<<VDO_CFG_OSD7_MBX_E_POS))
#define VDO_CFG_OSD7_MBY_S                                      VDO_CFG_OSD7_MBY_S
#define VDO_CFG_OSD7_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD7_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD7_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD7_MBY_S_LEN)-1)<<VDO_CFG_OSD7_MBY_S_POS)
#define VDO_CFG_OSD7_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD7_MBY_S_LEN)-1)<<VDO_CFG_OSD7_MBY_S_POS))
#define VDO_CFG_OSD7_MBY_E                                      VDO_CFG_OSD7_MBY_E
#define VDO_CFG_OSD7_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD7_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD7_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD7_MBY_E_LEN)-1)<<VDO_CFG_OSD7_MBY_E_POS)
#define VDO_CFG_OSD7_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD7_MBY_E_LEN)-1)<<VDO_CFG_OSD7_MBY_E_POS))

/* 0x328 : vdo_h264_osd8 */
#define VDO_H264_OSD8_OFFSET                                    (0x328)
#define VDO_CFG_OSD8_MBX_S                                      VDO_CFG_OSD8_MBX_S
#define VDO_CFG_OSD8_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD8_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD8_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD8_MBX_S_LEN)-1)<<VDO_CFG_OSD8_MBX_S_POS)
#define VDO_CFG_OSD8_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD8_MBX_S_LEN)-1)<<VDO_CFG_OSD8_MBX_S_POS))
#define VDO_CFG_OSD8_MBX_E                                      VDO_CFG_OSD8_MBX_E
#define VDO_CFG_OSD8_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD8_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD8_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD8_MBX_E_LEN)-1)<<VDO_CFG_OSD8_MBX_E_POS)
#define VDO_CFG_OSD8_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD8_MBX_E_LEN)-1)<<VDO_CFG_OSD8_MBX_E_POS))
#define VDO_CFG_OSD8_MBY_S                                      VDO_CFG_OSD8_MBY_S
#define VDO_CFG_OSD8_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD8_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD8_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD8_MBY_S_LEN)-1)<<VDO_CFG_OSD8_MBY_S_POS)
#define VDO_CFG_OSD8_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD8_MBY_S_LEN)-1)<<VDO_CFG_OSD8_MBY_S_POS))
#define VDO_CFG_OSD8_MBY_E                                      VDO_CFG_OSD8_MBY_E
#define VDO_CFG_OSD8_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD8_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD8_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD8_MBY_E_LEN)-1)<<VDO_CFG_OSD8_MBY_E_POS)
#define VDO_CFG_OSD8_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD8_MBY_E_LEN)-1)<<VDO_CFG_OSD8_MBY_E_POS))

/* 0x32c : vdo_h264_osd9 */
#define VDO_H264_OSD9_OFFSET                                    (0x32c)
#define VDO_CFG_OSD9_MBX_S                                      VDO_CFG_OSD9_MBX_S
#define VDO_CFG_OSD9_MBX_S_POS                                  (0U)
#define VDO_CFG_OSD9_MBX_S_LEN                                  (7U)
#define VDO_CFG_OSD9_MBX_S_MSK                                  (((1U<<VDO_CFG_OSD9_MBX_S_LEN)-1)<<VDO_CFG_OSD9_MBX_S_POS)
#define VDO_CFG_OSD9_MBX_S_UMSK                                 (~(((1U<<VDO_CFG_OSD9_MBX_S_LEN)-1)<<VDO_CFG_OSD9_MBX_S_POS))
#define VDO_CFG_OSD9_MBX_E                                      VDO_CFG_OSD9_MBX_E
#define VDO_CFG_OSD9_MBX_E_POS                                  (8U)
#define VDO_CFG_OSD9_MBX_E_LEN                                  (7U)
#define VDO_CFG_OSD9_MBX_E_MSK                                  (((1U<<VDO_CFG_OSD9_MBX_E_LEN)-1)<<VDO_CFG_OSD9_MBX_E_POS)
#define VDO_CFG_OSD9_MBX_E_UMSK                                 (~(((1U<<VDO_CFG_OSD9_MBX_E_LEN)-1)<<VDO_CFG_OSD9_MBX_E_POS))
#define VDO_CFG_OSD9_MBY_S                                      VDO_CFG_OSD9_MBY_S
#define VDO_CFG_OSD9_MBY_S_POS                                  (16U)
#define VDO_CFG_OSD9_MBY_S_LEN                                  (7U)
#define VDO_CFG_OSD9_MBY_S_MSK                                  (((1U<<VDO_CFG_OSD9_MBY_S_LEN)-1)<<VDO_CFG_OSD9_MBY_S_POS)
#define VDO_CFG_OSD9_MBY_S_UMSK                                 (~(((1U<<VDO_CFG_OSD9_MBY_S_LEN)-1)<<VDO_CFG_OSD9_MBY_S_POS))
#define VDO_CFG_OSD9_MBY_E                                      VDO_CFG_OSD9_MBY_E
#define VDO_CFG_OSD9_MBY_E_POS                                  (24U)
#define VDO_CFG_OSD9_MBY_E_LEN                                  (7U)
#define VDO_CFG_OSD9_MBY_E_MSK                                  (((1U<<VDO_CFG_OSD9_MBY_E_LEN)-1)<<VDO_CFG_OSD9_MBY_E_POS)
#define VDO_CFG_OSD9_MBY_E_UMSK                                 (~(((1U<<VDO_CFG_OSD9_MBY_E_LEN)-1)<<VDO_CFG_OSD9_MBY_E_POS))

/* 0x330 : vdo_h264_osd10 */
#define VDO_H264_OSD10_OFFSET                                   (0x330)
#define VDO_CFG_OSD10_MBX_S                                     VDO_CFG_OSD10_MBX_S
#define VDO_CFG_OSD10_MBX_S_POS                                 (0U)
#define VDO_CFG_OSD10_MBX_S_LEN                                 (7U)
#define VDO_CFG_OSD10_MBX_S_MSK                                 (((1U<<VDO_CFG_OSD10_MBX_S_LEN)-1)<<VDO_CFG_OSD10_MBX_S_POS)
#define VDO_CFG_OSD10_MBX_S_UMSK                                (~(((1U<<VDO_CFG_OSD10_MBX_S_LEN)-1)<<VDO_CFG_OSD10_MBX_S_POS))
#define VDO_CFG_OSD10_MBX_E                                     VDO_CFG_OSD10_MBX_E
#define VDO_CFG_OSD10_MBX_E_POS                                 (8U)
#define VDO_CFG_OSD10_MBX_E_LEN                                 (7U)
#define VDO_CFG_OSD10_MBX_E_MSK                                 (((1U<<VDO_CFG_OSD10_MBX_E_LEN)-1)<<VDO_CFG_OSD10_MBX_E_POS)
#define VDO_CFG_OSD10_MBX_E_UMSK                                (~(((1U<<VDO_CFG_OSD10_MBX_E_LEN)-1)<<VDO_CFG_OSD10_MBX_E_POS))
#define VDO_CFG_OSD10_MBY_S                                     VDO_CFG_OSD10_MBY_S
#define VDO_CFG_OSD10_MBY_S_POS                                 (16U)
#define VDO_CFG_OSD10_MBY_S_LEN                                 (7U)
#define VDO_CFG_OSD10_MBY_S_MSK                                 (((1U<<VDO_CFG_OSD10_MBY_S_LEN)-1)<<VDO_CFG_OSD10_MBY_S_POS)
#define VDO_CFG_OSD10_MBY_S_UMSK                                (~(((1U<<VDO_CFG_OSD10_MBY_S_LEN)-1)<<VDO_CFG_OSD10_MBY_S_POS))
#define VDO_CFG_OSD10_MBY_E                                     VDO_CFG_OSD10_MBY_E
#define VDO_CFG_OSD10_MBY_E_POS                                 (24U)
#define VDO_CFG_OSD10_MBY_E_LEN                                 (7U)
#define VDO_CFG_OSD10_MBY_E_MSK                                 (((1U<<VDO_CFG_OSD10_MBY_E_LEN)-1)<<VDO_CFG_OSD10_MBY_E_POS)
#define VDO_CFG_OSD10_MBY_E_UMSK                                (~(((1U<<VDO_CFG_OSD10_MBY_E_LEN)-1)<<VDO_CFG_OSD10_MBY_E_POS))

