sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x334 : vdo_h264_osd11 */
#define VDO_H264_OSD11_OFFSET                                   (0x334)
#define VDO_CFG_OSD11_MBX_S                                     VDO_CFG_OSD11_MBX_S
#define VDO_CFG_OSD11_MBX_S_POS                                 (0U)
#define VDO_CFG_OSD11_MBX_S_LEN                                 (7U)
#define VDO_CFG_OSD11_MBX_S_MSK                                 (((1U<<VDO_CFG_OSD11_MBX_S_LEN)-1)<<VDO_CFG_OSD11_MBX_S_POS)
#define VDO_CFG_OSD11_MBX_S_UMSK                                (~(((1U<<VDO_CFG_OSD11_MBX_S_LEN)-1)<<VDO_CFG_OSD11_MBX_S_POS))
#define VDO_CFG_OSD11_MBX_E                                     VDO_CFG_OSD11_MBX_E
#define VDO_CFG_OSD11_MBX_E_POS                                 (8U)
#define VDO_CFG_OSD11_MBX_E_LEN                                 (7U)
#define VDO_CFG_OSD11_MBX_E_MSK                                 (((1U<<VDO_CFG_OSD11_MBX_E_LEN)-1)<<VDO_CFG_OSD11_MBX_E_POS)
#define VDO_CFG_OSD11_MBX_E_UMSK                                (~(((1U<<VDO_CFG_OSD11_MBX_E_LEN)-1)<<VDO_CFG_OSD11_MBX_E_POS))
#define VDO_CFG_OSD11_MBY_S                                     VDO_CFG_OSD11_MBY_S
#define VDO_CFG_OSD11_MBY_S_POS                                 (16U)
#define VDO_CFG_OSD11_MBY_S_LEN                                 (7U)
#define VDO_CFG_OSD11_MBY_S_MSK                                 (((1U<<VDO_CFG_OSD11_MBY_S_LEN)-1)<<VDO_CFG_OSD11_MBY_S_POS)
#define VDO_CFG_OSD11_MBY_S_UMSK                                (~(((1U<<VDO_CFG_OSD11_MBY_S_LEN)-1)<<VDO_CFG_OSD11_MBY_S_POS))
#define VDO_CFG_OSD11_MBY_E                                     VDO_CFG_OSD11_MBY_E
#define VDO_CFG_OSD11_MBY_E_POS                                 (24U)
#define VDO_CFG_OSD11_MBY_E_LEN                                 (7U)
#define VDO_CFG_OSD11_MBY_E_MSK                                 (((1U<<VDO_CFG_OSD11_MBY_E_LEN)-1)<<VDO_CFG_OSD11_MBY_E_POS)
#define VDO_CFG_OSD11_MBY_E_UMSK                                (~(((1U<<VDO_CFG_OSD11_MBY_E_LEN)-1)<<VDO_CFG_OSD11_MBY_E_POS))

/* 0x338 : vdo_h264_osd12 */
#define VDO_H264_OSD12_OFFSET                                   (0x338)
#define VDO_CFG_OSD12_MBX_S                                     VDO_CFG_OSD12_MBX_S
#define VDO_CFG_OSD12_MBX_S_POS                                 (0U)
#define VDO_CFG_OSD12_MBX_S_LEN                                 (7U)
#define VDO_CFG_OSD12_MBX_S_MSK                                 (((1U<<VDO_CFG_OSD12_MBX_S_LEN)-1)<<VDO_CFG_OSD12_MBX_S_POS)
#define VDO_CFG_OSD12_MBX_S_UMSK                                (~(((1U<<VDO_CFG_OSD12_MBX_S_LEN)-1)<<VDO_CFG_OSD12_MBX_S_POS))
#define VDO_CFG_OSD12_MBX_E                                     VDO_CFG_OSD12_MBX_E
#define VDO_CFG_OSD12_MBX_E_POS                                 (8U)
#define VDO_CFG_OSD12_MBX_E_LEN                                 (7U)
#define VDO_CFG_OSD12_MBX_E_MSK                                 (((1U<<VDO_CFG_OSD12_MBX_E_LEN)-1)<<VDO_CFG_OSD12_MBX_E_POS)
#define VDO_CFG_OSD12_MBX_E_UMSK                                (~(((1U<<VDO_CFG_OSD12_MBX_E_LEN)-1)<<VDO_CFG_OSD12_MBX_E_POS))
#define VDO_CFG_OSD12_MBY_S                                     VDO_CFG_OSD12_MBY_S
#define VDO_CFG_OSD12_MBY_S_POS                                 (16U)
#define VDO_CFG_OSD12_MBY_S_LEN                                 (7U)
#define VDO_CFG_OSD12_MBY_S_MSK                                 (((1U<<VDO_CFG_OSD12_MBY_S_LEN)-1)<<VDO_CFG_OSD12_MBY_S_POS)
#define VDO_CFG_OSD12_MBY_S_UMSK                                (~(((1U<<VDO_CFG_OSD12_MBY_S_LEN)-1)<<VDO_CFG_OSD12_MBY_S_POS))
#define VDO_CFG_OSD12_MBY_E                                     VDO_CFG_OSD12_MBY_E
#define VDO_CFG_OSD12_MBY_E_POS                                 (24U)
#define VDO_CFG_OSD12_MBY_E_LEN                                 (7U)
#define VDO_CFG_OSD12_MBY_E_MSK                                 (((1U<<VDO_CFG_OSD12_MBY_E_LEN)-1)<<VDO_CFG_OSD12_MBY_E_POS)
#define VDO_CFG_OSD12_MBY_E_UMSK                                (~(((1U<<VDO_CFG_OSD12_MBY_E_LEN)-1)<<VDO_CFG_OSD12_MBY_E_POS))

/* 0x33c : vdo_h264_osd13 */
#define VDO_H264_OSD13_OFFSET                                   (0x33c)
#define VDO_CFG_OSD13_MBX_S                                     VDO_CFG_OSD13_MBX_S
#define VDO_CFG_OSD13_MBX_S_POS                                 (0U)
#define VDO_CFG_OSD13_MBX_S_LEN                                 (7U)
#define VDO_CFG_OSD13_MBX_S_MSK                                 (((1U<<VDO_CFG_OSD13_MBX_S_LEN)-1)<<VDO_CFG_OSD13_MBX_S_POS)
#define VDO_CFG_OSD13_MBX_S_UMSK                                (~(((1U<<VDO_CFG_OSD13_MBX_S_LEN)-1)<<VDO_CFG_OSD13_MBX_S_POS))
#define VDO_CFG_OSD13_MBX_E                                     VDO_CFG_OSD13_MBX_E
#define VDO_CFG_OSD13_MBX_E_POS                                 (8U)
#define VDO_CFG_OSD13_MBX_E_LEN                                 (7U)
#define VDO_CFG_OSD13_MBX_E_MSK                                 (((1U<<VDO_CFG_OSD13_MBX_E_LEN)-1)<<VDO_CFG_OSD13_MBX_E_POS)
#define VDO_CFG_OSD13_MBX_E_UMSK                                (~(((1U<<VDO_CFG_OSD13_MBX_E_LEN)-1)<<VDO_CFG_OSD13_MBX_E_POS))
#define VDO_CFG_OSD13_MBY_S                                     VDO_CFG_OSD13_MBY_S
#define VDO_CFG_OSD13_MBY_S_POS                                 (16U)
#define VDO_CFG_OSD13_MBY_S_LEN                                 (7U)
#define VDO_CFG_OSD13_MBY_S_MSK                                 (((1U<<VDO_CFG_OSD13_MBY_S_LEN)-1)<<VDO_CFG_OSD13_MBY_S_POS)
#define VDO_CFG_OSD13_MBY_S_UMSK                                (~(((1U<<VDO_CFG_OSD13_MBY_S_LEN)-1)<<VDO_CFG_OSD13_MBY_S_POS))
#define VDO_CFG_OSD13_MBY_E                                     VDO_CFG_OSD13_MBY_E
#define VDO_CFG_OSD13_MBY_E_POS                                 (24U)
#define VDO_CFG_OSD13_MBY_E_LEN                                 (7U)
#define VDO_CFG_OSD13_MBY_E_MSK                                 (((1U<<VDO_CFG_OSD13_MBY_E_LEN)-1)<<VDO_CFG_OSD13_MBY_E_POS)
#define VDO_CFG_OSD13_MBY_E_UMSK                                (~(((1U<<VDO_CFG_OSD13_MBY_E_LEN)-1)<<VDO_CFG_OSD13_MBY_E_POS))

/* 0x340 : vdo_h264_osd14 */
#define VDO_H264_OSD14_OFFSET                                   (0x340)
#define VDO_CFG_OSD14_MBX_S                                     VDO_CFG_OSD14_MBX_S
#define VDO_CFG_OSD14_MBX_S_POS                                 (0U)
#define VDO_CFG_OSD14_MBX_S_LEN                                 (7U)
#define VDO_CFG_OSD14_MBX_S_MSK                                 (((1U<<VDO_CFG_OSD14_MBX_S_LEN)-1)<<VDO_CFG_OSD14_MBX_S_POS)
#define VDO_CFG_OSD14_MBX_S_UMSK                                (~(((1U<<VDO_CFG_OSD14_MBX_S_LEN)-1)<<VDO_CFG_OSD14_MBX_S_POS))
#define VDO_CFG_OSD14_MBX_E                                     VDO_CFG_OSD14_MBX_E
#define VDO_CFG_OSD14_MBX_E_POS                                 (8U)
#define VDO_CFG_OSD14_MBX_E_LEN                                 (7U)
#define VDO_CFG_OSD14_MBX_E_MSK                                 (((1U<<VDO_CFG_OSD14_MBX_E_LEN)-1)<<VDO_CFG_OSD14_MBX_E_POS)
#define VDO_CFG_OSD14_MBX_E_UMSK                                (~(((1U<<VDO_CFG_OSD14_MBX_E_LEN)-1)<<VDO_CFG_OSD14_MBX_E_POS))
#define VDO_CFG_OSD14_MBY_S                                     VDO_CFG_OSD14_MBY_S
#define VDO_CFG_OSD14_MBY_S_POS                                 (16U)
#define VDO_CFG_OSD14_MBY_S_LEN                                 (7U)
#define VDO_CFG_OSD14_MBY_S_MSK                                 (((1U<<VDO_CFG_OSD14_MBY_S_LEN)-1)<<VDO_CFG_OSD14_MBY_S_POS)
#define VDO_CFG_OSD14_MBY_S_UMSK                                (~(((1U<<VDO_CFG_OSD14_MBY_S_LEN)-1)<<VDO_CFG_OSD14_MBY_S_POS))
#define VDO_CFG_OSD14_MBY_E                                     VDO_CFG_OSD14_MBY_E
#define VDO_CFG_OSD14_MBY_E_POS                                 (24U)
#define VDO_CFG_OSD14_MBY_E_LEN                                 (7U)
#define VDO_CFG_OSD14_MBY_E_MSK                                 (((1U<<VDO_CFG_OSD14_MBY_E_LEN)-1)<<VDO_CFG_OSD14_MBY_E_POS)
#define VDO_CFG_OSD14_MBY_E_UMSK                                (~(((1U<<VDO_CFG_OSD14_MBY_E_LEN)-1)<<VDO_CFG_OSD14_MBY_E_POS))

/* 0x344 : vdo_h264_osd15 */
#define VDO_H264_OSD15_OFFSET                                   (0x344)
#define VDO_CFG_OSD15_MBX_S                                     VDO_CFG_OSD15_MBX_S
#define VDO_CFG_OSD15_MBX_S_POS                                 (0U)
#define VDO_CFG_OSD15_MBX_S_LEN                                 (7U)
#define VDO_CFG_OSD15_MBX_S_MSK                                 (((1U<<VDO_CFG_OSD15_MBX_S_LEN)-1)<<VDO_CFG_OSD15_MBX_S_POS)
#define VDO_CFG_OSD15_MBX_S_UMSK                                (~(((1U<<VDO_CFG_OSD15_MBX_S_LEN)-1)<<VDO_CFG_OSD15_MBX_S_POS))
#define VDO_CFG_OSD15_MBX_E                                     VDO_CFG_OSD15_MBX_E
#define VDO_CFG_OSD15_MBX_E_POS                                 (8U)
#define VDO_CFG_OSD15_MBX_E_LEN                                 (7U)
#define VDO_CFG_OSD15_MBX_E_MSK                                 (((1U<<VDO_CFG_OSD15_MBX_E_LEN)-1)<<VDO_CFG_OSD15_MBX_E_POS)
#define VDO_CFG_OSD15_MBX_E_UMSK                                (~(((1U<<VDO_CFG_OSD15_MBX_E_LEN)-1)<<VDO_CFG_OSD15_MBX_E_POS))
#define VDO_CFG_OSD15_MBY_S                                     VDO_CFG_OSD15_MBY_S
#define VDO_CFG_OSD15_MBY_S_POS                                 (16U)
#define VDO_CFG_OSD15_MBY_S_LEN                                 (7U)
#define VDO_CFG_OSD15_MBY_S_MSK                                 (((1U<<VDO_CFG_OSD15_MBY_S_LEN)-1)<<VDO_CFG_OSD15_MBY_S_POS)
#define VDO_CFG_OSD15_MBY_S_UMSK                                (~(((1U<<VDO_CFG_OSD15_MBY_S_LEN)-1)<<VDO_CFG_OSD15_MBY_S_POS))
#define VDO_CFG_OSD15_MBY_E                                     VDO_CFG_OSD15_MBY_E
#define VDO_CFG_OSD15_MBY_E_POS                                 (24U)
#define VDO_CFG_OSD15_MBY_E_LEN                                 (7U)
#define VDO_CFG_OSD15_MBY_E_MSK                                 (((1U<<VDO_CFG_OSD15_MBY_E_LEN)-1)<<VDO_CFG_OSD15_MBY_E_POS)
#define VDO_CFG_OSD15_MBY_E_UMSK                                (~(((1U<<VDO_CFG_OSD15_MBY_E_LEN)-1)<<VDO_CFG_OSD15_MBY_E_POS))

/* 0x348 : vdo_h264_mv0_en */
#define VDO_H264_MV0_EN_OFFSET                                  (0x348)
#define VDO_CFG_MV0_EN                                          VDO_CFG_MV0_EN
#define VDO_CFG_MV0_EN_POS                                      (0U)
#define VDO_CFG_MV0_EN_LEN                                      (1U)
#define VDO_CFG_MV0_EN_MSK                                      (((1U<<VDO_CFG_MV0_EN_LEN)-1)<<VDO_CFG_MV0_EN_POS)
#define VDO_CFG_MV0_EN_UMSK                                     (~(((1U<<VDO_CFG_MV0_EN_LEN)-1)<<VDO_CFG_MV0_EN_POS))
#define VDO_CFG_S_MV0_EN                                        VDO_CFG_S_MV0_EN
#define VDO_CFG_S_MV0_EN_POS                                    (1U)
#define VDO_CFG_S_MV0_EN_LEN                                    (1U)
#define VDO_CFG_S_MV0_EN_MSK                                    (((1U<<VDO_CFG_S_MV0_EN_LEN)-1)<<VDO_CFG_S_MV0_EN_POS)
#define VDO_CFG_S_MV0_EN_UMSK                                   (~(((1U<<VDO_CFG_S_MV0_EN_LEN)-1)<<VDO_CFG_S_MV0_EN_POS))

/* 0x34c : vdo_pfch_dbg_reqcnt */
#define VDO_PFCH_DBG_REQCNT_OFFSET                              (0x34c)
#define VDO_DBG_REQCNT                                          VDO_DBG_REQCNT
#define VDO_DBG_REQCNT_POS                                      (0U)
#define VDO_DBG_REQCNT_LEN                                      (32U)
#define VDO_DBG_REQCNT_MSK                                      (((1U<<VDO_DBG_REQCNT_LEN)-1)<<VDO_DBG_REQCNT_POS)
#define VDO_DBG_REQCNT_UMSK                                     (~(((1U<<VDO_DBG_REQCNT_LEN)-1)<<VDO_DBG_REQCNT_POS))

/* 0x350 : vdo_pfch_dbg_rcmd */
#define VDO_PFCH_DBG_RCMD_OFFSET                                (0x350)
#define VDO_DBG_RCMD                                            VDO_DBG_RCMD
#define VDO_DBG_RCMD_POS                                        (0U)
#define VDO_DBG_RCMD_LEN                                        (32U)
#define VDO_DBG_RCMD_MSK                                        (((1U<<VDO_DBG_RCMD_LEN)-1)<<VDO_DBG_RCMD_POS)
#define VDO_DBG_RCMD_UMSK                                       (~(((1U<<VDO_DBG_RCMD_LEN)-1)<<VDO_DBG_RCMD_POS))

/* 0x354 : vdo_pfch_dbg_wcmd */
#define VDO_PFCH_DBG_WCMD_OFFSET                                (0x354)
#define VDO_DBG_WCMD                                            VDO_DBG_WCMD
#define VDO_DBG_WCMD_POS                                        (0U)
#define VDO_DBG_WCMD_LEN                                        (32U)
#define VDO_DBG_WCMD_MSK                                        (((1U<<VDO_DBG_WCMD_LEN)-1)<<VDO_DBG_WCMD_POS)
#define VDO_DBG_WCMD_UMSK                                       (~(((1U<<VDO_DBG_WCMD_LEN)-1)<<VDO_DBG_WCMD_POS))

