sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x358 : vdo_pfch_dbg_wdata */
#define VDO_PFCH_DBG_WDATA_OFFSET                               (0x358)
#define VDO_DBG_WDATA                                           VDO_DBG_WDATA
#define VDO_DBG_WDATA_POS                                       (0U)
#define VDO_DBG_WDATA_LEN                                       (32U)
#define VDO_DBG_WDATA_MSK                                       (((1U<<VDO_DBG_WDATA_LEN)-1)<<VDO_DBG_WDATA_POS)
#define VDO_DBG_WDATA_UMSK                                      (~(((1U<<VDO_DBG_WDATA_LEN)-1)<<VDO_DBG_WDATA_POS))

/* 0x35c : vdo_pfch_dbg_pfchsta */
#define VDO_PFCH_DBG_PFCHSTA_OFFSET                             (0x35c)
#define VDO_DBG_PFCHSTA                                         VDO_DBG_PFCHSTA
#define VDO_DBG_PFCHSTA_POS                                     (0U)
#define VDO_DBG_PFCHSTA_LEN                                     (32U)
#define VDO_DBG_PFCHSTA_MSK                                     (((1U<<VDO_DBG_PFCHSTA_LEN)-1)<<VDO_DBG_PFCHSTA_POS)
#define VDO_DBG_PFCHSTA_UMSK                                    (~(((1U<<VDO_DBG_PFCHSTA_LEN)-1)<<VDO_DBG_PFCHSTA_POS))

/* 0x360 : vdo_pfchv_dbg_reqcnt */
#define VDO_PFCHV_DBG_REQCNT_OFFSET                             (0x360)
#define VDO_DBGV_REQCNT                                         VDO_DBGV_REQCNT
#define VDO_DBGV_REQCNT_POS                                     (0U)
#define VDO_DBGV_REQCNT_LEN                                     (32U)
#define VDO_DBGV_REQCNT_MSK                                     (((1U<<VDO_DBGV_REQCNT_LEN)-1)<<VDO_DBGV_REQCNT_POS)
#define VDO_DBGV_REQCNT_UMSK                                    (~(((1U<<VDO_DBGV_REQCNT_LEN)-1)<<VDO_DBGV_REQCNT_POS))

/* 0x364 : vdo_pfchv_dbg_rcmd */
#define VDO_PFCHV_DBG_RCMD_OFFSET                               (0x364)
#define VDO_DBGV_RCMD                                           VDO_DBGV_RCMD
#define VDO_DBGV_RCMD_POS                                       (0U)
#define VDO_DBGV_RCMD_LEN                                       (32U)
#define VDO_DBGV_RCMD_MSK                                       (((1U<<VDO_DBGV_RCMD_LEN)-1)<<VDO_DBGV_RCMD_POS)
#define VDO_DBGV_RCMD_UMSK                                      (~(((1U<<VDO_DBGV_RCMD_LEN)-1)<<VDO_DBGV_RCMD_POS))

/* 0x368 : vdo_pfchv_dbg_wcmd */
#define VDO_PFCHV_DBG_WCMD_OFFSET                               (0x368)
#define VDO_DBGV_WCMD                                           VDO_DBGV_WCMD
#define VDO_DBGV_WCMD_POS                                       (0U)
#define VDO_DBGV_WCMD_LEN                                       (32U)
#define VDO_DBGV_WCMD_MSK                                       (((1U<<VDO_DBGV_WCMD_LEN)-1)<<VDO_DBGV_WCMD_POS)
#define VDO_DBGV_WCMD_UMSK                                      (~(((1U<<VDO_DBGV_WCMD_LEN)-1)<<VDO_DBGV_WCMD_POS))

/* 0x36c : vdo_pfchv_dbg_wdata */
#define VDO_PFCHV_DBG_WDATA_OFFSET                              (0x36c)
#define VDO_DBGV_WDATA                                          VDO_DBGV_WDATA
#define VDO_DBGV_WDATA_POS                                      (0U)
#define VDO_DBGV_WDATA_LEN                                      (32U)
#define VDO_DBGV_WDATA_MSK                                      (((1U<<VDO_DBGV_WDATA_LEN)-1)<<VDO_DBGV_WDATA_POS)
#define VDO_DBGV_WDATA_UMSK                                     (~(((1U<<VDO_DBGV_WDATA_LEN)-1)<<VDO_DBGV_WDATA_POS))

/* 0x370 : vdo_pfchv_dbg_pfchsta */
#define VDO_PFCHV_DBG_PFCHSTA_OFFSET                            (0x370)
#define VDO_DBGV_PFCHSTA                                        VDO_DBGV_PFCHSTA
#define VDO_DBGV_PFCHSTA_POS                                    (0U)
#define VDO_DBGV_PFCHSTA_LEN                                    (32U)
#define VDO_DBGV_PFCHSTA_MSK                                    (((1U<<VDO_DBGV_PFCHSTA_LEN)-1)<<VDO_DBGV_PFCHSTA_POS)
#define VDO_DBGV_PFCHSTA_UMSK                                   (~(((1U<<VDO_DBGV_PFCHSTA_LEN)-1)<<VDO_DBGV_PFCHSTA_POS))

/* 0x374 : vdo_pfch_s_dbg_reqcnt */
#define VDO_PFCH_S_DBG_REQCNT_OFFSET                            (0x374)
#define VDO_S_DBG_REQCNT                                        VDO_S_DBG_REQCNT
#define VDO_S_DBG_REQCNT_POS                                    (0U)
#define VDO_S_DBG_REQCNT_LEN                                    (32U)
#define VDO_S_DBG_REQCNT_MSK                                    (((1U<<VDO_S_DBG_REQCNT_LEN)-1)<<VDO_S_DBG_REQCNT_POS)
#define VDO_S_DBG_REQCNT_UMSK                                   (~(((1U<<VDO_S_DBG_REQCNT_LEN)-1)<<VDO_S_DBG_REQCNT_POS))

/* 0x378 : vdo_pfch_s_dbg_rcmd */
#define VDO_PFCH_S_DBG_RCMD_OFFSET                              (0x378)
#define VDO_S_DBG_RCMD                                          VDO_S_DBG_RCMD
#define VDO_S_DBG_RCMD_POS                                      (0U)
#define VDO_S_DBG_RCMD_LEN                                      (32U)
#define VDO_S_DBG_RCMD_MSK                                      (((1U<<VDO_S_DBG_RCMD_LEN)-1)<<VDO_S_DBG_RCMD_POS)
#define VDO_S_DBG_RCMD_UMSK                                     (~(((1U<<VDO_S_DBG_RCMD_LEN)-1)<<VDO_S_DBG_RCMD_POS))

/* 0x37c : vdo_pfch_s_dbg_wcmd */
#define VDO_PFCH_S_DBG_WCMD_OFFSET                              (0x37c)
#define VDO_S_DBG_WCMD                                          VDO_S_DBG_WCMD
#define VDO_S_DBG_WCMD_POS                                      (0U)
#define VDO_S_DBG_WCMD_LEN                                      (32U)
#define VDO_S_DBG_WCMD_MSK                                      (((1U<<VDO_S_DBG_WCMD_LEN)-1)<<VDO_S_DBG_WCMD_POS)
#define VDO_S_DBG_WCMD_UMSK                                     (~(((1U<<VDO_S_DBG_WCMD_LEN)-1)<<VDO_S_DBG_WCMD_POS))

/* 0x380 : vdo_pfch_s_dbg_wdata */
#define VDO_PFCH_S_DBG_WDATA_OFFSET                             (0x380)
#define VDO_S_DBG_WDATA                                         VDO_S_DBG_WDATA
#define VDO_S_DBG_WDATA_POS                                     (0U)
#define VDO_S_DBG_WDATA_LEN                                     (32U)
#define VDO_S_DBG_WDATA_MSK                                     (((1U<<VDO_S_DBG_WDATA_LEN)-1)<<VDO_S_DBG_WDATA_POS)
#define VDO_S_DBG_WDATA_UMSK                                    (~(((1U<<VDO_S_DBG_WDATA_LEN)-1)<<VDO_S_DBG_WDATA_POS))

/* 0x384 : vdo_pfch_s_dbg_pfchsta */
#define VDO_PFCH_S_DBG_PFCHSTA_OFFSET                           (0x384)
#define VDO_S_DBG_PFCHSTA                                       VDO_S_DBG_PFCHSTA
#define VDO_S_DBG_PFCHSTA_POS                                   (0U)
#define VDO_S_DBG_PFCHSTA_LEN                                   (32U)
#define VDO_S_DBG_PFCHSTA_MSK                                   (((1U<<VDO_S_DBG_PFCHSTA_LEN)-1)<<VDO_S_DBG_PFCHSTA_POS)
#define VDO_S_DBG_PFCHSTA_UMSK                                  (~(((1U<<VDO_S_DBG_PFCHSTA_LEN)-1)<<VDO_S_DBG_PFCHSTA_POS))

