sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x388 : vdo_pfchv_s_dbg_reqcnt */
#define VDO_PFCHV_S_DBG_REQCNT_OFFSET                           (0x388)
#define VDO_S_DBGV_REQCNT                                       VDO_S_DBGV_REQCNT
#define VDO_S_DBGV_REQCNT_POS                                   (0U)
#define VDO_S_DBGV_REQCNT_LEN                                   (32U)
#define VDO_S_DBGV_REQCNT_MSK                                   (((1U<<VDO_S_DBGV_REQCNT_LEN)-1)<<VDO_S_DBGV_REQCNT_POS)
#define VDO_S_DBGV_REQCNT_UMSK                                  (~(((1U<<VDO_S_DBGV_REQCNT_LEN)-1)<<VDO_S_DBGV_REQCNT_POS))

/* 0x38c : vdo_pfchv_s_dbg_rcmd */
#define VDO_PFCHV_S_DBG_RCMD_OFFSET                             (0x38c)
#define VDO_S_DBGV_RCMD                                         VDO_S_DBGV_RCMD
#define VDO_S_DBGV_RCMD_POS                                     (0U)
#define VDO_S_DBGV_RCMD_LEN                                     (32U)
#define VDO_S_DBGV_RCMD_MSK                                     (((1U<<VDO_S_DBGV_RCMD_LEN)-1)<<VDO_S_DBGV_RCMD_POS)
#define VDO_S_DBGV_RCMD_UMSK                                    (~(((1U<<VDO_S_DBGV_RCMD_LEN)-1)<<VDO_S_DBGV_RCMD_POS))

/* 0x390 : vdo_pfchv_s_dbg_wcmd */
#define VDO_PFCHV_S_DBG_WCMD_OFFSET                             (0x390)
#define VDO_S_DBGV_WCMD                                         VDO_S_DBGV_WCMD
#define VDO_S_DBGV_WCMD_POS                                     (0U)
#define VDO_S_DBGV_WCMD_LEN                                     (32U)
#define VDO_S_DBGV_WCMD_MSK                                     (((1U<<VDO_S_DBGV_WCMD_LEN)-1)<<VDO_S_DBGV_WCMD_POS)
#define VDO_S_DBGV_WCMD_UMSK                                    (~(((1U<<VDO_S_DBGV_WCMD_LEN)-1)<<VDO_S_DBGV_WCMD_POS))

/* 0x394 : vdo_pfchv_s_dbg_wdata */
#define VDO_PFCHV_S_DBG_WDATA_OFFSET                            (0x394)
#define VDO_S_DBGV_WDATA                                        VDO_S_DBGV_WDATA
#define VDO_S_DBGV_WDATA_POS                                    (0U)
#define VDO_S_DBGV_WDATA_LEN                                    (32U)
#define VDO_S_DBGV_WDATA_MSK                                    (((1U<<VDO_S_DBGV_WDATA_LEN)-1)<<VDO_S_DBGV_WDATA_POS)
#define VDO_S_DBGV_WDATA_UMSK                                   (~(((1U<<VDO_S_DBGV_WDATA_LEN)-1)<<VDO_S_DBGV_WDATA_POS))

/* 0x398 : vdo_pfchv_s_dbg_pfchsta */
#define VDO_PFCHV_S_DBG_PFCHSTA_OFFSET                          (0x398)
#define VDO_S_DBGV_PFCHSTA                                      VDO_S_DBGV_PFCHSTA
#define VDO_S_DBGV_PFCHSTA_POS                                  (0U)
#define VDO_S_DBGV_PFCHSTA_LEN                                  (32U)
#define VDO_S_DBGV_PFCHSTA_MSK                                  (((1U<<VDO_S_DBGV_PFCHSTA_LEN)-1)<<VDO_S_DBGV_PFCHSTA_POS)
#define VDO_S_DBGV_PFCHSTA_UMSK                                 (~(((1U<<VDO_S_DBGV_PFCHSTA_LEN)-1)<<VDO_S_DBGV_PFCHSTA_POS))

/* 0x39c : vdonr */
#define VDONR_OFFSET                                            (0x39c)
#define VDO_NOISELEVEL                                          VDO_NOISELEVEL
#define VDO_NOISELEVEL_POS                                      (0U)
#define VDO_NOISELEVEL_LEN                                      (6U)
#define VDO_NOISELEVEL_MSK                                      (((1U<<VDO_NOISELEVEL_LEN)-1)<<VDO_NOISELEVEL_POS)
#define VDO_NOISELEVEL_UMSK                                     (~(((1U<<VDO_NOISELEVEL_LEN)-1)<<VDO_NOISELEVEL_POS))
#define VDO_TEMPERALFILTERSTRENGTH                              VDO_TEMPERALFILTERSTRENGTH
#define VDO_TEMPERALFILTERSTRENGTH_POS                          (8U)
#define VDO_TEMPERALFILTERSTRENGTH_LEN                          (4U)
#define VDO_TEMPERALFILTERSTRENGTH_MSK                          (((1U<<VDO_TEMPERALFILTERSTRENGTH_LEN)-1)<<VDO_TEMPERALFILTERSTRENGTH_POS)
#define VDO_TEMPERALFILTERSTRENGTH_UMSK                         (~(((1U<<VDO_TEMPERALFILTERSTRENGTH_LEN)-1)<<VDO_TEMPERALFILTERSTRENGTH_POS))
#define VDO_S_NOISELEVEL                                        VDO_S_NOISELEVEL
#define VDO_S_NOISELEVEL_POS                                    (16U)
#define VDO_S_NOISELEVEL_LEN                                    (6U)
#define VDO_S_NOISELEVEL_MSK                                    (((1U<<VDO_S_NOISELEVEL_LEN)-1)<<VDO_S_NOISELEVEL_POS)
#define VDO_S_NOISELEVEL_UMSK                                   (~(((1U<<VDO_S_NOISELEVEL_LEN)-1)<<VDO_S_NOISELEVEL_POS))
#define VDO_S_TEMPERALFILTERSTRENGTH                            VDO_S_TEMPERALFILTERSTRENGTH
#define VDO_S_TEMPERALFILTERSTRENGTH_POS                        (24U)
#define VDO_S_TEMPERALFILTERSTRENGTH_LEN                        (4U)
#define VDO_S_TEMPERALFILTERSTRENGTH_MSK                        (((1U<<VDO_S_TEMPERALFILTERSTRENGTH_LEN)-1)<<VDO_S_TEMPERALFILTERSTRENGTH_POS)
#define VDO_S_TEMPERALFILTERSTRENGTH_UMSK                       (~(((1U<<VDO_S_TEMPERALFILTERSTRENGTH_LEN)-1)<<VDO_S_TEMPERALFILTERSTRENGTH_POS))

/* 0x3a0 : vdonr_mvctrl */
#define VDONR_MVCTRL_OFFSET                                     (0x3a0)
#define VDO_ZMV_PFLEVEL                                         VDO_ZMV_PFLEVEL
#define VDO_ZMV_PFLEVEL_POS                                     (0U)
#define VDO_ZMV_PFLEVEL_LEN                                     (17U)
#define VDO_ZMV_PFLEVEL_MSK                                     (((1U<<VDO_ZMV_PFLEVEL_LEN)-1)<<VDO_ZMV_PFLEVEL_POS)
#define VDO_ZMV_PFLEVEL_UMSK                                    (~(((1U<<VDO_ZMV_PFLEVEL_LEN)-1)<<VDO_ZMV_PFLEVEL_POS))

/* 0x3a4 : vdonr_sta_ctrl */
#define VDONR_STA_CTRL_OFFSET                                   (0x3a4)
#define VDO_YSMLR_THR                                           VDO_YSMLR_THR
#define VDO_YSMLR_THR_POS                                       (0U)
#define VDO_YSMLR_THR_LEN                                       (16U)
#define VDO_YSMLR_THR_MSK                                       (((1U<<VDO_YSMLR_THR_LEN)-1)<<VDO_YSMLR_THR_POS)
#define VDO_YSMLR_THR_UMSK                                      (~(((1U<<VDO_YSMLR_THR_LEN)-1)<<VDO_YSMLR_THR_POS))

/* 0x3a8 : vdonr_absmv_sum */
#define VDONR_ABSMV_SUM_OFFSET                                  (0x3a8)
#define VDO_ABSMV_SUM                                           VDO_ABSMV_SUM
#define VDO_ABSMV_SUM_POS                                       (0U)
#define VDO_ABSMV_SUM_LEN                                       (22U)
#define VDO_ABSMV_SUM_MSK                                       (((1U<<VDO_ABSMV_SUM_LEN)-1)<<VDO_ABSMV_SUM_POS)
#define VDO_ABSMV_SUM_UMSK                                      (~(((1U<<VDO_ABSMV_SUM_LEN)-1)<<VDO_ABSMV_SUM_POS))

/* 0x3ac : vdonr_mvlevel */
#define VDONR_MVLEVEL_OFFSET                                    (0x3ac)
#define VDO_NZMV_MBCNT                                          VDO_NZMV_MBCNT
#define VDO_NZMV_MBCNT_POS                                      (0U)
#define VDO_NZMV_MBCNT_LEN                                      (14U)
#define VDO_NZMV_MBCNT_MSK                                      (((1U<<VDO_NZMV_MBCNT_LEN)-1)<<VDO_NZMV_MBCNT_POS)
#define VDO_NZMV_MBCNT_UMSK                                     (~(((1U<<VDO_NZMV_MBCNT_LEN)-1)<<VDO_NZMV_MBCNT_POS))
#define VDO_YSMLR_MBCNT                                         VDO_YSMLR_MBCNT
#define VDO_YSMLR_MBCNT_POS                                     (16U)
#define VDO_YSMLR_MBCNT_LEN                                     (14U)
#define VDO_YSMLR_MBCNT_MSK                                     (((1U<<VDO_YSMLR_MBCNT_LEN)-1)<<VDO_YSMLR_MBCNT_POS)
#define VDO_YSMLR_MBCNT_UMSK                                    (~(((1U<<VDO_YSMLR_MBCNT_LEN)-1)<<VDO_YSMLR_MBCNT_POS))

/* 0x3b0 : vdonr_pmbsad */
#define VDONR_PMBSAD_OFFSET                                     (0x3b0)
#define VDO_PMB_SAD                                             VDO_PMB_SAD
#define VDO_PMB_SAD_POS                                         (0U)
#define VDO_PMB_SAD_LEN                                         (30U)
#define VDO_PMB_SAD_MSK                                         (((1U<<VDO_PMB_SAD_LEN)-1)<<VDO_PMB_SAD_POS)
#define VDO_PMB_SAD_UMSK                                        (~(((1U<<VDO_PMB_SAD_LEN)-1)<<VDO_PMB_SAD_POS))

