sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x3b4 : vdonr_imbcnt */
#define VDONR_IMBCNT_OFFSET                                     (0x3b4)
#define VDO_INTRA_MBCNT                                         VDO_INTRA_MBCNT
#define VDO_INTRA_MBCNT_POS                                     (0U)
#define VDO_INTRA_MBCNT_LEN                                     (14U)
#define VDO_INTRA_MBCNT_MSK                                     (((1U<<VDO_INTRA_MBCNT_LEN)-1)<<VDO_INTRA_MBCNT_POS)
#define VDO_INTRA_MBCNT_UMSK                                    (~(((1U<<VDO_INTRA_MBCNT_LEN)-1)<<VDO_INTRA_MBCNT_POS))

/* 0x3b8 : vdonr_s_mvctrl */
#define VDONR_S_MVCTRL_OFFSET                                   (0x3b8)
#define VDO_S_ZMV_PFLEVEL                                       VDO_S_ZMV_PFLEVEL
#define VDO_S_ZMV_PFLEVEL_POS                                   (0U)
#define VDO_S_ZMV_PFLEVEL_LEN                                   (17U)
#define VDO_S_ZMV_PFLEVEL_MSK                                   (((1U<<VDO_S_ZMV_PFLEVEL_LEN)-1)<<VDO_S_ZMV_PFLEVEL_POS)
#define VDO_S_ZMV_PFLEVEL_UMSK                                  (~(((1U<<VDO_S_ZMV_PFLEVEL_LEN)-1)<<VDO_S_ZMV_PFLEVEL_POS))

/* 0x3bc : vdonr_s_sta_ctrl */
#define VDONR_S_STA_CTRL_OFFSET                                 (0x3bc)
#define VDO_S_YSMLR_THR                                         VDO_S_YSMLR_THR
#define VDO_S_YSMLR_THR_POS                                     (0U)
#define VDO_S_YSMLR_THR_LEN                                     (16U)
#define VDO_S_YSMLR_THR_MSK                                     (((1U<<VDO_S_YSMLR_THR_LEN)-1)<<VDO_S_YSMLR_THR_POS)
#define VDO_S_YSMLR_THR_UMSK                                    (~(((1U<<VDO_S_YSMLR_THR_LEN)-1)<<VDO_S_YSMLR_THR_POS))

/* 0x3c0 : vdonr_s_absmv_sum */
#define VDONR_S_ABSMV_SUM_OFFSET                                (0x3c0)
#define VDO_S_ABSMV_SUM                                         VDO_S_ABSMV_SUM
#define VDO_S_ABSMV_SUM_POS                                     (0U)
#define VDO_S_ABSMV_SUM_LEN                                     (22U)
#define VDO_S_ABSMV_SUM_MSK                                     (((1U<<VDO_S_ABSMV_SUM_LEN)-1)<<VDO_S_ABSMV_SUM_POS)
#define VDO_S_ABSMV_SUM_UMSK                                    (~(((1U<<VDO_S_ABSMV_SUM_LEN)-1)<<VDO_S_ABSMV_SUM_POS))

/* 0x3c4 : vdonr_s_mvlevel */
#define VDONR_S_MVLEVEL_OFFSET                                  (0x3c4)
#define VDO_S_NZMV_MBCNT                                        VDO_S_NZMV_MBCNT
#define VDO_S_NZMV_MBCNT_POS                                    (0U)
#define VDO_S_NZMV_MBCNT_LEN                                    (14U)
#define VDO_S_NZMV_MBCNT_MSK                                    (((1U<<VDO_S_NZMV_MBCNT_LEN)-1)<<VDO_S_NZMV_MBCNT_POS)
#define VDO_S_NZMV_MBCNT_UMSK                                   (~(((1U<<VDO_S_NZMV_MBCNT_LEN)-1)<<VDO_S_NZMV_MBCNT_POS))
#define VDO_S_YSMLR_MBCNT                                       VDO_S_YSMLR_MBCNT
#define VDO_S_YSMLR_MBCNT_POS                                   (16U)
#define VDO_S_YSMLR_MBCNT_LEN                                   (14U)
#define VDO_S_YSMLR_MBCNT_MSK                                   (((1U<<VDO_S_YSMLR_MBCNT_LEN)-1)<<VDO_S_YSMLR_MBCNT_POS)
#define VDO_S_YSMLR_MBCNT_UMSK                                  (~(((1U<<VDO_S_YSMLR_MBCNT_LEN)-1)<<VDO_S_YSMLR_MBCNT_POS))

/* 0x3c8 : vdonr_s_pmbsad */
#define VDONR_S_PMBSAD_OFFSET                                   (0x3c8)
#define VDO_S_PMB_SAD                                           VDO_S_PMB_SAD
#define VDO_S_PMB_SAD_POS                                       (0U)
#define VDO_S_PMB_SAD_LEN                                       (30U)
#define VDO_S_PMB_SAD_MSK                                       (((1U<<VDO_S_PMB_SAD_LEN)-1)<<VDO_S_PMB_SAD_POS)
#define VDO_S_PMB_SAD_UMSK                                      (~(((1U<<VDO_S_PMB_SAD_LEN)-1)<<VDO_S_PMB_SAD_POS))

/* 0x3cc : vdonr_s_imbcnt */
#define VDONR_S_IMBCNT_OFFSET                                   (0x3cc)
#define VDO_S_INTRA_MBCNT                                       VDO_S_INTRA_MBCNT
#define VDO_S_INTRA_MBCNT_POS                                   (0U)
#define VDO_S_INTRA_MBCNT_LEN                                   (14U)
#define VDO_S_INTRA_MBCNT_MSK                                   (((1U<<VDO_S_INTRA_MBCNT_LEN)-1)<<VDO_S_INTRA_MBCNT_POS)
#define VDO_S_INTRA_MBCNT_UMSK                                  (~(((1U<<VDO_S_INTRA_MBCNT_LEN)-1)<<VDO_S_INTRA_MBCNT_POS))

/* 0x3d0 : vdo_stuf_dbg */
#define VDO_STUF_DBG_OFFSET                                     (0x3d0)
#define VDO_PIC_BYCNT                                           VDO_PIC_BYCNT
#define VDO_PIC_BYCNT_POS                                       (0U)
#define VDO_PIC_BYCNT_LEN                                       (26U)
#define VDO_PIC_BYCNT_MSK                                       (((1U<<VDO_PIC_BYCNT_LEN)-1)<<VDO_PIC_BYCNT_POS)
#define VDO_PIC_BYCNT_UMSK                                      (~(((1U<<VDO_PIC_BYCNT_LEN)-1)<<VDO_PIC_BYCNT_POS))
#define VDO_PIC_BYCNT_OVF                                       VDO_PIC_BYCNT_OVF
#define VDO_PIC_BYCNT_OVF_POS                                   (26U)
#define VDO_PIC_BYCNT_OVF_LEN                                   (1U)
#define VDO_PIC_BYCNT_OVF_MSK                                   (((1U<<VDO_PIC_BYCNT_OVF_LEN)-1)<<VDO_PIC_BYCNT_OVF_POS)
#define VDO_PIC_BYCNT_OVF_UMSK                                  (~(((1U<<VDO_PIC_BYCNT_OVF_LEN)-1)<<VDO_PIC_BYCNT_OVF_POS))
#define VDO_STUF_OVF                                            VDO_STUF_OVF
#define VDO_STUF_OVF_POS                                        (27U)
#define VDO_STUF_OVF_LEN                                        (1U)
#define VDO_STUF_OVF_MSK                                        (((1U<<VDO_STUF_OVF_LEN)-1)<<VDO_STUF_OVF_POS)
#define VDO_STUF_OVF_UMSK                                       (~(((1U<<VDO_STUF_OVF_LEN)-1)<<VDO_STUF_OVF_POS))
#define VDO_BINCNT_OVF                                          VDO_BINCNT_OVF
#define VDO_BINCNT_OVF_POS                                      (28U)
#define VDO_BINCNT_OVF_LEN                                      (1U)
#define VDO_BINCNT_OVF_MSK                                      (((1U<<VDO_BINCNT_OVF_LEN)-1)<<VDO_BINCNT_OVF_POS)
#define VDO_BINCNT_OVF_UMSK                                     (~(((1U<<VDO_BINCNT_OVF_LEN)-1)<<VDO_BINCNT_OVF_POS))

/* 0x3d4 : vdo_nal_dbg1 */
#define VDO_NAL_DBG1_OFFSET                                     (0x3d4)
#define VDO_STUF_CNT                                            VDO_STUF_CNT
#define VDO_STUF_CNT_POS                                        (0U)
#define VDO_STUF_CNT_LEN                                        (26U)
#define VDO_STUF_CNT_MSK                                        (((1U<<VDO_STUF_CNT_LEN)-1)<<VDO_STUF_CNT_POS)
#define VDO_STUF_CNT_UMSK                                       (~(((1U<<VDO_STUF_CNT_LEN)-1)<<VDO_STUF_CNT_POS))
#define VDO_SH_STATE                                            VDO_SH_STATE
#define VDO_SH_STATE_POS                                        (26U)
#define VDO_SH_STATE_LEN                                        (6U)
#define VDO_SH_STATE_MSK                                        (((1U<<VDO_SH_STATE_LEN)-1)<<VDO_SH_STATE_POS)
#define VDO_SH_STATE_UMSK                                       (~(((1U<<VDO_SH_STATE_LEN)-1)<<VDO_SH_STATE_POS))

/* 0x3d8 : vdo_nal_dbg2 */
#define VDO_NAL_DBG2_OFFSET                                     (0x3d8)
#define VDO_BINCNTX3                                            VDO_BINCNTX3
#define VDO_BINCNTX3_POS                                        (0U)
#define VDO_BINCNTX3_LEN                                        (30U)
#define VDO_BINCNTX3_MSK                                        (((1U<<VDO_BINCNTX3_LEN)-1)<<VDO_BINCNTX3_POS)
#define VDO_BINCNTX3_UMSK                                       (~(((1U<<VDO_BINCNTX3_LEN)-1)<<VDO_BINCNTX3_POS))

/* 0x3dc : vdo_nal_dbg3 */
#define VDO_NAL_DBG3_OFFSET                                     (0x3dc)
#define VDO_MP_MBX                                              VDO_MP_MBX
#define VDO_MP_MBX_POS                                          (0U)
#define VDO_MP_MBX_LEN                                          (7U)
#define VDO_MP_MBX_MSK                                          (((1U<<VDO_MP_MBX_LEN)-1)<<VDO_MP_MBX_POS)
#define VDO_MP_MBX_UMSK                                         (~(((1U<<VDO_MP_MBX_LEN)-1)<<VDO_MP_MBX_POS))
#define VDO_MP_MBY                                              VDO_MP_MBY
#define VDO_MP_MBY_POS                                          (8U)
#define VDO_MP_MBY_LEN                                          (7U)
#define VDO_MP_MBY_MSK                                          (((1U<<VDO_MP_MBY_LEN)-1)<<VDO_MP_MBY_POS)
#define VDO_MP_MBY_UMSK                                         (~(((1U<<VDO_MP_MBY_LEN)-1)<<VDO_MP_MBY_POS))

/* 0x3e0 : vdo_roi_dbg */
#define VDO_ROI_DBG_OFFSET                                      (0x3e0)
#define VDO_ROI_PMBBITS                                         VDO_ROI_PMBBITS
#define VDO_ROI_PMBBITS_POS                                     (0U)
#define VDO_ROI_PMBBITS_LEN                                     (12U)
#define VDO_ROI_PMBBITS_MSK                                     (((1U<<VDO_ROI_PMBBITS_LEN)-1)<<VDO_ROI_PMBBITS_POS)
#define VDO_ROI_PMBBITS_UMSK                                    (~(((1U<<VDO_ROI_PMBBITS_LEN)-1)<<VDO_ROI_PMBBITS_POS))
#define VDO_NROI_PMBBITS                                        VDO_NROI_PMBBITS
#define VDO_NROI_PMBBITS_POS                                    (16U)
#define VDO_NROI_PMBBITS_LEN                                    (12U)
#define VDO_NROI_PMBBITS_MSK                                    (((1U<<VDO_NROI_PMBBITS_LEN)-1)<<VDO_NROI_PMBBITS_POS)
#define VDO_NROI_PMBBITS_UMSK                                   (~(((1U<<VDO_NROI_PMBBITS_LEN)-1)<<VDO_NROI_PMBBITS_POS))

/* 0x3e4 : vdo_rc_dbg */
#define VDO_RC_DBG_OFFSET                                       (0x3e4)
#define VDO_RC_MIN_QP                                           VDO_RC_MIN_QP
#define VDO_RC_MIN_QP_POS                                       (0U)
#define VDO_RC_MIN_QP_LEN                                       (6U)
#define VDO_RC_MIN_QP_MSK                                       (((1U<<VDO_RC_MIN_QP_LEN)-1)<<VDO_RC_MIN_QP_POS)
#define VDO_RC_MIN_QP_UMSK                                      (~(((1U<<VDO_RC_MIN_QP_LEN)-1)<<VDO_RC_MIN_QP_POS))
#define VDO_RC_QP                                               VDO_RC_QP
#define VDO_RC_QP_POS                                           (8U)
#define VDO_RC_QP_LEN                                           (6U)
#define VDO_RC_QP_MSK                                           (((1U<<VDO_RC_QP_LEN)-1)<<VDO_RC_QP_POS)
#define VDO_RC_QP_UMSK                                          (~(((1U<<VDO_RC_QP_LEN)-1)<<VDO_RC_QP_POS))

/* 0x3e8 : vdo_s_stuf_dbg */
#define VDO_S_STUF_DBG_OFFSET                                   (0x3e8)
#define VDO_S_PIC_BYCNT                                         VDO_S_PIC_BYCNT
#define VDO_S_PIC_BYCNT_POS                                     (0U)
#define VDO_S_PIC_BYCNT_LEN                                     (26U)
#define VDO_S_PIC_BYCNT_MSK                                     (((1U<<VDO_S_PIC_BYCNT_LEN)-1)<<VDO_S_PIC_BYCNT_POS)
#define VDO_S_PIC_BYCNT_UMSK                                    (~(((1U<<VDO_S_PIC_BYCNT_LEN)-1)<<VDO_S_PIC_BYCNT_POS))
#define VDO_S_PIC_BYCNT_OVF                                     VDO_S_PIC_BYCNT_OVF
#define VDO_S_PIC_BYCNT_OVF_POS                                 (26U)
#define VDO_S_PIC_BYCNT_OVF_LEN                                 (1U)
#define VDO_S_PIC_BYCNT_OVF_MSK                                 (((1U<<VDO_S_PIC_BYCNT_OVF_LEN)-1)<<VDO_S_PIC_BYCNT_OVF_POS)
#define VDO_S_PIC_BYCNT_OVF_UMSK                                (~(((1U<<VDO_S_PIC_BYCNT_OVF_LEN)-1)<<VDO_S_PIC_BYCNT_OVF_POS))
#define VDO_S_STUF_OVF                                          VDO_S_STUF_OVF
#define VDO_S_STUF_OVF_POS                                      (27U)
#define VDO_S_STUF_OVF_LEN                                      (1U)
#define VDO_S_STUF_OVF_MSK                                      (((1U<<VDO_S_STUF_OVF_LEN)-1)<<VDO_S_STUF_OVF_POS)
#define VDO_S_STUF_OVF_UMSK                                     (~(((1U<<VDO_S_STUF_OVF_LEN)-1)<<VDO_S_STUF_OVF_POS))
#define VDO_S_BINCNT_OVF                                        VDO_S_BINCNT_OVF
#define VDO_S_BINCNT_OVF_POS                                    (28U)
#define VDO_S_BINCNT_OVF_LEN                                    (1U)
#define VDO_S_BINCNT_OVF_MSK                                    (((1U<<VDO_S_BINCNT_OVF_LEN)-1)<<VDO_S_BINCNT_OVF_POS)
#define VDO_S_BINCNT_OVF_UMSK                                   (~(((1U<<VDO_S_BINCNT_OVF_LEN)-1)<<VDO_S_BINCNT_OVF_POS))

/* 0x3ec : vdo_s_nal_dbg1 */
#define VDO_S_NAL_DBG1_OFFSET                                   (0x3ec)
#define VDO_S_STUF_CNT                                          VDO_S_STUF_CNT
#define VDO_S_STUF_CNT_POS                                      (0U)
#define VDO_S_STUF_CNT_LEN                                      (26U)
#define VDO_S_STUF_CNT_MSK                                      (((1U<<VDO_S_STUF_CNT_LEN)-1)<<VDO_S_STUF_CNT_POS)
#define VDO_S_STUF_CNT_UMSK                                     (~(((1U<<VDO_S_STUF_CNT_LEN)-1)<<VDO_S_STUF_CNT_POS))
#define VDO_S_SH_STATE                                          VDO_S_SH_STATE
#define VDO_S_SH_STATE_POS                                      (26U)
#define VDO_S_SH_STATE_LEN                                      (6U)
#define VDO_S_SH_STATE_MSK                                      (((1U<<VDO_S_SH_STATE_LEN)-1)<<VDO_S_SH_STATE_POS)
#define VDO_S_SH_STATE_UMSK                                     (~(((1U<<VDO_S_SH_STATE_LEN)-1)<<VDO_S_SH_STATE_POS))

/* 0x3f0 : vdo_s_nal_dbg2 */
#define VDO_S_NAL_DBG2_OFFSET                                   (0x3f0)
#define VDO_S_BINCNTX3                                          VDO_S_BINCNTX3
#define VDO_S_BINCNTX3_POS                                      (0U)
#define VDO_S_BINCNTX3_LEN                                      (30U)
#define VDO_S_BINCNTX3_MSK                                      (((1U<<VDO_S_BINCNTX3_LEN)-1)<<VDO_S_BINCNTX3_POS)
#define VDO_S_BINCNTX3_UMSK                                     (~(((1U<<VDO_S_BINCNTX3_LEN)-1)<<VDO_S_BINCNTX3_POS))

/* 0x3f4 : vdo_s_nal_dbg3 */
#define VDO_S_NAL_DBG3_OFFSET                                   (0x3f4)
#define VDO_S_MP_MBX                                            VDO_S_MP_MBX
#define VDO_S_MP_MBX_POS                                        (0U)
#define VDO_S_MP_MBX_LEN                                        (7U)
#define VDO_S_MP_MBX_MSK                                        (((1U<<VDO_S_MP_MBX_LEN)-1)<<VDO_S_MP_MBX_POS)
#define VDO_S_MP_MBX_UMSK                                       (~(((1U<<VDO_S_MP_MBX_LEN)-1)<<VDO_S_MP_MBX_POS))
#define VDO_S_MP_MBY                                            VDO_S_MP_MBY
#define VDO_S_MP_MBY_POS                                        (8U)
#define VDO_S_MP_MBY_LEN                                        (7U)
#define VDO_S_MP_MBY_MSK                                        (((1U<<VDO_S_MP_MBY_LEN)-1)<<VDO_S_MP_MBY_POS)
#define VDO_S_MP_MBY_UMSK                                       (~(((1U<<VDO_S_MP_MBY_LEN)-1)<<VDO_S_MP_MBY_POS))

/* 0x3f8 : vdo_s_roi_dbg */
#define VDO_S_ROI_DBG_OFFSET                                    (0x3f8)
#define VDO_S_ROI_PMBBITS                                       VDO_S_ROI_PMBBITS
#define VDO_S_ROI_PMBBITS_POS                                   (0U)
#define VDO_S_ROI_PMBBITS_LEN                                   (12U)
#define VDO_S_ROI_PMBBITS_MSK                                   (((1U<<VDO_S_ROI_PMBBITS_LEN)-1)<<VDO_S_ROI_PMBBITS_POS)
#define VDO_S_ROI_PMBBITS_UMSK                                  (~(((1U<<VDO_S_ROI_PMBBITS_LEN)-1)<<VDO_S_ROI_PMBBITS_POS))
#define VDO_S_NROI_PMBBITS                                      VDO_S_NROI_PMBBITS
#define VDO_S_NROI_PMBBITS_POS                                  (16U)
#define VDO_S_NROI_PMBBITS_LEN                                  (12U)
#define VDO_S_NROI_PMBBITS_MSK                                  (((1U<<VDO_S_NROI_PMBBITS_LEN)-1)<<VDO_S_NROI_PMBBITS_POS)
#define VDO_S_NROI_PMBBITS_UMSK                                 (~(((1U<<VDO_S_NROI_PMBBITS_LEN)-1)<<VDO_S_NROI_PMBBITS_POS))

/* 0x3fc : vdo_s_rc_dbg */
#define VDO_S_RC_DBG_OFFSET                                     (0x3fc)
#define VDO_S_RC_MIN_QP                                         VDO_S_RC_MIN_QP
#define VDO_S_RC_MIN_QP_POS                                     (0U)
#define VDO_S_RC_MIN_QP_LEN                                     (6U)
#define VDO_S_RC_MIN_QP_MSK                                     (((1U<<VDO_S_RC_MIN_QP_LEN)-1)<<VDO_S_RC_MIN_QP_POS)
#define VDO_S_RC_MIN_QP_UMSK                                    (~(((1U<<VDO_S_RC_MIN_QP_LEN)-1)<<VDO_S_RC_MIN_QP_POS))
#define VDO_S_RC_QP                                             VDO_S_RC_QP
#define VDO_S_RC_QP_POS                                         (8U)
#define VDO_S_RC_QP_LEN                                         (6U)
#define VDO_S_RC_QP_MSK                                         (((1U<<VDO_S_RC_QP_LEN)-1)<<VDO_S_RC_QP_POS)
#define VDO_S_RC_QP_UMSK                                        (~(((1U<<VDO_S_RC_QP_LEN)-1)<<VDO_S_RC_QP_POS))

/* 0x400 : vdo_refaxi_dbg */
#define VDO_REFAXI_DBG_OFFSET                                   (0x400)
#define VDO_REF2AXI_BUSY                                        VDO_REF2AXI_BUSY
#define VDO_REF2AXI_BUSY_POS                                    (0U)
#define VDO_REF2AXI_BUSY_LEN                                    (1U)
#define VDO_REF2AXI_BUSY_MSK                                    (((1U<<VDO_REF2AXI_BUSY_LEN)-1)<<VDO_REF2AXI_BUSY_POS)
#define VDO_REF2AXI_BUSY_UMSK                                   (~(((1U<<VDO_REF2AXI_BUSY_LEN)-1)<<VDO_REF2AXI_BUSY_POS))
#define VDO_REF_RFIFO_ERROR                                     VDO_REF_RFIFO_ERROR
#define VDO_REF_RFIFO_ERROR_POS                                 (4U)
#define VDO_REF_RFIFO_ERROR_LEN                                 (2U)
#define VDO_REF_RFIFO_ERROR_MSK                                 (((1U<<VDO_REF_RFIFO_ERROR_LEN)-1)<<VDO_REF_RFIFO_ERROR_POS)
#define VDO_REF_RFIFO_ERROR_UMSK                                (~(((1U<<VDO_REF_RFIFO_ERROR_LEN)-1)<<VDO_REF_RFIFO_ERROR_POS))
#define VDO_REF_WFIFO_ERROR                                     VDO_REF_WFIFO_ERROR
#define VDO_REF_WFIFO_ERROR_POS                                 (6U)
#define VDO_REF_WFIFO_ERROR_LEN                                 (2U)
#define VDO_REF_WFIFO_ERROR_MSK                                 (((1U<<VDO_REF_WFIFO_ERROR_LEN)-1)<<VDO_REF_WFIFO_ERROR_POS)
#define VDO_REF_WFIFO_ERROR_UMSK                                (~(((1U<<VDO_REF_WFIFO_ERROR_LEN)-1)<<VDO_REF_WFIFO_ERROR_POS))
#define VDO_REF_RFIFO_EMPTY                                     VDO_REF_RFIFO_EMPTY
#define VDO_REF_RFIFO_EMPTY_POS                                 (8U)
#define VDO_REF_RFIFO_EMPTY_LEN                                 (3U)
#define VDO_REF_RFIFO_EMPTY_MSK                                 (((1U<<VDO_REF_RFIFO_EMPTY_LEN)-1)<<VDO_REF_RFIFO_EMPTY_POS)
#define VDO_REF_RFIFO_EMPTY_UMSK                                (~(((1U<<VDO_REF_RFIFO_EMPTY_LEN)-1)<<VDO_REF_RFIFO_EMPTY_POS))
#define VDO_REF_WFIFO_EMPTY                                     VDO_REF_WFIFO_EMPTY
#define VDO_REF_WFIFO_EMPTY_POS                                 (12U)
#define VDO_REF_WFIFO_EMPTY_LEN                                 (5U)
#define VDO_REF_WFIFO_EMPTY_MSK                                 (((1U<<VDO_REF_WFIFO_EMPTY_LEN)-1)<<VDO_REF_WFIFO_EMPTY_POS)
#define VDO_REF_WFIFO_EMPTY_UMSK                                (~(((1U<<VDO_REF_WFIFO_EMPTY_LEN)-1)<<VDO_REF_WFIFO_EMPTY_POS))

/* 0x404 : vdo_pfchaxi_dbg */
#define VDO_PFCHAXI_DBG_OFFSET                                  (0x404)
#define VDO_PFCH_RFIFO_BUSY                                     VDO_PFCH_RFIFO_BUSY
#define VDO_PFCH_RFIFO_BUSY_POS                                 (0U)
#define VDO_PFCH_RFIFO_BUSY_LEN                                 (1U)
#define VDO_PFCH_RFIFO_BUSY_MSK                                 (((1U<<VDO_PFCH_RFIFO_BUSY_LEN)-1)<<VDO_PFCH_RFIFO_BUSY_POS)
#define VDO_PFCH_RFIFO_BUSY_UMSK                                (~(((1U<<VDO_PFCH_RFIFO_BUSY_LEN)-1)<<VDO_PFCH_RFIFO_BUSY_POS))
#define VDO_PFCH_RFIFO_ERROR                                    VDO_PFCH_RFIFO_ERROR
#define VDO_PFCH_RFIFO_ERROR_POS                                (4U)
#define VDO_PFCH_RFIFO_ERROR_LEN                                (2U)
#define VDO_PFCH_RFIFO_ERROR_MSK                                (((1U<<VDO_PFCH_RFIFO_ERROR_LEN)-1)<<VDO_PFCH_RFIFO_ERROR_POS)
#define VDO_PFCH_RFIFO_ERROR_UMSK                               (~(((1U<<VDO_PFCH_RFIFO_ERROR_LEN)-1)<<VDO_PFCH_RFIFO_ERROR_POS))
#define VDO_PFCH_RFIFO_EMPTY                                    VDO_PFCH_RFIFO_EMPTY
#define VDO_PFCH_RFIFO_EMPTY_POS                                (8U)
#define VDO_PFCH_RFIFO_EMPTY_LEN                                (3U)
#define VDO_PFCH_RFIFO_EMPTY_MSK                                (((1U<<VDO_PFCH_RFIFO_EMPTY_LEN)-1)<<VDO_PFCH_RFIFO_EMPTY_POS)
#define VDO_PFCH_RFIFO_EMPTY_UMSK                               (~(((1U<<VDO_PFCH_RFIFO_EMPTY_LEN)-1)<<VDO_PFCH_RFIFO_EMPTY_POS))
#define VDO_PFCHV_RFIFO_BUSY                                    VDO_PFCHV_RFIFO_BUSY
#define VDO_PFCHV_RFIFO_BUSY_POS                                (12U)
#define VDO_PFCHV_RFIFO_BUSY_LEN                                (1U)
#define VDO_PFCHV_RFIFO_BUSY_MSK                                (((1U<<VDO_PFCHV_RFIFO_BUSY_LEN)-1)<<VDO_PFCHV_RFIFO_BUSY_POS)
#define VDO_PFCHV_RFIFO_BUSY_UMSK                               (~(((1U<<VDO_PFCHV_RFIFO_BUSY_LEN)-1)<<VDO_PFCHV_RFIFO_BUSY_POS))
#define VDO_PFCHV_RFIFO_ERROR                                   VDO_PFCHV_RFIFO_ERROR
#define VDO_PFCHV_RFIFO_ERROR_POS                               (16U)
#define VDO_PFCHV_RFIFO_ERROR_LEN                               (2U)
#define VDO_PFCHV_RFIFO_ERROR_MSK                               (((1U<<VDO_PFCHV_RFIFO_ERROR_LEN)-1)<<VDO_PFCHV_RFIFO_ERROR_POS)
#define VDO_PFCHV_RFIFO_ERROR_UMSK                              (~(((1U<<VDO_PFCHV_RFIFO_ERROR_LEN)-1)<<VDO_PFCHV_RFIFO_ERROR_POS))
#define VDO_PFCHV_RFIFO_EMPTY                                   VDO_PFCHV_RFIFO_EMPTY
#define VDO_PFCHV_RFIFO_EMPTY_POS                               (20U)
#define VDO_PFCHV_RFIFO_EMPTY_LEN                               (3U)
#define VDO_PFCHV_RFIFO_EMPTY_MSK                               (((1U<<VDO_PFCHV_RFIFO_EMPTY_LEN)-1)<<VDO_PFCHV_RFIFO_EMPTY_POS)
#define VDO_PFCHV_RFIFO_EMPTY_UMSK                              (~(((1U<<VDO_PFCHV_RFIFO_EMPTY_LEN)-1)<<VDO_PFCHV_RFIFO_EMPTY_POS))

