sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
/* 0x408 : vdo_bsaxi_dbg */
#define VDO_BSAXI_DBG_OFFSET                                    (0x408)
#define VDO_BS_WFIFO_BUSY                                       VDO_BS_WFIFO_BUSY
#define VDO_BS_WFIFO_BUSY_POS                                   (0U)
#define VDO_BS_WFIFO_BUSY_LEN                                   (1U)
#define VDO_BS_WFIFO_BUSY_MSK                                   (((1U<<VDO_BS_WFIFO_BUSY_LEN)-1)<<VDO_BS_WFIFO_BUSY_POS)
#define VDO_BS_WFIFO_BUSY_UMSK                                  (~(((1U<<VDO_BS_WFIFO_BUSY_LEN)-1)<<VDO_BS_WFIFO_BUSY_POS))
#define VDO_BS_WFIFO_ERROR                                      VDO_BS_WFIFO_ERROR
#define VDO_BS_WFIFO_ERROR_POS                                  (4U)
#define VDO_BS_WFIFO_ERROR_LEN                                  (2U)
#define VDO_BS_WFIFO_ERROR_MSK                                  (((1U<<VDO_BS_WFIFO_ERROR_LEN)-1)<<VDO_BS_WFIFO_ERROR_POS)
#define VDO_BS_WFIFO_ERROR_UMSK                                 (~(((1U<<VDO_BS_WFIFO_ERROR_LEN)-1)<<VDO_BS_WFIFO_ERROR_POS))
#define VDO_BS_WFIFO_EMPTY                                      VDO_BS_WFIFO_EMPTY
#define VDO_BS_WFIFO_EMPTY_POS                                  (8U)
#define VDO_BS_WFIFO_EMPTY_LEN                                  (5U)
#define VDO_BS_WFIFO_EMPTY_MSK                                  (((1U<<VDO_BS_WFIFO_EMPTY_LEN)-1)<<VDO_BS_WFIFO_EMPTY_POS)
#define VDO_BS_WFIFO_EMPTY_UMSK                                 (~(((1U<<VDO_BS_WFIFO_EMPTY_LEN)-1)<<VDO_BS_WFIFO_EMPTY_POS))
#define VDO_BS_ST                                               VDO_BS_ST
#define VDO_BS_ST_POS                                           (16U)
#define VDO_BS_ST_LEN                                           (2U)
#define VDO_BS_ST_MSK                                           (((1U<<VDO_BS_ST_LEN)-1)<<VDO_BS_ST_POS)
#define VDO_BS_ST_UMSK                                          (~(((1U<<VDO_BS_ST_LEN)-1)<<VDO_BS_ST_POS))

/* 0x40c : vdo_frame_id */
#define VDO_FRAME_ID_OFFSET                                     (0x40c)
#define VDO_FRAME_ID                                            VDO_FRAME_ID
#define VDO_FRAME_ID_POS                                        (0U)
#define VDO_FRAME_ID_LEN                                        (32U)
#define VDO_FRAME_ID_MSK                                        (((1U<<VDO_FRAME_ID_LEN)-1)<<VDO_FRAME_ID_POS)
#define VDO_FRAME_ID_UMSK                                       (~(((1U<<VDO_FRAME_ID_LEN)-1)<<VDO_FRAME_ID_POS))

/* 0x410 : vdo_s_vdo_frame_id */
#define VDO_S_VDO_FRAME_ID_OFFSET                               (0x410)
#define VDO_S_FRAME_ID                                          VDO_S_FRAME_ID
#define VDO_S_FRAME_ID_POS                                      (0U)
#define VDO_S_FRAME_ID_LEN                                      (32U)
#define VDO_S_FRAME_ID_MSK                                      (((1U<<VDO_S_FRAME_ID_LEN)-1)<<VDO_S_FRAME_ID_POS)
#define VDO_S_FRAME_ID_UMSK                                     (~(((1U<<VDO_S_FRAME_ID_LEN)-1)<<VDO_S_FRAME_ID_POS))

 struct vdo_reg {

    /* 0x0 : h264_encoder_ctrl */
    union {
        struct {
            uint32_t cfg_enc_ctrl_mby_idx           :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_core_clk_en                :  1; /* [    8],       r/w,       0x0 */
            uint32_t cfg_zstuf_dis                  :  1; /* [    9],       r/w,       0x0 */
            uint32_t cfg_qr_upd                     :  1; /* [   10],       w1p,       0x0 */
            uint32_t cfg_s_qr_upd                   :  1; /* [   11],       w1p,       0x0 */
            uint32_t cfg_mem_clk_en                 :  1; /* [   12],       r/w,       0x0 */
            uint32_t cfg_rc_gop_upd                 :  1; /* [   13],       w1p,       0x0 */
            uint32_t cfg_s_rc_gop_upd               :  1; /* [   14],       w1p,       0x0 */
            uint32_t cfg_duo_bs_en                  :  1; /* [   15],       r/w,       0x0 */
            uint32_t cfg_buf_clr                    :  1; /* [   16],       w1p,       0x0 */
            uint32_t cfg_s_buf_clr                  :  1; /* [   17],       w1p,       0x0 */
            uint32_t cfg_vdonr_en                   :  1; /* [   18],       r/w,       0x0 */
            uint32_t cfg_s_vdonr_en                 :  1; /* [   19],       r/w,       0x0 */
            uint32_t cfg_bs_status_init             :  1; /* [   20],       w1p,       0x0 */
            uint32_t cfg_s_bs_status_init           :  1; /* [   21],       w1p,       0x0 */
            uint32_t cfg_src_line_clr               :  1; /* [   22],       w1p,       0x0 */
            uint32_t cfg_s_src_line_clr             :  1; /* [   23],       w1p,       0x0 */
            uint32_t cfg_ctrl_mode                  :  2; /* [25:24],       r/w,       0x0 */
            uint32_t cfg_cref_en                    :  1; /* [   26],       r/w,       0x0 */
            uint32_t cfg_s_cref_en                  :  1; /* [   27],       r/w,       0x0 */
            uint32_t cfg_frame_start                :  1; /* [   28],       w1p,       0x0 */
            uint32_t cfg_enc_seq_en                 :  1; /* [   29],       r/w,       0x0 */
            uint32_t cfg_s_frame_start              :  1; /* [   30],       w1p,       0x0 */
            uint32_t cfg_s_enc_seq_en               :  1; /* [   31],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_encoder_ctrl;

    /* 0x4 : h264_frame_size */
    union {
        struct {
            uint32_t cfg_frame_width                : 11; /* [10: 0],       r/w,       0x0 */
            uint32_t reserved_11_15                 :  5; /* [15:11],      rsvd,       0x0 */
            uint32_t cfg_frame_height               : 11; /* [26:16],       r/w,       0x0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_frame_size;

