sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x8 : h264_frame_base_addr_y */
    union {
        struct {
            uint32_t cfg_frame_base_addr_y          : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_frame_base_addr_y;

    /* 0xc : h264_frame_base_addr_uv */
    union {
        struct {
            uint32_t cfg_frame_base_addr_uv         : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_frame_base_addr_uv;

    /* 0x10 : h264_bs_base_addr */
    union {
        struct {
            uint32_t cfg_bs_base_addr               : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_bs_base_addr;

    /* 0x14 : h264_lb_base_addr */
    union {
        struct {
            uint32_t cfg_lb_base_addr               : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_lb_base_addr;

    /* 0x18 : h264_bs_size */
    union {
        struct {
            uint32_t cfg_bs_size                    : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_bs_size;

    /* 0x1c : h264_bs_full_thr */
    union {
        struct {
            uint32_t cfg_bs_full_thr                : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_bs_full_thr;

    /* 0x20 : h264_src_bf_height */
    union {
        struct {
            uint32_t cfg_c_src_bf_height            : 15; /* [14: 0],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_y_src_bf_height            : 15; /* [30:16],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_src_bf_height;

    /* 0x24 : core_reg0 */
    union {
        struct {
            uint32_t enc_en                         :  1; /* [    0],       r/w,       0x0 */
            uint32_t reserved_1_11                  : 11; /* [11: 1],      rsvd,       0x0 */
            uint32_t vui_aspect_info                :  1; /* [   12],       r/w,       0x0 */
            uint32_t vui_fixed_f_rate               :  1; /* [   13],       r/w,       0x0 */
            uint32_t vui_timing_info                :  1; /* [   14],       r/w,       0x0 */
            uint32_t idr_enable                     :  1; /* [   15],       r/w,       0x0 */
            uint32_t s_enc_en                       :  1; /* [   16],       r/w,       0x0 */
            uint32_t reserved_17_27                 : 11; /* [27:17],      rsvd,       0x0 */
            uint32_t s_vui_aspect_info              :  1; /* [   28],       r/w,       0x0 */
            uint32_t s_vui_fixed_f_rate             :  1; /* [   29],       r/w,       0x0 */
            uint32_t s_vui_timing_info              :  1; /* [   30],       r/w,       0x0 */
            uint32_t s_idr_enable                   :  1; /* [   31],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg0;

    /* 0x28 : core_reg1 */
    union {
        struct {
            uint32_t img_width                      : 11; /* [10: 0],       r/w,       0x0 */
            uint32_t reserved_11_15                 :  5; /* [15:11],      rsvd,       0x0 */
            uint32_t s_img_width                    : 11; /* [26:16],       r/w,       0x0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg1;

    /* 0x2c : core_reg2 */
    union {
        struct {
            uint32_t img_height                     : 11; /* [10: 0],       r/w,       0x0 */
            uint32_t reserved_11_15                 :  5; /* [15:11],      rsvd,       0x0 */
            uint32_t s_img_height                   : 11; /* [26:16],       r/w,       0x0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg2;

    /* 0x30 : core_reg3 */
    union {
        struct {
            uint32_t target_i_qp                    :  6; /* [ 5: 0],       r/w,       0x0 */
            uint32_t reserved_6_15                  : 10; /* [15: 6],      rsvd,       0x0 */
            uint32_t s_target_i_qp                  :  6; /* [21:16],       r/w,       0x0 */
            uint32_t reserved_22_31                 : 10; /* [31:22],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg3;

    /* 0x34 : core_reg4 */
    union {
        struct {
            uint32_t cqp_offset                     :  5; /* [ 4: 0],       r/w,       0x0 */
            uint32_t reserved_5_15                  : 11; /* [15: 5],      rsvd,       0x0 */
            uint32_t s_cqp_offset                   :  5; /* [20:16],       r/w,       0x0 */
            uint32_t reserved_21_31                 : 11; /* [31:21],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg4;

    /* 0x38 : core_reg5 */
    union {
        struct {
            uint32_t target_p_qp                    :  6; /* [ 5: 0],       r/w,       0x0 */
            uint32_t reserved_6_15                  : 10; /* [15: 6],      rsvd,       0x0 */
            uint32_t s_target_p_qp                  :  6; /* [21:16],       r/w,       0x0 */
            uint32_t reserved_22_31                 : 10; /* [31:22],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg5;

    /* 0x3c : core_reg6 */
    union {
        struct {
            uint32_t mb_lines                       :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7_15                  :  9; /* [15: 7],      rsvd,       0x0 */
            uint32_t s_mb_lines                     :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23_31                 :  9; /* [31:23],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg6;

    /* 0x40 : core_reg7 */
    union {
        struct {
            uint32_t num_slices                     :  4; /* [ 3: 0],       r/w,       0x0 */
            uint32_t reserved_4_15                  : 12; /* [15: 4],      rsvd,       0x0 */
            uint32_t s_num_slices                   :  4; /* [19:16],       r/w,       0x0 */
            uint32_t reserved_20_31                 : 12; /* [31:20],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg7;

    /* 0x44 : core_reg8 */
    union {
        struct {
            uint32_t num_pframes                    : 10; /* [ 9: 0],       r/w,       0x0 */
            uint32_t reserved_10_15                 :  6; /* [15:10],      rsvd,       0x0 */
            uint32_t s_num_pframes                  : 10; /* [25:16],       r/w,       0x0 */
            uint32_t reserved_26_31                 :  6; /* [31:26],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg8;

    /* 0x48 : core_reg9 */
    union {
        struct {
            uint32_t dis_filter                     :  1; /* [    0],       r/w,       0x0 */
            uint32_t reserved_1_15                  : 15; /* [15: 1],      rsvd,       0x0 */
            uint32_t s_dis_filter                   :  1; /* [   16],       r/w,       0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg9;

    /* 0x4c : core_reg10 */
    union {
        struct {
            uint32_t alpha_off                      :  4; /* [ 3: 0],       r/w,       0x0 */
            uint32_t reserved_4_15                  : 12; /* [15: 4],      rsvd,       0x0 */
            uint32_t s_alpha_off                    :  4; /* [19:16],       r/w,       0x0 */
            uint32_t reserved_20_31                 : 12; /* [31:20],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg10;

    /* 0x50 : core_reg11 */
    union {
        struct {
            uint32_t beta_off                       :  4; /* [ 3: 0],       r/w,       0x0 */
            uint32_t reserved_4_15                  : 12; /* [15: 4],      rsvd,       0x0 */
            uint32_t s_beta_off                     :  4; /* [19:16],       r/w,       0x0 */
            uint32_t reserved_20_31                 : 12; /* [31:20],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg11;

    /* 0x54 : core_reg12 */
    union {
        struct {
            uint32_t profile_idc                    :  1; /* [    0],       r/w,       0x0 */
            uint32_t reserved_1_15                  : 15; /* [15: 1],      rsvd,       0x0 */
            uint32_t s_profile_idc                  :  1; /* [   16],       r/w,       0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg12;

    /* 0x58 : core_reg13 */
    union {
        struct {
            uint32_t level_idc                      :  8; /* [ 7: 0],       r/w,       0x0 */
            uint32_t reserved_8_15                  :  8; /* [15: 8],      rsvd,       0x0 */
            uint32_t s_level_idc                    :  8; /* [23:16],       r/w,       0x0 */
            uint32_t reserved_24_31                 :  8; /* [31:24],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg13;

    /* 0x5c : core_reg14 */
    union {
        struct {
            uint32_t luma8x8_cost                   :  3; /* [ 2: 0],       r/w,       0x0 */
            uint32_t luma16x16_cost                 :  3; /* [ 5: 3],       r/w,       0x0 */
            uint32_t chroma8x8_cost                 :  3; /* [ 8: 6],       r/w,       0x0 */
            uint32_t reserved_9_15                  :  7; /* [15: 9],      rsvd,       0x0 */
            uint32_t s_luma8x8_cost                 :  3; /* [18:16],       r/w,       0x0 */
            uint32_t s_luma16x16_cost               :  3; /* [21:19],       r/w,       0x0 */
            uint32_t s_chroma8x8_cost               :  3; /* [24:22],       r/w,       0x0 */
            uint32_t reserved_25_31                 :  7; /* [31:25],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg14;

    /* 0x60 : reserved */
    uint8_t reserved96[4];

    /* 0x64 : core_reg16 */
    union {
        struct {
            uint32_t frame0                         : 14; /* [13: 0],       r/w,       0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t s_frame0                       : 14; /* [29:16],       r/w,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg16;

    /* 0x68 : core_reg17 */
    union {
        struct {
            uint32_t frame1                         : 14; /* [13: 0],       r/w,       0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t s_frame1                       : 14; /* [29:16],       r/w,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg17;

    /* 0x6c : core_reg18 */
    union {
        struct {
            uint32_t ext_data                       : 14; /* [13: 0],       r/w,       0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t s_ext_data                     : 14; /* [29:16],       r/w,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg18;

    /* 0x70 : core_reg19 */
    union {
        struct {
            uint32_t ext_mem_config0                :  6; /* [ 5: 0],       r/w,       0x0 */
            uint32_t reserved_6_15                  : 10; /* [15: 6],      rsvd,       0x0 */
            uint32_t s_ext_mem_config0              :  6; /* [21:16],       r/w,       0x0 */
            uint32_t reserved_22_31                 : 10; /* [31:22],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg19;

    /* 0x74 : core_reg20 */
    union {
        struct {
            uint32_t ext_mem_config1                :  5; /* [ 4: 0],       r/w,       0x0 */
            uint32_t reserved_5_15                  : 11; /* [15: 5],      rsvd,       0x0 */
            uint32_t s_ext_mem_config1              :  5; /* [20:16],       r/w,       0x0 */
            uint32_t reserved_21_31                 : 11; /* [31:21],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg20;

    /* 0x78 : core_reg21 */
    union {
        struct {
            uint32_t ext_mem_config2                : 12; /* [11: 0],       r/w,       0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],      rsvd,       0x0 */
            uint32_t s_ext_mem_config2              : 12; /* [27:16],       r/w,       0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg21;

    /* 0x7c : core_reg22 */
    union {
        struct {
            uint32_t ext_mem_config3                : 10; /* [ 9: 0],       r/w,       0x0 */
            uint32_t reserved_10_15                 :  6; /* [15:10],      rsvd,       0x0 */
            uint32_t s_ext_mem_config3              : 10; /* [25:16],       r/w,       0x0 */
            uint32_t reserved_26_31                 :  6; /* [31:26],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg22;

    /* 0x80 : core_reg23 */
    union {
        struct {
            uint32_t num_imb_bits                   : 12; /* [11: 0],       r/w,       0x0 */
            uint32_t reserved_12                    :  1; /* [   12],      rsvd,       0x0 */
            uint32_t nal_align                      :  1; /* [   13],       r/w,       0x0 */
            uint32_t cons_ipred                     :  1; /* [   14],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t s_num_imb_bits                 : 12; /* [27:16],       r/w,       0x0 */
            uint32_t reserved_28                    :  1; /* [   28],      rsvd,       0x0 */
            uint32_t s_nal_align                    :  1; /* [   29],       r/w,       0x0 */
            uint32_t s_cons_ipred                   :  1; /* [   30],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg23;

