sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x84 : core_reg24 */
    union {
        struct {
            uint32_t num_pmb_bits                   : 12; /* [11: 0],       r/w,       0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],      rsvd,       0x0 */
            uint32_t s_num_pmb_bits                 : 12; /* [27:16],       r/w,       0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg24;

    /* 0x88 : core_reg25 */
    union {
        struct {
            uint32_t interlace_mode                 :  1; /* [    0],       r/w,       0x0 */
            uint32_t bottom_field_first             :  1; /* [    1],       r/w,       0x0 */
            uint32_t prev_field_ref                 :  1; /* [    2],       r/w,       0x0 */
            uint32_t reserved_3_15                  : 13; /* [15: 3],      rsvd,       0x0 */
            uint32_t s_interlace_mode               :  1; /* [   16],       r/w,       0x0 */
            uint32_t s_bottom_field_first           :  1; /* [   17],       r/w,       0x0 */
            uint32_t s_prev_field_ref               :  1; /* [   18],       r/w,       0x0 */
            uint32_t reserved_19_31                 : 13; /* [31:19],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg25;

    /* 0x8c : reserved */
    uint8_t reserved140[8];

    /* 0x94 : core_reg28 */
    union {
        struct {
            uint32_t pframe_min_qp                  :  6; /* [ 5: 0],       r/w,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t pframe_max_qp                  :  6; /* [13: 8],       r/w,      0x33 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t s_pframe_min_qp                :  6; /* [21:16],       r/w,       0x0 */
            uint32_t reserved_22_23                 :  2; /* [23:22],      rsvd,       0x0 */
            uint32_t s_pframe_max_qp                :  6; /* [29:24],       r/w,      0x33 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg28;

    /* 0x98 : reserved */
    uint8_t reserved152[4];

    /* 0x9c : core_reg30 */
    union {
        struct {
            uint32_t reserved_0_14                  : 15; /* [14: 0],      rsvd,       0x0 */
            uint32_t reset_i_state                  :  1; /* [   15],       r/w,       0x1 */
            uint32_t reserved_16_30                 : 15; /* [30:16],      rsvd,       0x0 */
            uint32_t s_reset_i_state                :  1; /* [   31],       r/w,       0x1 */
        }BF;
        uint32_t WORD;
    } core_reg30;

    /* 0xa0 : core_reg31 */
    union {
        struct {
            uint32_t iframe_min_qp                  :  6; /* [ 5: 0],       r/w,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t iframe_max_qp                  :  6; /* [13: 8],       r/w,      0x33 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t s_iframe_min_qp                :  6; /* [21:16],       r/w,       0x0 */
            uint32_t reserved_22_23                 :  2; /* [23:22],      rsvd,       0x0 */
            uint32_t s_iframe_max_qp                :  6; /* [29:24],       r/w,      0x33 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg31;

    /* 0xa4 : core_reg32 */
    union {
        struct {
            uint32_t vui_time_scale_l               : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t s_vui_time_scale_l             : 16; /* [31:16],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg32;

    /* 0xa8 : core_reg33 */
    union {
        struct {
            uint32_t vui_time_scale_h               : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t s_vui_time_scale_h             : 16; /* [31:16],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg33;

    /* 0xac : core_reg34 */
    union {
        struct {
            uint32_t vui_num_u_tick_l               : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t s_vui_num_u_tick_l             : 16; /* [31:16],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg34;

    /* 0xb0 : core_reg35 */
    union {
        struct {
            uint32_t vui_num_u_tick_h               : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t s_vui_num_u_tick_h             : 16; /* [31:16],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg35;

    /* 0xb4 : core_reg36 */
    union {
        struct {
            uint32_t vui_aspect_idc                 :  8; /* [ 7: 0],       r/w,       0x0 */
            uint32_t reserved_8_15                  :  8; /* [15: 8],      rsvd,       0x0 */
            uint32_t s_vui_aspect_idc               :  8; /* [23:16],       r/w,       0x0 */
            uint32_t reserved_24_31                 :  8; /* [31:24],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg36;

    /* 0xb8 : core_reg37 */
    union {
        struct {
            uint32_t vui_aspect_width               : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t s_vui_aspect_width             : 16; /* [31:16],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg37;

    /* 0xbc : core_reg38 */
    union {
        struct {
            uint32_t vui_aspect_height              : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t s_vui_aspect_height            : 16; /* [31:16],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } core_reg38;

    /* 0xc0 : src_dvp_sel */
    union {
        struct {
            uint32_t uv_dvp2axi_sel                 :  3; /* [ 2: 0],       r/w,       0x0 */
            uint32_t reserved_3                     :  1; /* [    3],      rsvd,       0x0 */
            uint32_t y_dvp2axi_sel                  :  3; /* [ 6: 4],       r/w,       0x0 */
            uint32_t reserved_7_15                  :  9; /* [15: 7],      rsvd,       0x0 */
            uint32_t s_uv_dvp2axi_sel               :  3; /* [18:16],       r/w,       0x0 */
            uint32_t reserved_19                    :  1; /* [   19],      rsvd,       0x0 */
            uint32_t s_y_dvp2axi_sel                :  3; /* [22:20],       r/w,       0x0 */
            uint32_t reserved_23_31                 :  9; /* [31:23],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } src_dvp_sel;

    /* 0xc4 : padding_ctrl */
    union {
        struct {
            uint32_t y_padding_pixel                :  8; /* [ 7: 0],       r/w,       0x0 */
            uint32_t u_padding_pixel                :  8; /* [15: 8],       r/w,      0x80 */
            uint32_t v_padding_pixel                :  8; /* [23:16],       r/w,      0x80 */
            uint32_t y_line_pad                     :  5; /* [28:24],       r/w,       0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } padding_ctrl;

