sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0xc8 : reserved */
    uint8_t reserved200[16];

    /* 0xd8 : vdo_frame_id_clr */
    union {
        struct {
            uint32_t frame_id_clr                   :  1; /* [    0],       w1p,       0x0 */
            uint32_t s_frame_id_clr                 :  1; /* [    1],       w1p,       0x0 */
            uint32_t reserved_2_31                  : 30; /* [31: 2],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_frame_id_clr;

    /* 0xdc : reserved */
    uint8_t reserved220[36];

    /* 0x100 : vdo_int */
    union {
        struct {
            uint32_t frm_done_int                   :  1; /* [    0],         r,       0x0 */
            uint32_t s_frm_done_int                 :  1; /* [    1],         r,       0x0 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],      rsvd,       0x0 */
            uint32_t seq_done_int                   :  1; /* [    4],         r,       0x0 */
            uint32_t s_seq_done_int                 :  1; /* [    5],         r,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t bs_full_int                    :  1; /* [    8],         r,       0x0 */
            uint32_t s_bs_full_int                  :  1; /* [    9],         r,       0x0 */
            uint32_t reserved_10_31                 : 22; /* [31:10],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_int;

    /* 0x104 : vdo_int_clr */
    union {
        struct {
            uint32_t frm_done_int_clr               :  1; /* [    0],       w1p,       0x0 */
            uint32_t s_frm_done_int_clr             :  1; /* [    1],       w1p,       0x0 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],      rsvd,       0x0 */
            uint32_t seq_done_int_clr               :  1; /* [    4],       w1p,       0x0 */
            uint32_t s_seq_done_int_clr             :  1; /* [    5],       w1p,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t bs_full_int_clr                :  1; /* [    8],       w1p,       0x0 */
            uint32_t s_bs_full_int_clr              :  1; /* [    9],       w1p,       0x0 */
            uint32_t reserved_10_31                 : 22; /* [31:10],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_int_clr;

    /* 0x108 : vdo_int_mask */
    union {
        struct {
            uint32_t frm_done_int_mask              :  1; /* [    0],       r/w,       0x0 */
            uint32_t s_frm_done_int_mask            :  1; /* [    1],       r/w,       0x0 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],      rsvd,       0x0 */
            uint32_t seq_done_int_mask              :  1; /* [    4],       r/w,       0x0 */
            uint32_t s_seq_done_int_mask            :  1; /* [    5],       r/w,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t bs_full_int_mask               :  1; /* [    8],       r/w,       0x0 */
            uint32_t s_bs_full_int_mask             :  1; /* [    9],       r/w,       0x0 */
            uint32_t reserved_10_31                 : 22; /* [31:10],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_int_mask;

    /* 0x10c : vdo_total_bytecount */
    union {
        struct {
            uint32_t bs_tot_bycnt                   : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_total_bytecount;

    /* 0x110 : vdo_frame_bytecount */
    union {
        struct {
            uint32_t bs_frm_bycnt                   : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_frame_bytecount;

    /* 0x114 : vdo_src_r_dbg */
    union {
        struct {
            uint32_t y_read_mbx                     : 13; /* [12: 0],         r,       0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],      rsvd,       0x0 */
            uint32_t uv_read_mbx                    : 13; /* [28:16],         r,       0x0 */
            uint32_t reserved_29                    :  1; /* [   29],      rsvd,       0x0 */
            uint32_t axi_r_idle                     :  1; /* [   30],         r,       0x0 */
            uint32_t src_wr_ov_rd                   :  1; /* [   31],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_src_r_dbg;

    /* 0x118 : vdo_core_dbg */
    union {
        struct {
            uint32_t core_mbx                       :  7; /* [ 6: 0],         r,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t core_mby                       :  7; /* [14: 8],         r,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t m_core_idle                    :  1; /* [   16],         r,       0x1 */
            uint32_t s_core_idle                    :  1; /* [   17],         r,       0x1 */
            uint32_t reserved_18_19                 :  2; /* [19:18],      rsvd,       0x0 */
            uint32_t se_fsm                         :  5; /* [24:20],         r,       0x0 */
            uint32_t reserved_25_28                 :  4; /* [28:25],      rsvd,       0x0 */
            uint32_t oclk_en                        :  1; /* [   29],         r,       0x0 */
            uint32_t timeout_state                  :  1; /* [   30],         r,       0x0 */
            uint32_t mem_ctrl_idle                  :  1; /* [   31],         r,       0x1 */
        }BF;
        uint32_t WORD;
    } vdo_core_dbg;

    /* 0x11c : vdo_ctrl_dbg */
    union {
        struct {
            uint32_t ctrl_state                     :  3; /* [ 2: 0],         r,       0x0 */
            uint32_t h264_proc                      :  1; /* [    3],         r,       0x0 */
            uint32_t s_ctrl_state                   :  3; /* [ 6: 4],         r,       0x0 */
            uint32_t s_h264_proc                    :  1; /* [    7],         r,       0x0 */
            uint32_t ctrl_ce                        :  1; /* [    8],         r,       0x0 */
            uint32_t reserved_9_11                  :  3; /* [11: 9],      rsvd,       0x0 */
            uint32_t stream_idx                     :  1; /* [   12],         r,       0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],      rsvd,       0x0 */
            uint32_t ctrler_frm_cnt                 :  8; /* [23:16],         r,       0x0 */
            uint32_t s_ctrler_frm_cnt               :  8; /* [31:24],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_ctrl_dbg;

    /* 0x120 : vdo_checksum_0 */
    union {
        struct {
            uint32_t vdo0_axi_rdata_chksum          : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_checksum_0;

    /* 0x124 : vdo_checksum_1 */
    union {
        struct {
            uint32_t vdo0_axi_wdata_chksum          : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_checksum_1;

