sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x128 : vdo_checksum_2 */
    union {
        struct {
            uint32_t vdo1_axi_rdata_chksum          : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_checksum_2;

    /* 0x12c : vdo_checksum_3 */
    union {
        struct {
            uint32_t vdo1_axi_wdata_chksum          : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_checksum_3;

    /* 0x130 : vdo_checksum_4 */
    union {
        struct {
            uint32_t ld_yblk_chksum                 : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_checksum_4;

    /* 0x134 : vdo_checksum_5 */
    union {
        struct {
            uint32_t ld_cblk_chksum                 : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_checksum_5;

    /* 0x138 : vdo_checksum_6 */
    union {
        struct {
            uint32_t mem_din_chksum                 : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_checksum_6;

    /* 0x13c : vdo_checksum_7 */
    union {
        struct {
            uint32_t mem_dout_chksum                : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_checksum_7;

    /* 0x140 : vdo_reserved */
    union {
        struct {
            uint32_t vdo_reserved                   : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_reserved;

    /* 0x144 : h264_y_frame_mem_size */
    union {
        struct {
            uint32_t cfg_mem_bcnt_y                 : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_y_frame_mem_size;

    /* 0x148 : h264_uv_frame_mem_size */
    union {
        struct {
            uint32_t cfg_mem_bcnt_uv                : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_uv_frame_mem_size;

    /* 0x14c : h264_s_frame_size */
    union {
        struct {
            uint32_t cfg_s_frame_width              : 11; /* [10: 0],       r/w,       0x0 */
            uint32_t reserved_11_15                 :  5; /* [15:11],      rsvd,       0x0 */
            uint32_t cfg_s_frame_height             : 11; /* [26:16],       r/w,       0x0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_frame_size;

    /* 0x150 : h264_s_frame_base_addr_y */
    union {
        struct {
            uint32_t cfg_s_frame_base_addr_y        : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_frame_base_addr_y;

    /* 0x154 : h264_s_frame_base_addr_uv */
    union {
        struct {
            uint32_t cfg_s_frame_base_addr_uv       : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_frame_base_addr_uv;

    /* 0x158 : h264_s_y_frame_mem_size */
    union {
        struct {
            uint32_t cfg_s_mem_bcnt_y               : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_y_frame_mem_size;

    /* 0x15c : h264_s_uv_frame_mem_size */
    union {
        struct {
            uint32_t cfg_s_mem_bcnt_uv              : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_uv_frame_mem_size;

    /* 0x160 : h264_s_bs_base_addr */
    union {
        struct {
            uint32_t cfg_s_bs_base_addr             : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_bs_base_addr;

    /* 0x164 : vdo_reserved2 */
    union {
        struct {
            uint32_t vdo_reserved2                  : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_reserved2;

    /* 0x168 : h264_s_bs_size */
    union {
        struct {
            uint32_t cfg_s_bs_size                  : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_bs_size;

    /* 0x16c : h264_s_bs_full_thr */
    union {
        struct {
            uint32_t cfg_s_bs_full_thr              : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_bs_full_thr;

    /* 0x170 : h264_s_src_bf_height */
    union {
        struct {
            uint32_t cfg_s_c_src_bf_height          : 15; /* [14: 0],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_s_y_src_bf_height          : 15; /* [30:16],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_src_bf_height;

    /* 0x174 : s_padding_ctrl */
    union {
        struct {
            uint32_t s_y_padding_pixel              :  8; /* [ 7: 0],       r/w,       0x0 */
            uint32_t s_u_padding_pixel              :  8; /* [15: 8],       r/w,      0x80 */
            uint32_t s_v_padding_pixel              :  8; /* [23:16],       r/w,      0x80 */
            uint32_t s_y_line_pad                   :  5; /* [28:24],       r/w,       0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } s_padding_ctrl;

    /* 0x178 : vdo_s_total_bytecount */
    union {
        struct {
            uint32_t s_bs_tot_bycnt                 : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_total_bytecount;

    /* 0x17c : vdo_s_frame_bytecount */
    union {
        struct {
            uint32_t s_bs_frm_bycnt                 : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_frame_bytecount;

    /* 0x180 : vdo_s_src_r_dbg */
    union {
        struct {
            uint32_t s_y_read_mbx                   : 13; /* [12: 0],         r,       0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],      rsvd,       0x0 */
            uint32_t s_uv_read_mbx                  : 13; /* [28:16],         r,       0x0 */
            uint32_t reserved_29                    :  1; /* [   29],      rsvd,       0x0 */
            uint32_t s_axi_r_idle                   :  1; /* [   30],         r,       0x0 */
            uint32_t s_src_wr_ov_rd                 :  1; /* [   31],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_src_r_dbg;

    /* 0x184 : vdo_src_sta_clr */
    union {
        struct {
            uint32_t src_uv_wovr_clr                :  1; /* [    0],       w1p,       0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],      rsvd,       0x0 */
            uint32_t src_y_wovr_clr                 :  1; /* [    4],       w1p,       0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],      rsvd,       0x0 */
            uint32_t s_src_uv_wovr_clr              :  1; /* [    8],       w1p,       0x0 */
            uint32_t reserved_9_11                  :  3; /* [11: 9],      rsvd,       0x0 */
            uint32_t s_src_y_wovr_clr               :  1; /* [   12],       w1p,       0x0 */
            uint32_t reserved_13_31                 : 19; /* [31:13],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_src_sta_clr;

    /* 0x188 : vdo_src_ctrl */
    union {
        struct {
            uint32_t frm_buf_num                    :  4; /* [ 3: 0],       r/w,       0x0 */
            uint32_t mfrm_buf_en                    :  1; /* [    4],       r/w,       0x0 */
            uint32_t req_period                     : 10; /* [14: 5],       r/w,       0x0 */
            uint32_t no_wait_1st_vsync              :  1; /* [   15],       r/w,       0x0 */
            uint32_t s_frm_buf_num                  :  4; /* [19:16],       r/w,       0x0 */
            uint32_t s_mfrm_buf_en                  :  1; /* [   20],       r/w,       0x0 */
            uint32_t s_req_period                   : 10; /* [30:21],       r/w,       0x0 */
            uint32_t s_no_wait_1st_vsync            :  1; /* [   31],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_src_ctrl;

    /* 0x18c : h264_refy0_base_addr */
    union {
        struct {
            uint32_t cfg_refy0_base_addr            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_refy0_base_addr;

