sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x190 : h264_refu0_base_addr */
    union {
        struct {
            uint32_t cfg_refu0_base_addr            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_refu0_base_addr;

    /* 0x194 : h264_refv0_base_addr */
    union {
        struct {
            uint32_t cfg_refv0_base_addr            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_refv0_base_addr;

    /* 0x198 : h264_refy1_base_addr */
    union {
        struct {
            uint32_t cfg_refy1_base_addr            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_refy1_base_addr;

    /* 0x19c : h264_refu1_base_addr */
    union {
        struct {
            uint32_t cfg_refu1_base_addr            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_refu1_base_addr;

    /* 0x1a0 : h264_refv1_base_addr */
    union {
        struct {
            uint32_t cfg_refv1_base_addr            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_refv1_base_addr;

    /* 0x1a4 : h264_ext_base_addr */
    union {
        struct {
            uint32_t cfg_ext_base_addr              : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_ext_base_addr;

    /* 0x1a8 : h264_s_refy0_base_addr */
    union {
        struct {
            uint32_t cfg_s_refy0_base_addr          : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_refy0_base_addr;

    /* 0x1ac : h264_s_refu0_base_addr */
    union {
        struct {
            uint32_t cfg_s_refu0_base_addr          : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_refu0_base_addr;

    /* 0x1b0 : h264_s_refv0_base_addr */
    union {
        struct {
            uint32_t cfg_s_refv0_base_addr          : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_refv0_base_addr;

    /* 0x1b4 : h264_s_refy1_base_addr */
    union {
        struct {
            uint32_t cfg_s_refy1_base_addr          : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_refy1_base_addr;

    /* 0x1b8 : h264_s_refu1_base_addr */
    union {
        struct {
            uint32_t cfg_s_refu1_base_addr          : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_refu1_base_addr;

    /* 0x1bc : h264_s_refv1_base_addr */
    union {
        struct {
            uint32_t cfg_s_refv1_base_addr          : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_refv1_base_addr;

    /* 0x1c0 : h264_s_ext_base_addr */
    union {
        struct {
            uint32_t cfg_s_ext_base_addr            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_ext_base_addr;

    /* 0x1c4 : vdo_core_dbg2 */
    union {
        struct {
            uint32_t pframe                         :  1; /* [    0],         r,       0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],      rsvd,       0x0 */
            uint32_t pframe_cnt                     : 10; /* [13: 4],         r,       0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t tclock                         : 10; /* [25:16],         r,       0x0 */
            uint32_t r_yref_wait                    :  1; /* [   26],         r,       0x0 */
            uint32_t r_vref_wait                    :  1; /* [   27],         r,       0x0 */
            uint32_t w_yrec_wait                    :  1; /* [   28],         r,       0x0 */
            uint32_t pfch_vbuf_wait                 :  1; /* [   29],         r,       0x0 */
            uint32_t cabac_wait                     :  1; /* [   30],         r,       0x0 */
            uint32_t enc_busy                       :  1; /* [   31],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_core_dbg2;

    /* 0x1c8 : vdo_s_core_dbg2 */
    union {
        struct {
            uint32_t s_pframe                       :  1; /* [    0],         r,       0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],      rsvd,       0x0 */
            uint32_t s_pframe_cnt                   : 10; /* [13: 4],         r,       0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t s_tclock                       : 10; /* [25:16],         r,       0x0 */
            uint32_t s_r_yref_wait                  :  1; /* [   26],         r,       0x0 */
            uint32_t s_r_vref_wait                  :  1; /* [   27],         r,       0x0 */
            uint32_t s_w_yrec_wait                  :  1; /* [   28],         r,       0x0 */
            uint32_t s_pfch_vbuf_wait               :  1; /* [   29],         r,       0x0 */
            uint32_t s_cabac_wait                   :  1; /* [   30],         r,       0x0 */
            uint32_t s_enc_busy                     :  1; /* [   31],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_core_dbg2;

    /* 0x1cc : h264_y_srcbf_size */
    union {
        struct {
            uint32_t cfg_y_srcbf_bycnt              : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_y_srcbf_size;

    /* 0x1d0 : h264_uv_srcbf_size */
    union {
        struct {
            uint32_t cfg_uv_srcbf_bycnt             : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_uv_srcbf_size;

    /* 0x1d4 : h264_s_y_srcbf_size */
    union {
        struct {
            uint32_t cfg_s_y_srcbf_bycnt            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_y_srcbf_size;

    /* 0x1d8 : h264_s_uv_srcbf_size */
    union {
        struct {
            uint32_t cfg_s_uv_srcbf_bycnt           : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_uv_srcbf_size;

    /* 0x1dc : h264_src_dbg */
    union {
        struct {
            uint32_t d2b_sync_en                    :  1; /* [    0],       r/w,       0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],      rsvd,       0x0 */
            uint32_t old_read_mode                  :  5; /* [ 8: 4],       r/w,       0x0 */
            uint32_t reserved_9_15                  :  7; /* [15: 9],      rsvd,       0x0 */
            uint32_t s_d2b_sync_en                  :  1; /* [   16],       r/w,       0x0 */
            uint32_t reserved_17_19                 :  3; /* [19:17],      rsvd,       0x0 */
            uint32_t s_old_read_mode                :  5; /* [24:20],       r/w,       0x0 */
            uint32_t reserved_25_31                 :  7; /* [31:25],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_src_dbg;

    /* 0x1e0 : h264_yy_d2b_addr */
    union {
        struct {
            uint32_t yy_d2b_addr_dbg                : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_yy_d2b_addr;

