sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x1e4 : h264_uv_d2b_addr */
    union {
        struct {
            uint32_t uv_d2b_addr_dbg                : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_uv_d2b_addr;

    /* 0x1e8 : h264_yy_ofst_addr */
    union {
        struct {
            uint32_t yy_mfrm_ofst_dbg               : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_yy_ofst_addr;

    /* 0x1ec : h264_uv_ofst_addr */
    union {
        struct {
            uint32_t uv_mfrm_ofst_dbg               : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_uv_ofst_addr;

    /* 0x1f0 : h264_d2b_ml */
    union {
        struct {
            uint32_t yy_d2b_ml_dbg                  : 16; /* [15: 0],         r,       0x0 */
            uint32_t uv_d2b_ml_dbg                  : 16; /* [31:16],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_d2b_ml;

    /* 0x1f4 : h264_load_mbidx_dbg */
    union {
        struct {
            uint32_t load_mbidx_dbg                 : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_load_mbidx_dbg;

    /* 0x1f8 : h264_yc_mb_err */
    union {
        struct {
            uint32_t yc_mb_err                      :  3; /* [ 2: 0],         r,       0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_yc_mb_err;

    /* 0x1fc : h264_s_yy_d2b_addr */
    union {
        struct {
            uint32_t s_yy_d2b_addr_dbg              : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_yy_d2b_addr;

    /* 0x200 : h264_s_uv_d2b_addr */
    union {
        struct {
            uint32_t s_uv_d2b_addr_dbg              : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_uv_d2b_addr;

    /* 0x204 : h264_s_yy_ofst_addr */
    union {
        struct {
            uint32_t s_yy_mfrm_ofst_dbg             : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_yy_ofst_addr;

    /* 0x208 : h264_s_uv_ofst_addr */
    union {
        struct {
            uint32_t s_uv_mfrm_ofst_dbg             : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_uv_ofst_addr;

    /* 0x20c : h264_s_d2b_ml */
    union {
        struct {
            uint32_t s_yy_d2b_ml_dbg                : 16; /* [15: 0],         r,       0x0 */
            uint32_t s_uv_d2b_ml_dbg                : 16; /* [31:16],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_d2b_ml;

    /* 0x210 : h264_s_load_mbidx_dbg */
    union {
        struct {
            uint32_t s_load_mbidx_dbg               : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_load_mbidx_dbg;

    /* 0x214 : h264_s_yc_mb_err */
    union {
        struct {
            uint32_t s_yc_mb_err                    :  3; /* [ 2: 0],         r,       0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_yc_mb_err;

    /* 0x218 : reserved */
    uint8_t reserved536[16];

    /* 0x228 : h264_pfch_ctrl */
    union {
        struct {
            uint32_t cfg_pfch_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_pfch_mby_s                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_pfch_en                    :  1; /* [   16],       r/w,       0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_pfch_ctrl;

    /* 0x22c : h264_pfch_base */
    union {
        struct {
            uint32_t cfg_pfch_base_addr             : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_pfch_base;

    /* 0x230 : h264_pfchv_base */
    union {
        struct {
            uint32_t cfg_pfchv_base_addr            : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_pfchv_base;

    /* 0x234 : h264_s_pfch_ctrl */
    union {
        struct {
            uint32_t cfg_s_pfch_mbx_s               :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_s_pfch_mby_s               :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_s_pfch_en                  :  1; /* [   16],       r/w,       0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_pfch_ctrl;

    /* 0x238 : h264_s_pfch_base */
    union {
        struct {
            uint32_t cfg_s_pfch_base_addr           : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_pfch_base;

    /* 0x23c : h264_s_pfchv_base */
    union {
        struct {
            uint32_t cfg_s_pfchv_base_addr          : 32; /* [31: 0],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_pfchv_base;

    /* 0x240 : h264_hwback_mode */
    union {
        struct {
            uint32_t cfg_sramck_mode                :  1; /* [    0],       r/w,       0x0 */
            uint32_t cfg_nal_mp_mode                :  1; /* [    1],       r/w,       0x0 */
            uint32_t cfg_s_nal_mp_mode              :  1; /* [    2],       r/w,       0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_hwback_mode;

    /* 0x244 : h264_roi_mode */
    union {
        struct {
            uint32_t cfg_roi_en                     :  8; /* [ 7: 0],       r/w,       0x0 */
            uint32_t cfg_roi_upd                    :  1; /* [    8],       w1p,       0x0 */
            uint32_t reserved_9_31                  : 23; /* [31: 9],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi_mode;

    /* 0x248 : h264_roi_bit */
    union {
        struct {
            uint32_t cfg_pbit_ratio                 : 13; /* [12: 0],       r/w,     0x400 */
            uint32_t cfg_ibit_ratio                 : 13; /* [25:13],       r/w,     0x400 */
            uint32_t cfg_ithre                      :  6; /* [31:26],       r/w,      0x20 */
        }BF;
        uint32_t WORD;
    } h264_roi_bit;

