sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x24c : h264_roi_qptune */
    union {
        struct {
            uint32_t cfg_pqp_decr                   :  6; /* [ 5: 0],       r/w,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t cfg_iqp_decr                   :  6; /* [13: 8],       r/w,       0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t cfg_n2r_qp_decr                :  6; /* [21:16],       r/w,       0x0 */
            uint32_t reserved_22_23                 :  2; /* [23:22],      rsvd,       0x0 */
            uint32_t cfg_fixqp                      :  6; /* [29:24],       r/w,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi_qptune;

    /* 0x250 : h264_roi_bittune */
    union {
        struct {
            uint32_t cfg_roi_pbit_ofst              :  5; /* [ 4: 0],       r/w,       0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],      rsvd,       0x0 */
            uint32_t cfg_roi_ibit_ofst              :  8; /* [15: 8],       r/w,       0x0 */
            uint32_t cfg_nroi_pbit_ofst             :  5; /* [20:16],       r/w,       0x0 */
            uint32_t reserved_21_23                 :  3; /* [23:21],      rsvd,       0x0 */
            uint32_t cfg_nroi_ibit_ofst             :  8; /* [31:24],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi_bittune;

    /* 0x254 : h264_roi0 */
    union {
        struct {
            uint32_t cfg_roi0_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_roi0_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_roi0_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_roi0_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi0;

    /* 0x258 : h264_roi1 */
    union {
        struct {
            uint32_t cfg_roi1_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_roi1_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_roi1_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_roi1_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi1;

    /* 0x25c : h264_roi2 */
    union {
        struct {
            uint32_t cfg_roi2_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_roi2_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_roi2_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_roi2_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi2;

    /* 0x260 : h264_roi3 */
    union {
        struct {
            uint32_t cfg_roi3_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_roi3_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_roi3_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_roi3_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi3;

    /* 0x264 : h264_roi4 */
    union {
        struct {
            uint32_t cfg_roi4_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_roi4_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_roi4_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_roi4_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi4;

    /* 0x268 : h264_roi5 */
    union {
        struct {
            uint32_t cfg_roi5_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_roi5_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_roi5_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_roi5_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi5;

    /* 0x26c : h264_roi6 */
    union {
        struct {
            uint32_t cfg_roi6_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_roi6_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_roi6_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_roi6_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi6;

    /* 0x270 : h264_roi7 */
    union {
        struct {
            uint32_t cfg_roi7_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_roi7_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_roi7_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_roi7_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_roi7;

    /* 0x274 : h264_s_roi_mode */
    union {
        struct {
            uint32_t cfg_s_roi_en                   :  8; /* [ 7: 0],       r/w,       0x0 */
            uint32_t cfg_s_roi_upd                  :  1; /* [    8],       w1p,       0x0 */
            uint32_t reserved_9_31                  : 23; /* [31: 9],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_roi_mode;

