sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x2a0 : reserved */
    uint8_t reserved672[96];

    /* 0x300 : h264_s_roi7 */
    union {
        struct {
            uint32_t cfg_s_roi7_mbx_s               :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_s_roi7_mbx_e               :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_s_roi7_mby_s               :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_s_roi7_mby_e               :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_s_roi7;

    /* 0x304 : h264_osd_en */
    union {
        struct {
            uint32_t cfg_osd_en                     : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t cfg_osd_mssel                  : 16; /* [31:16],       r/w,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd_en;

    /* 0x308 : h264_osd0 */
    union {
        struct {
            uint32_t cfg_osd0_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd0_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd0_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd0_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd0;

    /* 0x30c : h264_osd1 */
    union {
        struct {
            uint32_t cfg_osd1_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd1_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd1_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd1_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd1;

    /* 0x310 : h264_osd2 */
    union {
        struct {
            uint32_t cfg_osd2_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd2_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd2_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd2_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd2;

    /* 0x314 : h264_osd3 */
    union {
        struct {
            uint32_t cfg_osd3_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd3_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd3_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd3_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd3;

    /* 0x318 : h264_osd4 */
    union {
        struct {
            uint32_t cfg_osd4_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd4_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd4_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd4_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd4;

    /* 0x31c : h264_osd5 */
    union {
        struct {
            uint32_t cfg_osd5_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd5_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd5_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd5_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd5;

    /* 0x320 : h264_osd6 */
    union {
        struct {
            uint32_t cfg_osd6_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd6_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd6_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd6_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd6;

    /* 0x324 : h264_osd7 */
    union {
        struct {
            uint32_t cfg_osd7_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd7_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd7_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd7_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd7;

    /* 0x328 : h264_osd8 */
    union {
        struct {
            uint32_t cfg_osd8_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd8_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd8_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd8_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd8;

    /* 0x32c : h264_osd9 */
    union {
        struct {
            uint32_t cfg_osd9_mbx_s                 :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd9_mbx_e                 :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd9_mby_s                 :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd9_mby_e                 :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd9;

