sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x330 : h264_osd10 */
    union {
        struct {
            uint32_t cfg_osd10_mbx_s                :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd10_mbx_e                :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd10_mby_s                :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd10_mby_e                :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd10;

    /* 0x334 : h264_osd11 */
    union {
        struct {
            uint32_t cfg_osd11_mbx_s                :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd11_mbx_e                :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd11_mby_s                :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd11_mby_e                :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd11;

    /* 0x338 : h264_osd12 */
    union {
        struct {
            uint32_t cfg_osd12_mbx_s                :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd12_mbx_e                :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd12_mby_s                :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd12_mby_e                :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd12;

    /* 0x33c : h264_osd13 */
    union {
        struct {
            uint32_t cfg_osd13_mbx_s                :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd13_mbx_e                :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd13_mby_s                :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd13_mby_e                :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd13;

    /* 0x340 : h264_osd14 */
    union {
        struct {
            uint32_t cfg_osd14_mbx_s                :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd14_mbx_e                :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd14_mby_s                :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd14_mby_e                :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd14;

    /* 0x344 : h264_osd15 */
    union {
        struct {
            uint32_t cfg_osd15_mbx_s                :  7; /* [ 6: 0],       r/w,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t cfg_osd15_mbx_e                :  7; /* [14: 8],       r/w,       0x0 */
            uint32_t reserved_15                    :  1; /* [   15],      rsvd,       0x0 */
            uint32_t cfg_osd15_mby_s                :  7; /* [22:16],       r/w,       0x0 */
            uint32_t reserved_23                    :  1; /* [   23],      rsvd,       0x0 */
            uint32_t cfg_osd15_mby_e                :  7; /* [30:24],       r/w,       0x0 */
            uint32_t reserved_31                    :  1; /* [   31],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_osd15;

    /* 0x348 : h264_mv0_en */
    union {
        struct {
            uint32_t cfg_mv0_en                     :  1; /* [    0],       r/w,       0x0 */
            uint32_t cfg_s_mv0_en                   :  1; /* [    1],       r/w,       0x0 */
            uint32_t reserved_2_31                  : 30; /* [31: 2],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } h264_mv0_en;

    /* 0x34c : pfch_dbg_reqcnt */
    union {
        struct {
            uint32_t dbg_reqcnt                     : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_dbg_reqcnt;

    /* 0x350 : pfch_dbg_rcmd */
    union {
        struct {
            uint32_t dbg_rcmd                       : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_dbg_rcmd;

    /* 0x354 : pfch_dbg_wcmd */
    union {
        struct {
            uint32_t dbg_wcmd                       : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_dbg_wcmd;

    /* 0x358 : pfch_dbg_wdata */
    union {
        struct {
            uint32_t dbg_wdata                      : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_dbg_wdata;

    /* 0x35c : pfch_dbg_pfchsta */
    union {
        struct {
            uint32_t dbg_pfchsta                    : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_dbg_pfchsta;

    /* 0x360 : pfchv_dbg_reqcnt */
    union {
        struct {
            uint32_t dbgv_reqcnt                    : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_dbg_reqcnt;

