sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x364 : pfchv_dbg_rcmd */
    union {
        struct {
            uint32_t dbgv_rcmd                      : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_dbg_rcmd;

    /* 0x368 : pfchv_dbg_wcmd */
    union {
        struct {
            uint32_t dbgv_wcmd                      : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_dbg_wcmd;

    /* 0x36c : pfchv_dbg_wdata */
    union {
        struct {
            uint32_t dbgv_wdata                     : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_dbg_wdata;

    /* 0x370 : pfchv_dbg_pfchsta */
    union {
        struct {
            uint32_t dbgv_pfchsta                   : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_dbg_pfchsta;

    /* 0x374 : pfch_s_dbg_reqcnt */
    union {
        struct {
            uint32_t s_dbg_reqcnt                   : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_s_dbg_reqcnt;

    /* 0x378 : pfch_s_dbg_rcmd */
    union {
        struct {
            uint32_t s_dbg_rcmd                     : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_s_dbg_rcmd;

    /* 0x37c : pfch_s_dbg_wcmd */
    union {
        struct {
            uint32_t s_dbg_wcmd                     : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_s_dbg_wcmd;

    /* 0x380 : pfch_s_dbg_wdata */
    union {
        struct {
            uint32_t s_dbg_wdata                    : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_s_dbg_wdata;

    /* 0x384 : pfch_s_dbg_pfchsta */
    union {
        struct {
            uint32_t s_dbg_pfchsta                  : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfch_s_dbg_pfchsta;

    /* 0x388 : pfchv_s_dbg_reqcnt */
    union {
        struct {
            uint32_t s_dbgv_reqcnt                  : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_s_dbg_reqcnt;

    /* 0x38c : pfchv_s_dbg_rcmd */
    union {
        struct {
            uint32_t s_dbgv_rcmd                    : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_s_dbg_rcmd;

    /* 0x390 : pfchv_s_dbg_wcmd */
    union {
        struct {
            uint32_t s_dbgv_wcmd                    : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_s_dbg_wcmd;

    /* 0x394 : pfchv_s_dbg_wdata */
    union {
        struct {
            uint32_t s_dbgv_wdata                   : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_s_dbg_wdata;

    /* 0x398 : pfchv_s_dbg_pfchsta */
    union {
        struct {
            uint32_t s_dbgv_pfchsta                 : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } pfchv_s_dbg_pfchsta;

    /* 0x39c : vdonr */
    union {
        struct {
            uint32_t noiselevel                     :  6; /* [ 5: 0],       r/w,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t temperalfilterstrength         :  4; /* [11: 8],       r/w,       0x5 */
            uint32_t reserved_12_15                 :  4; /* [15:12],      rsvd,       0x0 */
            uint32_t s_noiselevel                   :  6; /* [21:16],       r/w,       0x0 */
            uint32_t reserved_22_23                 :  2; /* [23:22],      rsvd,       0x0 */
            uint32_t s_temperalfilterstrength       :  4; /* [27:24],       r/w,       0x5 */
            uint32_t reserved_28_31                 :  4; /* [31:28],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr;

    /* 0x3a0 : vdonr_mvctrl */
    union {
        struct {
            uint32_t zmv_pflevel                    : 17; /* [16: 0],       r/w,       0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_mvctrl;

    /* 0x3a4 : vdonr_sta_ctrl */
    union {
        struct {
            uint32_t ysmlr_thr                      : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_sta_ctrl;

    /* 0x3a8 : vdonr_absmv_sum */
    union {
        struct {
            uint32_t absmv_sum                      : 22; /* [21: 0],         r,       0x0 */
            uint32_t reserved_22_31                 : 10; /* [31:22],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_absmv_sum;

    /* 0x3ac : vdonr_mvlevel */
    union {
        struct {
            uint32_t nzmv_mbcnt                     : 14; /* [13: 0],         r,       0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t ysmlr_mbcnt                    : 14; /* [29:16],         r,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_mvlevel;

    /* 0x3b0 : vdonr_pmbsad */
    union {
        struct {
            uint32_t pmb_sad                        : 30; /* [29: 0],         r,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_pmbsad;

    /* 0x3b4 : vdonr_imbcnt */
    union {
        struct {
            uint32_t intra_mbcnt                    : 14; /* [13: 0],         r,       0x0 */
            uint32_t reserved_14_31                 : 18; /* [31:14],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_imbcnt;

    /* 0x3b8 : vdonr_s_mvctrl */
    union {
        struct {
            uint32_t s_zmv_pflevel                  : 17; /* [16: 0],       r/w,       0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_s_mvctrl;

    /* 0x3bc : vdonr_s_sta_ctrl */
    union {
        struct {
            uint32_t s_ysmlr_thr                    : 16; /* [15: 0],       r/w,       0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_s_sta_ctrl;

    /* 0x3c0 : vdonr_s_absmv_sum */
    union {
        struct {
            uint32_t s_absmv_sum                    : 22; /* [21: 0],         r,       0x0 */
            uint32_t reserved_22_31                 : 10; /* [31:22],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_s_absmv_sum;

