sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/vdo_reg.h
    /* 0x3c4 : vdonr_s_mvlevel */
    union {
        struct {
            uint32_t s_nzmv_mbcnt                   : 14; /* [13: 0],         r,       0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],      rsvd,       0x0 */
            uint32_t s_ysmlr_mbcnt                  : 14; /* [29:16],         r,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_s_mvlevel;

    /* 0x3c8 : vdonr_s_pmbsad */
    union {
        struct {
            uint32_t s_pmb_sad                      : 30; /* [29: 0],         r,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_s_pmbsad;

    /* 0x3cc : vdonr_s_imbcnt */
    union {
        struct {
            uint32_t s_intra_mbcnt                  : 14; /* [13: 0],         r,       0x0 */
            uint32_t reserved_14_31                 : 18; /* [31:14],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdonr_s_imbcnt;

    /* 0x3d0 : vdo_stuf_dbg */
    union {
        struct {
            uint32_t pic_bycnt                      : 26; /* [25: 0],         r,       0x0 */
            uint32_t pic_bycnt_ovf                  :  1; /* [   26],         r,       0x0 */
            uint32_t stuf_ovf                       :  1; /* [   27],         r,       0x0 */
            uint32_t bincnt_ovf                     :  1; /* [   28],         r,       0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_stuf_dbg;

    /* 0x3d4 : vdo_nal_dbg1 */
    union {
        struct {
            uint32_t stuf_cnt                       : 26; /* [25: 0],         r,       0x0 */
            uint32_t sh_state                       :  6; /* [31:26],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_nal_dbg1;

    /* 0x3d8 : vdo_nal_dbg2 */
    union {
        struct {
            uint32_t bincntx3                       : 30; /* [29: 0],         r,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_nal_dbg2;

    /* 0x3dc : vdo_nal_dbg3 */
    union {
        struct {
            uint32_t mp_mbx                         :  7; /* [ 6: 0],         r,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t mp_mby                         :  7; /* [14: 8],         r,       0x0 */
            uint32_t reserved_15_31                 : 17; /* [31:15],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_nal_dbg3;

    /* 0x3e0 : vdo_roi_dbg */
    union {
        struct {
            uint32_t roi_pmbbits                    : 12; /* [11: 0],         r,       0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],      rsvd,       0x0 */
            uint32_t nroi_pmbbits                   : 12; /* [27:16],         r,       0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_roi_dbg;

    /* 0x3e4 : vdo_rc_dbg */
    union {
        struct {
            uint32_t rc_min_qp                      :  6; /* [ 5: 0],         r,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t rc_qp                          :  6; /* [13: 8],         r,       0x0 */
            uint32_t reserved_14_31                 : 18; /* [31:14],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_rc_dbg;

    /* 0x3e8 : vdo_s_stuf_dbg */
    union {
        struct {
            uint32_t s_pic_bycnt                    : 26; /* [25: 0],         r,       0x0 */
            uint32_t s_pic_bycnt_ovf                :  1; /* [   26],         r,       0x0 */
            uint32_t s_stuf_ovf                     :  1; /* [   27],         r,       0x0 */
            uint32_t s_bincnt_ovf                   :  1; /* [   28],         r,       0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_stuf_dbg;

    /* 0x3ec : vdo_s_nal_dbg1 */
    union {
        struct {
            uint32_t s_stuf_cnt                     : 26; /* [25: 0],         r,       0x0 */
            uint32_t s_sh_state                     :  6; /* [31:26],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_nal_dbg1;

    /* 0x3f0 : vdo_s_nal_dbg2 */
    union {
        struct {
            uint32_t s_bincntx3                     : 30; /* [29: 0],         r,       0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_nal_dbg2;

    /* 0x3f4 : vdo_s_nal_dbg3 */
    union {
        struct {
            uint32_t s_mp_mbx                       :  7; /* [ 6: 0],         r,       0x0 */
            uint32_t reserved_7                     :  1; /* [    7],      rsvd,       0x0 */
            uint32_t s_mp_mby                       :  7; /* [14: 8],         r,       0x0 */
            uint32_t reserved_15_31                 : 17; /* [31:15],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_nal_dbg3;

    /* 0x3f8 : vdo_s_roi_dbg */
    union {
        struct {
            uint32_t s_roi_pmbbits                  : 12; /* [11: 0],         r,       0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],      rsvd,       0x0 */
            uint32_t s_nroi_pmbbits                 : 12; /* [27:16],         r,       0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_roi_dbg;

    /* 0x3fc : vdo_s_rc_dbg */
    union {
        struct {
            uint32_t s_rc_min_qp                    :  6; /* [ 5: 0],         r,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t s_rc_qp                        :  6; /* [13: 8],         r,       0x0 */
            uint32_t reserved_14_31                 : 18; /* [31:14],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_s_rc_dbg;

    /* 0x400 : vdo_refaxi_dbg */
    union {
        struct {
            uint32_t ref2axi_busy                   :  1; /* [    0],         r,       0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],      rsvd,       0x0 */
            uint32_t ref_rfifo_error                :  2; /* [ 5: 4],         r,       0x0 */
            uint32_t ref_wfifo_error                :  2; /* [ 7: 6],         r,       0x0 */
            uint32_t ref_rfifo_empty                :  3; /* [10: 8],         r,       0x0 */
            uint32_t reserved_11                    :  1; /* [   11],      rsvd,       0x0 */
            uint32_t ref_wfifo_empty                :  5; /* [16:12],         r,       0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_refaxi_dbg;

    /* 0x404 : vdo_pfchaxi_dbg */
    union {
        struct {
            uint32_t pfch_rfifo_busy                :  1; /* [    0],         r,       0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],      rsvd,       0x0 */
            uint32_t pfch_rfifo_error               :  2; /* [ 5: 4],         r,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t pfch_rfifo_empty               :  3; /* [10: 8],         r,       0x0 */
            uint32_t reserved_11                    :  1; /* [   11],      rsvd,       0x0 */
            uint32_t pfchv_rfifo_busy               :  1; /* [   12],         r,       0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],      rsvd,       0x0 */
            uint32_t pfchv_rfifo_error              :  2; /* [17:16],         r,       0x0 */
            uint32_t reserved_18_19                 :  2; /* [19:18],      rsvd,       0x0 */
            uint32_t pfchv_rfifo_empty              :  3; /* [22:20],         r,       0x0 */
            uint32_t reserved_23_31                 :  9; /* [31:23],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_pfchaxi_dbg;

    /* 0x408 : vdo_bsaxi_dbg */
    union {
        struct {
            uint32_t bs_wfifo_busy                  :  1; /* [    0],         r,       0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],      rsvd,       0x0 */
            uint32_t bs_wfifo_error                 :  2; /* [ 5: 4],         r,       0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],      rsvd,       0x0 */
            uint32_t bs_wfifo_empty                 :  5; /* [12: 8],         r,       0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],      rsvd,       0x0 */
            uint32_t bs_st                          :  2; /* [17:16],         r,       0x0 */
            uint32_t reserved_18_31                 : 14; /* [31:18],      rsvd,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_bsaxi_dbg;

    /* 0x40c : vdo_frame_id */
    union {
        struct {
            uint32_t frame_id                       : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } vdo_frame_id;

    /* 0x410 : s_vdo_frame_id */
    union {
        struct {
            uint32_t s_frame_id                     : 32; /* [31: 0],         r,       0x0 */
        }BF;
        uint32_t WORD;
    } s_vdo_frame_id;
};

typedef volatile struct vdo_reg vdo_reg_t;

#endif // __VDO_REG_H__